{
  "context": "CRISP recovers simulation-ready human motion and scene geometry from monocular video using planar primitive fitting and reinforcement learning, significantly reducing motion tracking failures and improving simulation throughput. We introduce CRISP, a method that recovers simulatable human motion and scene geometry from monocular video. Prior work on jointhuman-scene reconstructionrelies ondata-driven priorsandjoint optimizationwith no physics in the loop, or recovers noisy geometry with artifacts that cause motion tracking policies with scene interactions to fail. In contrast, our key insight is to recover convex, clean, and simulation-ready geometry by fittingplanar primitivesto apoint cloud reconstructionof the scene, via a simple clustering pipeline overdepth,normals, andflow. To reconstruct scene geometry that might be occluded during interactions, we make use ofhuman-scene contact modeling(e.g., we use human posture to reconstruct the occluded seat of a chair). Finally, we ensure that human and scene reconstructions are physically-plausible by using them to drive ahumanoid controllerviareinforcement learning. Our approach reduces motion tracking failure rates from 55.2\\% to 6.9\\% on human-centric video benchmarks (EMDB,PROX), while delivering a 43\\% faster RL simulation throughput. We further validate it on in-the-wild videos including casually-captured videos, Internet videos, and even Sora-generated videos. This demonstrates CRISP's ability to generatephysically-valid human motionand interaction environments at scale, greatly advancingreal-to-sim applicationsforroboticsandAR/VR. We introduce CRISP, a method that recovers simulatable human motion and scene geometry from monocular video. Prior work on joint human-scene reconstruction relies on data-driven priors and joint optimization with no physics in the loop, or recovers noisy geometry with artifacts that cause motion tracking policies with scene interactions to fail. In contrast, our key insight is to recover convex, clean, and simulation-ready geometry by fitting planar primitives to a point cloud reconstruction of the scene, via a simple clustering pipeline over depth, normals, and flow. To reconstruct scene geometry that might be occluded during interactions, we make use of human-scene contact modeling (e.g., we use human posture to reconstruct the occluded seat of a chair).Finally, we ensure that human and scene reconstructions are physically-plausible by using them to drive a humanoid controller via reinforcement learning. Our approach reduces motion tracking failure rates from 55.2% to 6.9% on human-centric video benchmarks (EMDB, PROX), while delivering a 43% faster RL simulation throughput. We further validate it on in-the-wild videos including casually-captured videos, Internet videos, and even Sora-generated videos. This demonstrates CRISP's ability to generate physically-valid human motion and interaction environments at scale, greatly advancing real-to-sim applications for robotics and AR/VR. Code and interactive demos are available at our project website: \\href{https://crisp-real2sim.github.io/CRISP-Real2Sim/}{\\textcolor{cyan}{{crisp-real2sim.github.io/CRISP-Real2Sim}}}. Very cool ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2551097",
    "title": "CRISP: Contact-Guided Real2Sim from Monocular Video with Planar Scene Primitives",
    "authors": [
      "Zihan Wang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/Z1hanW/CRISP-Real2Sim",
    "huggingface_url": "https://huggingface.co/papers/2512.14696",
    "upvote": 7
  }
}