{
  "context": "Reinforcement learning with verifiable rewards improves LLM reasoning through spurious rewards and entropy minimization, despite seemingly paradoxical effects, by reducing clipping bias and policy entropy. This paper examines the exploration-exploitation trade-off inreinforcement learningwithverifiable rewards(RLVR), a framework for improving the reasoning ofLarge Language Models(LLMs). Recent studies suggest thatRLVRcan elicit strong mathematical reasoning inLLMsthrough two seemingly paradoxical mechanisms:spurious rewards, which suppress exploitation by rewarding outcomes unrelated to the ground truth, andentropy minimization, which suppresses exploration by pushing the model toward more confident and deterministic outputs, highlighting a puzzling dynamic: both discouraging exploitation and discouraging exploration improve reasoning performance, yet the underlying principles that reconcile these effects remain poorly understood. We focus on two fundamental questions: (i) howpolicy entropyrelates to performance, and (ii) whetherspurious rewardsyield gains, potentially through the interplay ofclipping biasand model contamination. Our results show thatclipping biasunderspurious rewardsreducespolicy entropy, leading to more confident and deterministic outputs, whileentropy minimizationalone is insufficient for improvement. We further propose areward-misalignment modelexplaining whyspurious rewardscan enhance performance beyond contaminated settings. Our findings clarify the mechanisms behind spurious-reward benefits and provide principles for more effectiveRLVRtraining. This paper examines the exploration-exploitation trade-off in reinforcement learning with verifiable rewards (RLVR), a framework for improving the reasoning of Large Language Models (LLMs). Recent studies suggest that RLVR can elicit strong mathematical reasoning in LLMs through two seemingly paradoxical mechanisms: spurious rewards, which suppress exploitation by rewarding outcomes unrelated to the ground truth, and entropy minimization, which suppresses exploration by pushing the model toward more confident and deterministic outputs, highlighting a puzzling dynamic: both discouraging exploitation and discouraging exploration improve reasoning performance, yet the underlying principles that reconcile these effects remain poorly understood. We focus on two fundamental questions: (i) how policy entropy relates to performance, and (ii) whether spurious rewards yield gains, potentially through the interplay of clipping bias and model contamination. Our results show that clipping bias under spurious rewards reduces policy entropy, leading to more confident and deterministic outputs, while entropy minimization alone is insufficient for improvement. We further propose a reward-misalignment model explaining why spurious rewards can enhance performance beyond contaminated settings. Our findings clarify the mechanisms behind spurious-reward benefits and provide principles for more effective RLVR training. arXiv lens breakdown of this paper 👉https://arxivlens.com/PaperView/Details/exploration-v-s-exploitation-rethinking-rlvr-through-clipping-entropy-and-spurious-reward-9499-c7bdd711 ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2551077",
    "title": "Exploration v.s. Exploitation: Rethinking RLVR through Clipping, Entropy, and Spurious Reward",
    "authors": [
      "Peter Chen"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2512.16912",
    "upvote": 10
  }
}