{
  "context": "A large-scale multimodal model called Insight Miner is proposed for generating comprehensive time-series descriptions enriched with domain-specific knowledge, utilizing a novel agentic workflow and a newly constructed dataset for time series and language alignment. Time-series datais critical across many scientific and industrial domains, including environmental analysis, agriculture, transportation, and finance. However, mining insights from this data typically requires deep domain expertise, a process that is both time-consuming and labor-intensive. In this paper, we propose Insight Miner, a large-scalemultimodal model(LMM) designed to generate high-quality, comprehensive time-series descriptions enriched withdomain-specific knowledge. To facilitate this, we introduce TS-InsightsAvailable at \\href{https://huggingface.co/datasets/zhykoties/time-series-language-alignment{https://huggingface.co/datasets/zhykoties/time-series-language-alignment}.}, the first general-domain dataset for time series and language alignment. TS-Insights contains 100k time-series windows sampled from 20 forecasting datasets. We construct this dataset using a novelagentic workflow, where we use statistical tools to extract features from raw time series before synthesizing them into coherent trend descriptions with GPT-4. Followinginstruction tuningon TS-Insights, Insight Miner outperforms state-of-the-artmultimodal models, such as LLaVA liu2023llava and GPT-4, in generating time-series descriptions and insights. Our findings suggest a promising direction for leveraging LMMs in time series analysis, and serve as a foundational step toward enabling LLMs to interpret time series as a native input modality. Can LLMs natively understand time series? We constructed TS-Insights, the first large-scale alignment dataset containing 100k time series and text pairs across 20 domains. We use a novel agentic workflow to synthesize high-quality trend descriptions.  Inspired by LLaVA, we showed instruction-tuning on TS-Insights can enable LLMs to understand time series as a native input modality and generate textual descriptions. arXiv lens breakdown of this paper 👉https://arxivlens.com/PaperView/Details/insight-miner-a-time-series-analysis-dataset-for-cross-domain-alignment-with-natural-language-7698-7e56892b ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2551105",
    "title": "Insight Miner: A Time Series Analysis Dataset for Cross-Domain Alignment with Natural Language",
    "authors": [],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2512.11251",
    "upvote": 6
  }
}