{
  "context": "OpenDataArena (ODA) is an open platform that benchmarks post-training datasets for Large Language Models (LLMs) using a unified pipeline, multi-dimensional scoring, and data lineage exploration to enhance reproducibility and understanding of data impacts on model behavior. The rapid evolution ofLarge Language Models(LLMs) is predicated on the quality and diversity ofpost-training datasets. However, a critical dichotomy persists: while models are rigorously benchmarked, the data fueling them remains a black box--characterized by opaque composition, uncertain provenance, and a lack of systematic evaluation. This opacity hinders reproducibility and obscures the causal link between data characteristics and model behaviors. To bridge this gap, we introduceOpenDataArena(ODA), a holistic and open platform designed to benchmark the intrinsic value of post-training data. ODA establishes a comprehensive ecosystem comprising four key pillars: (i) aunified training-evaluation pipelinethat ensures fair, open comparisons across diverse models (e.g., Llama, Qwen) and domains; (ii) amulti-dimensional scoring frameworkthat profiles data quality along tens of distinct axes; (iii) an interactivedata lineage explorerto visualize dataset genealogy and dissect component sources; and (iv) a fully open-source toolkit for training, evaluation, and scoring to foster data research. Extensive experiments on ODA--covering over 120 training datasets across multiple domains on 22 benchmarks, validated by more than 600 training runs and 40 million processed data points--reveal non-trivial insights. Our analysis uncovers the inherent trade-offs between data complexity and task performance, identifies redundancy in popular benchmarks through lineage tracing, and maps the genealogical relationships across datasets. We release all results, tools, and configurations to democratize access to high-quality data evaluation. Rather than merely expanding a leaderboard, ODA envisions a shift from trial-and-error data curation to a principled science ofData-Centric AI, paving the way for rigorous studies on data mixing laws and the strategic composition of foundation models. https://opendataarena.github.io/index.html Yes Detailed Discussion here about opendataareana Datahugging face arXiv lens breakdown of this paper 👉https://arxivlens.com/PaperView/Details/opendataarena-a-fair-and-open-arena-for-benchmarking-post-training-dataset-value-6837-7ae568b1  cool اهلا ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2551024",
    "title": "OpenDataArena: A Fair and Open Arena for Benchmarking Post-Training Dataset Value",
    "authors": [
      "Yu Li",
      "Honglin Lin",
      "Zheng Liu",
      "Qizhi Pei",
      "Xiaoran Shang",
      "Mengyuan Sun",
      "Zinan Tang",
      "Xiaoyang Wang",
      "Zhanping Zhong",
      "Lijun Wu"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/OpenDataArena/OpenDataArena-Tool",
    "huggingface_url": "https://huggingface.co/papers/2512.14051",
    "upvote": 40
  }
}