{
  "context": "Representation alignment enhances generative training by transferring spatial structure from pretrained vision encoders to diffusion models, surpassing the importance of global semantic performance. Representation alignment(REPA) guidesgenerative trainingby distilling representations from a strong, pretrained vision encoder to intermediatediffusion features. We investigate a fundamental question: what aspect of the target representation matters for generation, itsglobal semantic information(e.g., measured by ImageNet-1K accuracy) or itsspatial structure(i.e. pairwise cosine similarity betweenpatch tokens)? Prevalent wisdom holds that stronger global semantic performance leads to better generation as a target representation. To study this, we first perform a large-scale empirical analysis across 27 different vision encoders and different model scales. The results are surprising;spatial structure, rather than global performance, drives the generation performance of a target representation. To further study this, we introduce two straightforward modifications, which specifically accentuate the transfer of spatial information. We replace the standardMLP projection layerinREPAwith a simpleconvolution layerand introduce aspatial normalization layerfor the external representation. Surprisingly, our simple method (implemented in <4 lines of code), termediREPA, consistently improvesconvergence speedofREPA, across a diverse set of vision encoders, model sizes, and training variants (such asREPA,REPA-E,Meanflow,JiTetc). %, etc. Our work motivates revisiting the fundamental working mechanism of representational alignment and how it can be leveraged for improved training of generative models. The code and project page are available at https://end2end-diffusion.github.io/irepa  This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2551092",
    "title": "What matters for Representation Alignment: Global Information or Spatial Structure?",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/end2end-diffusion/irepa",
    "huggingface_url": "https://huggingface.co/papers/2512.10794",
    "upvote": 8
  }
}