{
  "context": "Diffusion Preview uses ConsistencySolver, a high-order trainable solver, to improve quality and consistency in low-step image generation, enhancing interactive user experiences. The slow inference process ofimage diffusion modelssignificantly degrades interactive user experiences. To address this, we introduceDiffusion Preview, a novel paradigm employingrapid,low-step samplingto generate preliminary outputs for user evaluation, deferring full-step refinement until the preview is deemed satisfactory. Existing acceleration methods, including training-free solvers and post-training distillation, struggle to deliver high-quality previews or ensure consistency between previews and final outputs. We proposeConsistencySolverderived fromgeneral linear multistep methods, a lightweight, trainable high-order solver optimized viaReinforcement Learning, that enhances preview quality and consistency. Experimental results demonstrate thatConsistencySolversignificantly improves generation quality and consistency in low-step scenarios, making it ideal for efficientpreview-and-refine workflows. Notably, it achievesFID scoreson-par withMultistep DPM-Solverusing 47% fewer steps, while outperforming distillation baselines. Furthermore, user studies indicate our approach reduces overall user interaction time by nearly 50% while maintaining generation quality. Code is available at https://github.com/G-U-N/consolver. The slow inference process of image diffusion models significantly degrades interactive user experiences. We introduceDiffusion Preview, a novel preview-and-refine paradigm that generates rapid, low-step preliminary outputs for user evaluation, deferring full-step refinement until the preview is deemed satisfactory. This workflow enables users to quickly iterate through different prompts or random seeds with minimal computational cost, only triggering expensive full-step sampling when a preview meets their expectations. To achieve high-quality and consistent previews, we proposeConsistencySolver, a learnable high-order ODE solver derived from Linear Multistep Methods and optimized via Reinforcement Learning. Unlike existing training-free solvers that rely on rigid numerical schemes or distillation methods that sacrifice consistency, ConsistencySolver dynamically adapts its integration strategy to maximize alignment between low-step previews and high-step reference generations, ensuring previews serve as reliable proxies for final outputs. Empirical validation demonstrates that ConsistencySolver significantly outperforms training-free ODE solvers (e.g., DDIM, UniPC, Multistep DPM), distillation-based methods (e.g., LCM, PCM, DMD2), and distillation-based solvers (e.g., AMED) across both consistency metrics and FID scores. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend arXiv lens breakdown of this paper 👉https://arxivlens.com/PaperView/Details/image-diffusion-preview-with-consistency-solver-4508-85e5549b ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2551099",
    "title": "Image Diffusion Preview with Consistency Solver",
    "authors": [
      "Fu-Yun Wang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/G-U-N/consolver",
    "huggingface_url": "https://huggingface.co/papers/2512.13592",
    "upvote": 7
  }
}