{
  "context": "WebOperator is a tree-search framework that enhances web-based agents by enabling reliable backtracking and strategic exploration, addressing the limitations of existing methods in handling irreversible actions and partial observability. LLM-based agentsoften operate in agreedy,step-by-step manner, selecting actions solely based on the current observation without considering long-term consequences or alternative paths. This lack of foresight is particularly problematic in web environments, which are only partially observable-limited to browser-visible content (e.g.,DOMandUI elements)-where a single misstep often requires complex and brittle navigation to undo. Without an explicitbacktracking mechanism, agents struggle to correct errors or systematically explore alternative paths.Tree-search methodsprovide a principled framework for such structured exploration, but existing approaches lack mechanisms for safe backtracking, making them prone to unintended side effects. They also assume that all actions are reversible, ignoring the presence of irreversible actions-limitations that reduce their effectiveness in realistic web tasks. To address these challenges, we introduce WebOperator, a tree-search framework that enables reliable backtracking and strategic exploration. Our method incorporates abest-first search strategythat ranks actions by both reward estimates andsafety considerations, along with a robustbacktracking mechanismthat verifies the feasibility of previously visited paths before replaying them, preventing unintended side effects. To further guide exploration, WebOperator generates action candidates from multiple, varied reasoning contexts to ensure diverse and robust exploration, and subsequently curates a high-quality action set by filtering out invalid actions pre-execution and merging semantically equivalent ones. Experimental results onWebArenaandWebVoyagerdemonstrate the effectiveness of WebOperator. OnWebArena, WebOperator achieves a state-of-the-art 54.6% success rate with gpt-4o, underscoring the critical advantage of integratingstrategic foresightwithsafe execution. We are excited to share our recent work titled \"WebOperator: Action-Aware Tree Search for Autonomous Agents in Web Environment\". 📃 Paper:https://arxiv.org/abs/2512.12692💻 Code:https://github.com/kagnlp/WebOperator🏠 Homepage:https://kagnlp.github.io/WebOperator This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2551070",
    "title": "WebOperator: Action-Aware Tree Search for Autonomous Agents in Web Environment",
    "authors": [
      "Mahir Labib Dihan"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/kagnlp/WebOperator",
    "huggingface_url": "https://huggingface.co/papers/2512.12692",
    "upvote": 13
  }
}