{
  "context": "V-RGBX presents an end-to-end framework for intrinsic-aware video editing that combines video inverse rendering, photorealistic video synthesis, and keyframe-based editing with physically grounded intrinsic channel manipulation. Large-scale video generation models have shown remarkable potential in modeling photorealistic appearance and lighting interactions in real-world scenes. However, a closed-loop framework that jointly understands intrinsic scene properties (e.g., albedo, normal, material, and irradiance), leverages them forvideo synthesis, and supports editable intrinsic representations remains unexplored. We present V-RGBX, the first end-to-end framework forintrinsic-aware video editing. V-RGBX unifies three key capabilities: (1)video inverse renderingintointrinsic channels, (2)photorealistic video synthesisfrom these intrinsic representations, and (3)keyframe-based video editingconditioned onintrinsic channels. At the core of V-RGBX is aninterleaved conditioning mechanismthat enables intuitive, physically grounded video editing through user-selected keyframes, supporting flexible manipulation of any intrinsic modality. Extensive qualitative and quantitative results show that V-RGBX produces temporally consistent, photorealistic videos while propagating keyframe edits across sequences in a physically plausible manner. We demonstrate its effectiveness in diverse applications, including object appearance editing and scene-level relighting, surpassing the performance of prior methods. Large-scale video generation models have shown remarkable potential in modeling photorealistic appearance and lighting interactions in real-world scenes. However, a closed-loop framework that jointly understands intrinsic scene properties (e.g., albedo, normal, material, and irradiance), leverages them for video synthesis, and supports editable intrinsic representations remains unexplored. We present V-RGBX, the first end-to-end framework for intrinsic-aware video editing. V-RGBX unifies three key capabilities: (1) video inverse rendering into intrinsic channels, (2) photorealistic video synthesis from these intrinsic representations, and (3) keyframe-based video editing conditioned on intrinsic channels. At the core of V-RGBX is an interleaved conditioning mechanism that enables intuitive, physically grounded video editing through user-selected keyframes, supporting flexible manipulation of any intrinsic modality. Extensive qualitative and quantitative results show that V-RGBX produces temporally consistent, photorealistic videos while propagating keyframe edits across sequences in a physically plausible manner. We demonstrate its effectiveness in diverse applications, including object appearance editing and scene-level relighting, surpassing the performance of prior methods. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2551036",
    "title": "V-RGBX: Video Editing with Accurate Controls over Intrinsic Properties",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/Aleafy/V-RGBX",
    "huggingface_url": "https://huggingface.co/papers/2512.11799",
    "upvote": 29
  }
}