{
  "context": "A new paradigm, Explore to Evolve, is proposed to enhance web agents' information aggregation by constructing a large dataset and developing foundation models that outperform existing models on a challenging benchmark. Deep research web agents not only retrieve information from diverse sources\nsuch as web environments, files, and multimodal inputs, but more importantly,\nthey need to rigorously analyze and aggregate knowledge for insightful\nresearch. However, existing open-source deep research agents predominantly\nfocus on enhancing information-seeking capabilities of web agents to locate\nspecific information, while overlooking the essential need for information\naggregation, which would limit their ability to support in-depth research. We\npropose anExplore to Evolveparadigm to scalably construct verifiable training\ndata for web agents. Begins withproactive online exploration, an agent sources\ngrounded information by exploring the real web. Using the collected evidence,\nthe agent then self-evolves anaggregation programby selecting, composing, and\nrefining operations from 12high-level logical typesto synthesize a verifiable\nQA pair. This evolution from high-level guidance to concrete operations allowed\nus to scalably produceWebAggregatorQA, a dataset of 10K samples across 50K\nwebsites and 11 domains. Based on an open-source agent framework,SmolAgents,\nwe collect supervised fine-tuning trajectories to develop a series of\nfoundation models,WebAggregator.WebAggregator-8B matches the performance ofGPT-4.1, while the 32B variant surpassesGPT-4.1by more than 10% onGAIA-textand closely approachesClaude-3.7-sonnet. Moreover, given the limited\navailability of benchmarks that evaluate web agents' information aggregation\nabilities, we construct ahuman-annotated evaluation splitofWebAggregatorQAas a challenging test set. On this benchmark,Claude-3.7-sonnetonly achieves\n28%, andGPT-4.1scores 25.8%. Even when agents manage to retrieve all\nreferences, they still struggle onWebAggregatorQA, highlighting the need to\nstrengthen the information aggregation capabilities of web agent foundations. Project Page:https://github.com/Tencent/WebAggregator This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2543075",
    "title": "Explore to Evolve: Scaling Evolved Aggregation Logic via Proactive\n  Online Exploration for Deep Research Agents",
    "authors": [
      "Tianqing Fang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/Tencent/WebAggregator",
    "huggingface_url": "https://huggingface.co/papers/2510.14438",
    "upvote": 13
  }
}