{
  "context": "Chem-R, a three-phase trained Chemical Reasoning model, achieves superior performance on chemical tasks by integrating core knowledge, expert reasoning, and multi-task optimization. Although large language models (LLMs) have significant potential to advance\nchemical discovery, current LLMs lack core chemical knowledge, produce\nunreliable reasoning trajectories, and exhibit suboptimal performance across\ndiverse chemical tasks. To address these challenges, we proposeChem-R, a\ngeneralizable Chemical Reasoning model designed to emulate the deliberative\nprocesses of chemists.Chem-Ris trained through a three-phase framework that\nprogressively builds advanced reasoning capabilities, including: 1) Chemical\nFoundation Training, which establishes core chemical knowledge. 2) Chemical\nReasoning Protocol Distillation, incorporating structured, expert-like\nreasoning traces to guide systematic and reliable problem solving. 3)Multi-task Group Relative Policy Optimizationthat optimizes the model for\nbalanced performance across diverse molecular- and reaction-level tasks. This\nstructured pipeline enablesChem-Rto achievestate-of-the-art performanceon\ncomprehensive benchmarks, surpassing leading large language models, includingGemini-2.5-ProandDeepSeek-R1, by up to 46% onmolecular tasksand 66% onreaction tasks. Meanwhile,Chem-Ralso consistently outperforms the existing\nchemical foundation models across both molecular and reaction level tasks.\nThese results highlightChem-R'srobust generalization,interpretability, and\npotential as a foundation for next-generation AI-driven chemical discovery. Although large language models (LLMs) have significant potential to advance chemical discovery, current LLMs lack core chemical knowledge, produce unreliable reasoning trajectories, and exhibit suboptimal performance across diverse chemical tasks. To address these challenges, we proposeChem-R, a generalizableChemicalReasoning model designed to emulate the deliberative processes of chemists. Chem-R is trained through a three-phase framework that progressively builds advanced reasoning capabilities, including: 1) Chemical Foundation Training, which establishes core chemical knowledge. 2) Chemical Reasoning Protocol Distillation, incorporating structured, expert-like reasoning traces to guide systematic and reliable problem solving. 3) Multi-task Group Relative Policy Optimization that optimizes the model for balanced performance across diverse molecular- and reaction-level tasks. This structured pipeline enables Chem-R to achieve state-of-the-art performance on comprehensive benchmarks, surpassing leading large language models, including Gemini-2.5-Pro and DeepSeek-R1, by up to 46% on molecular tasks and 66% on reaction tasks. Meanwhile, Chem-R also consistently outperforms the existing chemical foundation models across both molecular and reaction level tasks. These results highlight Chem-R's robust generalization, interpretability, and potential as a foundation for next-generation AI-driven chemical discovery. The model and code are available athttps://github.com/davidweidawang/Chem-R.  This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2543021",
    "title": "Chem-R: Learning to Reason as a Chemist",
    "authors": [
      "Weida Wang",
      "Di Zhang",
      "Shuchen Pu"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/davidweidawang/Chem-R",
    "huggingface_url": "https://huggingface.co/papers/2510.16880",
    "upvote": 52
  }
}