{
  "context": "AutoPage, a multi-agent system, automates the creation of interactive research webpages through a hierarchical process, ensuring high-quality and efficient results. In the quest for scientific progress, communicating research is as vital as\nthe discovery itself. Yet, researchers are often sidetracked by the manual,\nrepetitive chore of building project webpages to make their dense papers\naccessible. While automation has tackled static slides and posters, the\ndynamic, interactive nature of webpages has remained an unaddressed challenge.\nTo bridge this gap, we reframe the problem, arguing that the solution lies not\nin a single command, but in a collaborative, hierarchical process. We introduce\nAutoPage, a novelmulti-agent systemthat embodies this philosophy.\nAutoPage deconstructs paper-to-page creation into a coarse-to-fine pipeline\nfromnarrative planningtomultimodal content generationand interactive\nrendering. To combatAI hallucination, dedicated \"Checker\" agents verify each\nstep against the source paper, while optionalhuman checkpointsensure the\nfinal product aligns perfectly with the author's vision, transforming the\nsystem from a mere tool into a powerful collaborative assistant. To rigorously\nvalidate our approach, we also constructPageBench, the firstbenchmarkfor this new task. Experiments show AutoPage not only generates\nhigh-quality, visually appealing pages but does so with remarkable efficiency\nin under 15 minutes for less than \\0.1. Code and dataset will be released at\nhttps://mqleet.github.io/AutoPage_ProjectPage/{Webpage}$. 🌐 Paper:https://arxiv.org/abs/2510.19600🔥 Project Page:https://mqleet.github.io/AutoPage_ProjectPage(Refresh the page to see a new version each time)🕹️ Code:https://github.com/AutoLab-SAI-SJTU/AutoPage(⭐️)🤗 Huggingface Space:https://huggingface.co/spaces/Mqleet/AutoPage Welcome to use AutoPage in our huggingface space! To address the questions \"How to create a webpage from an academic paper?\" and \"How to evaluate the project webpage?\", we propose AutoPage and PageBench. AutoPage transforms academic papers into polished, published-ready project webpages through a human-in-the-loop multi-agent pipeline, while PageBench provides automatic evaluation across content quality and visual design quality dimensions. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2543013",
    "title": "Human-Agent Collaborative Paper-to-Page Crafting for Under $0.1",
    "authors": [
      "Qianli Ma",
      "Bingjie Gao"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/AutoLab-SAI-SJTU/AutoPage",
    "huggingface_url": "https://huggingface.co/papers/2510.19600",
    "upvote": 68
  }
}