{
  "context": "DeepAnalyze-8B, an agentic LLM, autonomously completes the data science pipeline from raw data to research reports using curriculum-based training and data-grounded trajectory synthesis. Autonomous data science, from raw data sources to analyst-grade deep research\nreports, has been a long-standing challenge, and is now becoming feasible with\nthe emergence of powerfullarge language models(LLMs). Recent workflow-based\ndata agents have shown promising results on specific data tasks but remain\nfundamentally limited in achieving fully autonomous data science due to their\nreliance on predefined workflows. In this paper, we introduce DeepAnalyze-8B,\nthe firstagentic LLMdesigned for autonomous data science, capable of\nautomatically completing the end-toend pipeline from data sources to\nanalyst-grade deep research reports. To tackle high-complexity data science\ntasks, we propose acurriculum-based agentic trainingparadigm that emulates\nthe learning trajectory of human data scientists, enablingLLMsto\nprogressively acquire and integrate multiple capabilities in real-world\nenvironments. We also introduce adata-grounded trajectory synthesisframework\nthat constructs high-quality training data. Through agentic training,\nDeepAnalyze learns to perform a broad spectrum of data tasks, ranging from data\nquestion answering andspecialized analytical tasksto open-ended data\nresearch. Experiments demonstrate that, with only 8B parameters, DeepAnalyze\noutperforms previous workflow-based agents built on most advanced proprietaryLLMs. The model, code, and training data of DeepAnalyze are open-sourced,\npaving the way toward autonomous data science. DeepAnalyze-8Bis the first agentic LLM for autonomous data science. It can autonomously complete a wide range of data-centric tasks without human intervention, supporting: This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend Hi@zhangshaolei, thank you for open-sourcing this work. I was taking a look at the code and I wonder why did you decide on executing the LLM's code locally and not executing it on a sandbox environment? Also, don't you think feeding the whole trajectory would blew up the context window of the model? arXiv explained breakdown of this paper 👉https://arxivexplained.com/papers/deepanalyze-agentic-large-language-models-for-autonomous-data-science ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2543005",
    "title": "DeepAnalyze: Agentic Large Language Models for Autonomous Data Science",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/ruc-datalab/DeepAnalyze",
    "huggingface_url": "https://huggingface.co/papers/2510.16872",
    "upvote": 106
  }
}