{
  "context": "HSCodeComp evaluates deep search agents' hierarchical rule application in predicting product HS Codes, revealing significant performance gaps compared to human experts. Effectivedeep search agentsmust not only access open-domain and\ndomain-specific knowledge but also apply complex rules-such as legal clauses,\nmedical manuals and tariff rules. These rules often feature vague boundaries\nand implicit logic relationships, making precise application challenging for\nagents. However, this critical capability is largely overlooked by current\nagent benchmarks.\n  To fill this gap, we introduce HSCodeComp, the first realistic, expert-level\ne-commerce benchmark designed to evaluatedeep search agentsin hierarchical\nrule application. In this task, the deep reasoning process of agents is guided\nby these rules to predict 10-digitHarmonized System Code (HSCode)of products\nwith noisy but realistic descriptions. These codes, established by the World\nCustoms Organization, are vital forglobal supply chain efficiency. Built from\nreal-world data collected from large-scale e-commerce platforms, our proposed\nHSCodeComp comprises 632 product entries spanning diverse product categories,\nwith these HSCodes annotated by several human experts.\n  Extensive experimental results on several state-of-the-artLLMs, open-source,\nandclosed-source agentsreveal a huge performance gap: best agent achieves\nonly 46.8% 10-digit accuracy, far below human experts at 95.0%. Besides,\ndetailed analysis demonstrates the challenges ofhierarchical rule application,\nandtest-time scalingfails to improve performance further. HSCodeComp is the first realistic, expert-level e-commerce benchmark designed to evaluate deep search agents on their ability to perform Level-3 knowledge—hierarchical rule application—a critical yet overlooked capability in current agent evaluation frameworks.The task requires agents to predict the exact 10-digit Harmonized System Code (HSCode) for products described with noisy, real-world e-commerce domain, by correctly applying complex, hierarcahical tariff rules (e.g., from eWTP and official customs rulings). These rules often contain vague language and implicit logic, making accurate classification highly challenging. Our evaluation reveals a stark performance gap:🔹 Best AI agent (SmolAgent + GPT-5 VLM): 46.8%🔹 Human experts: 95.0%Besides, ablation study also reveals that inference-time scaling fails to improve the performance. These highlight that deep search with hierarchical rule application remains a major unsolved challenge for state-of-the-art AI agent systems. Github:https://github.com/AIDC-AI/Marco-Search-AgentHuggingface:https://huggingface.co/datasets/AIDC-AI/HSCodeComp This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2543040",
    "title": "HSCodeComp: A Realistic and Expert-level Benchmark for Deep Search\n  Agents in Hierarchical Rule Application",
    "authors": [
      "Tian Lan"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/AIDC-AI/Marco-Search-Agent",
    "huggingface_url": "https://huggingface.co/papers/2510.19631",
    "upvote": 27
  }
}