{
  "context": "DSI-Bench evaluates the dynamic spatial reasoning capabilities of vision-language and visual expertise models through a benchmark of dynamic videos and annotated questions, highlighting their limitations in understanding self-motion, object motion, and relative relationships. Reasoning about dynamic spatial relationships is essential, as both observers\nand objects often move simultaneously. Althoughvision-language models(VLMs)\nandvisual expertise modelsexcel in 2D tasks and static scenarios, their\nability to fully understand dynamic 3D scenarios remains limited. We introduceDynamic Spatial Intelligenceand proposeDSI-Bench, a benchmark with nearly\n1,000dynamic videosand over 1,700manually annotated questionscovering nine\ndecoupledmotion patternsof observers and objects. Spatially and temporally\nsymmetric designs reduce biases and enable systematic evaluation of models'\nreasoning aboutself-motionandobject motion. Our evaluation of 14 VLMs and\nexpert models reveals key limitations: models often conflate observer andobject motion, exhibitsemantic biases, and fail to accurately infer relative\nrelationships in dynamic scenarios. OurDSI-Benchprovides valuable findings\nand insights about the future development of general and expertise models withdynamic spatial intelligence. Reasoning about dynamic spatial relationships is essential, as both observers and objects often move simultaneously. Although vision-language models (VLMs) and visual expertise models excel in 2D tasks and static scenarios, their ability to fully understand dynamic 3D scenarios remains limited. We introduce Dynamic Spatial Intelligence and propose DSI-Bench, a benchmark with nearly 1,000 dynamic videos and over 1,700 manually annotated questions covering nine decoupled motion patterns of observers and objects. Spatially and temporally symmetric designs reduce biases and enable systematic evaluation of models' reasoning about self-motion and object motion. Our evaluation of 14 VLMs and expert models reveals key limitations: models often conflate observer and object motion, exhibit semantic biases, and fail to accurately infer relative relationships in dynamic scenarios. Our DSI-Bench provides valuable findings and insights about the future development of general and expertise models with dynamic spatial intelligence. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2543096",
    "title": "DSI-Bench: A Benchmark for Dynamic Spatial Intelligence",
    "authors": [
      "Ziang Zhang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/SpatialVision/dsibench",
    "huggingface_url": "https://huggingface.co/papers/2510.18873",
    "upvote": 8
  }
}