{
  "context": "The $\\alpha$-Flow framework improves few-step generative modeling by unifying and disentangling conflicting objectives, leading to better convergence and state-of-the-art performance on ImageNet-1K. MeanFlowhas recently emerged as a powerful framework for few-step generative\nmodeling trained from scratch, but its success is not yet fully understood. In\nthis work, we show that theMeanFlowobjective naturally decomposes into two\nparts:trajectory flow matchingandtrajectory consistency. Through gradient\nanalysis, we find that these terms are strongly negatively correlated, causing\noptimization conflict and slow convergence. Motivated by these insights, we\nintroduce alpha-Flow, a broad family of objectives that unifies trajectory\nflow matching,Shortcut Model, andMeanFlowunder one formulation. By adopting\nacurriculum strategythat smoothly anneals fromtrajectory flow matchingtoMeanFlow, alpha-Flow disentangles the conflicting objectives, and achieves\nbetter convergence. When trained from scratch onclass-conditionalImageNet-1K256x256 with vanillaDiT backbones, alpha-Flow consistently outperformsMeanFlowacross scales and settings. Our largest alpha-Flow-XL/2+ model\nachieves new state-of-the-art results using vanillaDiT backbones, with FID\nscores of 2.58 (1-NFE) and 2.15 (2-NFE). AlphaFlow introduces a unified framework that generalizes MeanFlow and other few-step generative models, resolving optimization conflicts to achieve faster convergence and state-of-the-art image generation quality on ImageNet. Github:https://github.com/snap-research/alphaflow This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2543100",
    "title": "AlphaFlow: Understanding and Improving MeanFlow Models",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/snap-research/alphaflow",
    "huggingface_url": "https://huggingface.co/papers/2510.20771",
    "upvote": 7
  }
}