{
  "context": "LightMem, a memory system inspired by human memory, enhances LLMs by efficiently managing historical interaction information, improving accuracy and reducing computational costs. Despite their remarkable capabilities,Large Language Models(LLMs) struggle\nto effectively leverage historical interaction information in dynamic and\ncomplex environments.Memory systemsenableLLMsto move beyond stateless\ninteractions by introducing persistent information storage, retrieval, and\nutilization mechanisms. However, existingmemory systemsoften introduce\nsubstantial time and computational overhead. To this end, we introduce a new\nmemory system calledLightMem, which strikes a balance between the performance\nand efficiency ofmemory systems. Inspired by theAtkinson-Shiffrin modelof\nhuman memory,LightMemorganizes memory into three complementary stages. First,\ncognition-inspiredsensory memoryrapidly filters irrelevant information\nthrough lightweight compression and groups information according to their\ntopics. Next,topic-aware short-term memoryconsolidates these topic-based\ngroups, organizing and summarizing content for more structured access. Finally,long-term memorywithsleep-time updateemploys an offline procedure that\ndecouples consolidation from online inference. Experiments onLongMemEvalwithGPTandQwenbackbones show thatLightMemoutperforms strong baselines in\naccuracy (up to 10.9% gains) while reducingtoken usageby up to 117x, API\ncalls by up to 159x, andruntimeby over 12x. The code is available at\nhttps://github.com/zjunlp/LightMem. We introduce a new memory system called LightMem, which strikes a balance between the performance and efficiency of memory systems. Experiments on LongMemEval with GPT and Qwen backbones show that LightMem outperforms strong baselines in accuracy (up to 10.9% gains) while reducing token usage by up to 117x, API calls by up to 159x, and runtime by over 12x. The code is available athttps://github.com/zjunlp/LightMem. arXiv explained breakdown of this paper 👉https://arxivexplained.com/papers/lightmem-lightweight-and-efficient-memory-augmented-generation This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2543004",
    "title": "LightMem: Lightweight and Efficient Memory-Augmented Generation",
    "authors": [
      "Yunzhi Yao",
      "Ningyu Zhang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/zjunlp/LightMem",
    "huggingface_url": "https://huggingface.co/papers/2510.18866",
    "upvote": 111
  }
}