{
  "context": "A Critique-Post-Edit framework enhances personalization of large language models by integrating a multi-dimensional reward model and a self-revision mechanism, outperforming standard methods. Faithfully personalizing large language models (LLMs) to align with\nindividual user preferences is a critical but challenging task. Whilesupervised fine-tuning(SFT) quickly reaches a performance plateau, standardreinforcement learning from human feedback(RLHF) also struggles with the\nnuances of personalization. Scalar-based reward models are prone to reward\nhacking which leads to verbose and superficially personalized responses. To\naddress these limitations, we proposeCritique-Post-Edit, a robust\nreinforcement learning framework that enables more faithful and controllable\npersonalization. Our framework integrates two key components: (1) aPersonalized Generative Reward Model(GRM) that provides multi-dimensional\nscores and textual critiques to resistreward hacking, and (2) aCritique-Post-Editmechanism where thepolicy modelrevises its own outputs\nbased on these critiques for more targeted and efficient learning. Under a\nrigorouslength-controlled evaluation, our method substantially outperforms\nstandardPPOonpersonalization benchmarks. PersonalizedQwen2.5-7Bachieves an\naverage 11\\% win-rate improvement, and personalizedQwen2.5-14Bmodel surpasses\nthe performance ofGPT-4.1. These results demonstrate a practical path to\nfaithful, efficient, and controllable personalization. Faithfully personalizing large language models (LLMs) to align with individual user preferences is a critical but challenging task. While supervised fine-tuning (SFT) quickly reaches a performance plateau, standard reinforcement learning from human feedback (RLHF) also struggles with the nuances of personalization. Scalar-based reward models are prone to reward hacking which leads to verbose and superficially personalized responses. To address these limitations, we propose Critique-Post-Edit, a robust reinforcement learning framework that enables more faithful and controllable personalization. Our framework integrates two key components: (1) a Personalized Generative Reward Model (GRM) that provides multi-dimensional scores and textual critiques to resist reward hacking, and (2) a Critique-Post-Edit mechanism where the policy model revises its own outputs based on these critiques for more targeted and efficient learning. Under a rigorous length-controlled evaluation, our method substantially outperforms standard PPO on personalization benchmarks. Personalized Qwen2.5-7B achieves an average 11% win-rate improvement, and personalized Qwen2.5-14B model surpasses the performance of GPT-4.1. These results demonstrate a practical path to faithful, efficient, and controllable personalization. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2543052",
    "title": "Towards Faithful and Controllable Personalization via Critique-Post-Edit\n  Reinforcement Learning",
    "authors": [],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2510.18849",
    "upvote": 20
  }
}