{
  "context": "Deep Self-Evolving Reasoning (DSER) extends the reasoning capabilities of smaller models by iteratively improving solutions through a probabilistic Markov chain, enabling them to solve previously unsolvable problems and surpass larger models in accuracy. Long-form chain-of-thought reasoning has become a cornerstone of advanced\nreasoning in large language models. While recent verification-refinementframeworks have enabled proprietary models to solve Olympiad-level problems,\ntheir effectiveness hinges on strong, reliable verification and correction\ncapabilities, which remain fragile in open-weight, smaller-scale models. This\nwork demonstrates that even with weak verification andrefinementcapabilities\non hard tasks, the reasoning limits of such models can be substantially\nextended through aprobabilistic paradigmwe callDeep Self-Evolving Reasoning(DSER). We conceptualizeiterative reasoningas aMarkov chain, where each step\nrepresents a stochastic transition in the solution space. The key insight is\nthat convergence to a correct solution is guaranteed as long as the probability\nof improvement marginally exceeds that of degradation. By running multiple\nlong-horizon,self-evolving processesin parallel,DSERamplifies these small\npositive tendencies, enabling the model to asymptotically approach correct\nanswers. Empirically, we applyDSERto the DeepSeek-R1-0528-Qwen3-8B model. On\nthe challengingAIME 2024-2025 benchmark,DSERsolves 5 out of 9 previously\nunsolvable problems and boosts overall performance, enabling this compact model\nto surpass the single-turn accuracy of its 600B-parameter teacher throughmajority voting. Beyond its immediate utility for test-time scaling, theDSERframework serves to diagnose the fundamental limitations of current open-weight\nreasoners. By clearly delineating their shortcomings inself-verification,refinement, andstability, our findings establish a clear research agenda for\ndeveloping next-generation models with powerful, intrinsic self-evolving\ncapabilities. How can a small model reason like a giant? With ​​Deep Self-Evolving Reasoning(DSER)​​, a new paradigm that reframes iterative verification and refinement as a stochastic process. By running multiple parallel, long-horizon \"self-evolutions\", DSER guides the model to naturally converge on correct solutions. This enabled the compact ​​DeepSeek-R1-0528-Qwen3-8B​​ tosolve 5 out of 9 previously unsolvable AIME problems, achieving performance that rivals its 600B-parameter teacher, ​​DeepSeek-R1-0528​​. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2543080",
    "title": "Deep Self-Evolving Reasoning",
    "authors": [
      "Shun Zheng"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2510.17498",
    "upvote": 11
  }
}