{
  "context": "DeepWideSearch is a benchmark that evaluates agents' ability to integrate deep reasoning and wide-scale information collection, revealing significant challenges and limitations in current agent architectures. Current search agents fundamentally lack the ability to simultaneously\nperformdeep reasoningovermulti-hop retrievalandwide-scale information collection-a critical deficiency for real-world\napplications like comprehensive market analysis and business development. To\nbridge this gap, we introduceDeepWideSearch, the firstbenchmarkexplicitly\ndesigned to evaluate agents to integrate depth and width in information\nseeking. InDeepWideSearch, agents must process a large volume of data, each\nrequiringdeep reasoningovermulti-hop retrievalpaths. Specifically, we\npropose two methods to converse established datasets, resulting in a curated\ncollection of 220 questions spanning 15 diverse domains. Extensive experiments\ndemonstrate that even state-of-the-art agents achieve only 2.39% average\nsuccess rate onDeepWideSearch, highlighting the substantial challenge of\nintegrating depth and width search ininformation-seeking tasks. Furthermore,\nour error analysis reveals four failure modes: lack ofreflection, overreliance\noninternal knowledge, insufficientretrieval, andcontext overflow-exposing\nkey limitations in current agent architectures. We publicly releaseDeepWideSearchto catalyze future research on more capable and robust\ninformation-seeking agents. DeepWideSearch benchmark is designed to evaluate LLM-based agents on simultaneous deep reasoning over multi-hop retrieval and wide-scale information retrieval—a critical capability for real-world tasks like market analysis and business development, for example, the question\"List all second-tier suppliers of Apple's AirPods, with contact info, location, and certification status.\". The output of this task is a tabular. Rows are candidate answers of the questions and columns are attributes of each candidate that questions required to collect. Github:https://github.com/AIDC-AI/Marco-Search-AgentHuggingface:https://huggingface.co/datasets/AIDC-AI/DeepWideSearch This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2543039",
    "title": "DeepWideSearch: Benchmarking Depth and Width in Agentic Information\n  Seeking",
    "authors": [
      "Tian Lan"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/AIDC-AI/Marco-Search-Agent",
    "huggingface_url": "https://huggingface.co/papers/2510.20168",
    "upvote": 27
  }
}