{
  "context": "Self-play training for deep search agents improves performance through co-evolution of task generation and problem solving without supervision. Reinforcement learning with verifiable rewards(RLVR) has become the\nmainstream technique for training LLM agents. However,RLVRhighly depends on\nwell-crafted task queries and corresponding ground-truth answers to provide\naccurate rewards, which requires massive human efforts and hinders the RL\nscaling processes, especially under agentic scenarios. Although a few recent\nworks explore task synthesis methods, the difficulty of generated agentic tasks\ncan hardly be controlled to provide effective RL training advantages. To\nachieve agenticRLVRwith higher scalability, we exploreself-play trainingfordeep search agents, in which the learning LLM utilizes multi-turn search engine\ncalling and acts simultaneously as both atask proposerand aproblem solver.\nThetask proposeraims to generate deep search queries with well-defined\nground-truth answers and increasing task difficulty. Theproblem solvertries\nto handle the generated search queries and output the correct answer\npredictions. To ensure that each generated search query has accurate ground\ntruth, we collect all the searching results from the proposer's trajectory as\nexternal knowledge, then conductretrieval-augmentation generation(RAG) to\ntest whether the proposed query can be correctly answered with all necessary\nsearch documents provided. In thissearch self-play(SSP) game, the proposer\nand the solver co-evolve their agent capabilities through both competition and\ncooperation. With substantial experimental results, we find thatSSPcan\nsignificantly improve search agents' performance uniformly on various\nbenchmarks without any supervision under bothfrom-scratchand continuous RL\ntraining setups. The code is at https://github.com/Alibaba-Quark/SSP. TL;DR:Search Self-Play (SSP)enables LLM agents to co-evolve as both task proposers and solvers through multi-turn searches, enabling scalable, supervision-free agentic reinforcement learning with verifiable rewards. Code:https://github.com/Alibaba-Quark/SSParXiv:https://arxiv.org/abs/2510.18821 Key points in our approach: This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2543062",
    "title": "Search Self-play: Pushing the Frontier of Agent Capability without\n  Supervision",
    "authors": [
      "Yuhang Wen"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/Qwen-Applications/SSP",
    "huggingface_url": "https://huggingface.co/papers/2510.18821",
    "upvote": 17
  }
}