{
  "context": "Refining textual embeddings with average-pooled visual features improves visual grounding and reduces hallucinations in LVLM architectures. In this work, we identify an inherent bias in prevailingLVLM architecturestoward thelanguage modality, largely resulting from the common practice of\nsimply appendingvisual embeddingsto the input text sequence. To address this,\nwe propose a simple yet effective method that refinestextual embeddingsby\nintegratingaverage-pooled visual features. Our approach demonstrably improvesvisual groundingand significantly reduceshallucinationson established\nbenchmarks. While average pooling offers a straightforward, robust, and\nefficient means of incorporating visual information, we believe that more\nsophisticated fusion methods could further enhancevisual groundingandcross-modal alignment. Given that the primary focus of this work is to\nhighlight the modality imbalance and its impact onhallucinations-- and to\nshow that refiningtextual embeddingswith visual information mitigates this\nissue -- we leave exploration of advanced fusion strategies for future work. In this work, we identify an inherent bias in prevailing LVLM architectures toward the language modality, largely resulting from the common practice of simply appending visual embeddings to the input text sequence. To address this, we propose a simple yet effective method that refines textual embeddings by integrating average-pooled visual features. Our approach demonstrably improves visual grounding and significantly reduces hallucinations on established benchmarks. While average pooling offers a straightforward, robust, and efficient means of incorporating visual information, we believe that more sophisticated fusion methods could further enhance visual grounding and cross-modal alignment. Given that the primary focus of this work is to highlight the modality imbalance and its impact on hallucinations -- and to show that refining textual embeddings with visual information mitigates this issue -- we leave exploration of advanced fusion strategies for future work. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546054",
    "title": "Towards Mitigating Hallucinations in Large Vision-Language Models by\n  Refining Textual Embeddings",
    "authors": [],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.05017",
    "upvote": 8
  }
}