{
  "context": "The CC30k dataset, comprising citation contexts labeled with reproducibility-oriented sentiments, enhances the accuracy of large language models in predicting the reproducibility of machine learning papers. Sentiments about the reproducibility of cited papers in downstream literature offer community perspectives and have shown as a promising signal of the actual reproducibility of published findings. To train effective models to effectively predictreproducibility-oriented sentimentsand further systematically study their correlation with reproducibility, we introduce theCC30k dataset, comprising a total of 30,734citation contextsin machine learning papers. Each citation context is labeled with one of three reproducibility-oriented sentiment labels: Positive, Negative, or Neutral, reflecting the cited paper's perceived reproducibility or replicability. Of these, 25,829 are labeled through crowdsourcing, supplemented with negatives generated through a controlled pipeline to counter the scarcity of negative labels. Unlike traditional sentiment analysis datasets, CC30k focuses onreproducibility-oriented sentiments, addressing a research gap in resources forcomputational reproducibilitystudies. The dataset was created through a pipeline that includes robustdata cleansing, carefulcrowd selection, and thoroughvalidation. The resulting dataset achieves a labeling accuracy of 94%. We then demonstrated that the performance of threelarge language modelssignificantly improves on the reproducibility-orientedsentiment classificationafterfine-tuningusing our dataset. The dataset lays the foundation for large-scale assessments of the reproducibility of machine learning papers. TheCC30k datasetand the Jupyter notebooks used to produce and analyze the dataset are publicly available at https://github.com/lamps-lab/CC30k . This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546082",
    "title": "CC30k: A Citation Contexts Dataset for Reproducibility-Oriented Sentiment Analysis",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/lamps-lab/CC30k",
    "huggingface_url": "https://huggingface.co/papers/2511.07790",
    "upvote": 2
  }
}