{
  "context": "MVU-Eval is a comprehensive benchmark for evaluating multi-video understanding in Multimodal Large Language Models, addressing gaps in existing single-video benchmarks and highlighting performance discrepancies in real-world applications. The advent ofMultimodal Large Language Models(MLLMs) has expanded AI\ncapabilities to visual modalities, yet existing evaluation benchmarks remain\nlimited to single-video understanding, overlooking the critical need formulti-video understandingin real-world scenarios (e.g., sports analytics and\nautonomous driving). To address this significant gap, we introduceMVU-Eval,\nthe first comprehensive benchmark for evaluatingMulti-Video Understandingfor\nMLLMs. Specifically, ourMVU-Evalmainly assesses eight core competencies\nthrough 1,824 meticulously curatedquestion-answer pairsspanning 4,959 videos\nfrom diverse domains, addressing both fundamental perception tasks and\nhigh-order reasoning tasks. These capabilities are rigorously aligned with\nreal-world applications such asmulti-sensor synthesisin autonomous systems\nandcross-angle sports analytics. Through extensive evaluation of\nstate-of-the-art open-source and closed-source models, we reveal significant\nperformance discrepancies and limitations in current MLLMs' ability to perform\nunderstanding across multiple videos. The benchmark will be made publicly\navailable to foster future research. We introduce the first Multi-Video Understanding benchmark called MVU-Eval, which comprehensively assesses eight core perception and reasoning abilities through 1,824 carefully curated QA pairs spanning 4,959 distinct videos from various domains. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546036",
    "title": "MVU-Eval: Towards Multi-Video Understanding Evaluation for Multimodal\n  LLMs",
    "authors": [
      "Haochen Wang",
      "Ge Zhang",
      "Shihao Li"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/NJU-LINK/MVU-Eval",
    "huggingface_url": "https://huggingface.co/papers/2511.07250",
    "upvote": 17
  }
}