{
  "context": "MM-CRITIC is a benchmark for evaluating the critique abilities of Large Multimodal Models across multiple dimensions and tasks, using expert-informed ground answers for reliable scoring. The ability of critique is vital for models to self-improve and serve as reliable AI assistants. While extensively studied in language-only settings, multimodal critique ofLarge Multimodal Models(LMMs) remains underexplored despite their growing capabilities in tasks like captioning and visual reasoning. In this work, we introduceMM-CRITIC, a holistic benchmark for evaluating thecritique abilityofLMMsacross multiple dimensions: basic, correction, and comparison. Covering 8 maintask typesand over 500 tasks,MM-CRITICcollects responses from variousLMMswith different model sizes and is composed of 4471 samples. To enhance the evaluation reliability, we integrateexpert-informed ground answersintoscoring rubricsthat guideGPT-4oin annotating responses and generating reference critiques, which serve as anchors for trustworthy judgments. Extensive experiments validate the effectiveness ofMM-CRITICand provide a comprehensive assessment of leadingLMMs' critique capabilities under multiple dimensions. Further analysis reveals some key insights, including the correlation betweenresponse qualityand critique, and varyingcritique difficultyacrossevaluation dimensions. Our code is available at https://github.com/MichealZeng0420/MM-Critic. The ability of critique is vital for models to self-improve and serve as reliable AI assistants. While extensively studied in language-only settings, multimodal critique of Large Multimodal Models (LMMs) remains underexplored despite their growing capabilities in tasks like captioning and visual reasoning. In this work, we introduce MM-CRITIC, a holistic benchmark for evaluating the critique ability of LMMs across multiple dimensions: basic, correction, and comparison. Covering 8 main task types and over 500 tasks, MM-CRITIC collects responses from various LMMs with different model sizes and is composed of 4471 samples. To enhance the evaluation reliability, we integrate expert-informed ground answers into scoring rubrics that guide GPT-4o in annotating responses and generating reference critiques, which serve as anchors for trustworthy judgments. Extensive experiments validate the effectiveness of MM-CRITIC and provide a comprehensive assessment of leading LMMs' critique capabilities under multiple dimensions. Further analysis reveals some key insights, including the correlation between response quality and critique, and varying critique difficulty across evaluation dimensions. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546081",
    "title": "MM-CRITIC: A Holistic Evaluation of Large Multimodal Models as Multimodal Critique",
    "authors": [
      "Kaixin Li"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/MichealZeng0420/MM-Critic",
    "huggingface_url": "https://huggingface.co/papers/2511.09067",
    "upvote": 2
  }
}