{
  "context": "MuSc-V2 framework improves zero-shot anomaly detection by leveraging mutual scoring and similarity aggregation in both 2D and 3D data, achieving significant performance gains over existing benchmarks. Zero-shot anomaly classification(AC) and segmentation (AS) methods aim to identify and outline defects without using any labeled samples. In this paper, we reveal a key property that is overlooked by existing methods: normal image patches across industrial products typically find many other similar patches, not only in 2D appearance but also in 3D shapes, while anomalies remain diverse and isolated. To explicitly leverage this discriminative property, we propose aMutual Scoring framework(MuSc-V2) for zero-shot AC/AS, which flexibly supports single 2D/3D or multimodality. Specifically, our method begins by improving 3D representation throughIterative Point Grouping(IPG), which reduces false positives from discontinuous surfaces. Then we useSimilarity Neighborhood Aggregation with Multi-Degrees(SNAMD) to fuse 2D/3D neighborhood cues into more discriminative multi-scale patch features for mutual scoring. The core comprises aMutual Scoring Mechanism(MSM) that lets samples within each modality to assign score to each other, andCross-modal Anomaly Enhancement(CAE) that fuses 2D and 3D scores to recover modality-specific missing anomalies. Finally,Re-scoring with Constrained Neighborhood(RsCon) suppresses false classification based on similarity to more representative samples. Our framework flexibly works on both the full dataset and smaller subsets with consistently robust performance, ensuring seamless adaptability across diverse product lines. In aid of the novel framework,MuSc-V2achieves significant performance improvements: a +23.7% AP gain on theMVTec 3D-AD datasetand a +19.3% boost on theEyecandies dataset, surpassing previous zero-shot benchmarks and even outperforming most few-shot methods. The code will be available at The code will be available at https://github.com/HUST-SLOW/MuSc-V2{https://github.com/HUST-SLOW/MuSc-V2}. We'd love to hear your thoughts!  💡 Whether it's a question about our paper, a new idea, or a suggestion for improvement, please don't hesitate to tell us.  Let's learn and build together! This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546085",
    "title": "MuSc-V2: Zero-Shot Multimodal Industrial Anomaly Classification and Segmentation with Mutual Scoring of Unlabeled Samples",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/HUST-SLOW/MuSc-V2",
    "huggingface_url": "https://huggingface.co/papers/2511.10047",
    "upvote": 1
  }
}