{
  "context": "SWE-fficiency is a benchmark for evaluating repository-level performance optimization using real workloads, focusing on identifying and implementing performance improvements while maintaining code correctness. Optimizing the performance of large-scale software repositories demands expertise incode reasoningandsoftware engineering(SWE) to reduce runtime while preserving program correctness. However, mostbenchmarks emphasize what to fix rather than how to fix code. We introduce SWE-fficiency, abenchmarkfor evaluatingrepository-levelperformance optimizationon real workloads. Our suite contains 498 tasks across nine widely used data-science, machine-learning, and HPC repositories (e.g., numpy, pandas, scipy): given a complete codebase and a slow workload, an agent must investigatecode semantics, localize bottlenecks and relevant tests, and produce a patch that matches or exceedsexpert speedupwhile passing the sameunit tests. To enable this how-to-fix evaluation, ourautomated pipelinescrapesGitHub pull requestsfor performance-improving edits, combining keyword filtering,static analysis,coverage tooling, andexecution validationto both confirmexpert speedupbaselines and identify relevant repositoryunit tests. Empirical evaluation of state-of-the-art agents reveals significant underperformance. On average, agents achieve less than 0.15x theexpert speedup: agents struggle in localizing optimization opportunities, reasoning about execution across functions, and maintaining correctness in proposed edits. We release thebenchmarkand accompanying data pipeline to facilitate research on automated performance engineering and long-horizonsoftware reasoning. SWE-fficiency presents a benchmark for repository-level performance optimization, requiring agents to locate bottlenecks, patch code, and preserve tests, revealing agent underperformance vs expert speedups. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546073",
    "title": "SWE-fficiency: Can Language Models Optimize Real-World Repositories on Real Workloads?",
    "authors": [],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.06090",
    "upvote": 4
  }
}