{
  "context": "LUA is a lightweight module that performs super-resolution directly in the latent space of diffusion models, improving efficiency without compromising image quality. Diffusion modelsstruggle to scale beyond their training resolutions, as direct high-resolution sampling is slow and costly, while post-hoc image super-resolution (ISR) introduces artifacts and additional latency by operating after decoding. We present the Latent Upscaler Adapter (LUA), a lightweight module that performs super-resolution directly on the generator'slatent codebefore the finalVAE decodingstep. LUA integrates as a drop-in component, requiring no modifications to the base model or additional diffusion stages, and enables high-resolution synthesis through a single feed-forward pass in latent space. A sharedSwin-style backbonewith scale-specificpixel-shuffle headssupports 2x and 4x factors and remains compatible withimage-space SRbaselines, achieving comparableperceptual qualitywith nearly 3x lowerdecoding and upscaling time(adding only +0.42 s for 1024 px generation from 512 px, compared to 1.87 s for pixel-space SR using the sameSwinIR architecture). Furthermore, LUA shows strong generalization across thelatent spacesof differentVAEs, making it easy to deploy without retraining from scratch for each new decoder. Extensive experiments demonstrate that LUA closely matches the fidelity of nativehigh-resolution generationwhile offering a practical and efficient path toscalable,high-fidelity image synthesisin modern diffusion pipelines. We show that high-res synthesis can be done by upscaling in latent space instead of pixels, keeping a single final decode. This preserves quality while cutting latency and works across scales. Is there a comfyui node available? Not yet, there isn’t a ComfyUI node available at the moment.We’re planning to add supplementary material to the paper, release the code on GitHub and Hugging Face, and provide a ComfyUI node as soon as we can!Thanks! This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend how about a comparision with seedvr2, seedvr2 is the top1 for now😄 This has nothing to do with \"upscaling\" as you would imagine, it's a method to resize in latent space, this won't add any details this is not the point here Hurry up! We need comfyui nodes! Haven't the weights and code been released yet? Hi, any update? arXiv lens breakdown of this paper 👉https://arxivlens.com/PaperView/Details/one-small-step-in-latent-one-giant-leap-for-pixels-fast-latent-upscale-adapter-for-your-diffusion-models-1272-01159394 ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546003",
    "title": "One Small Step in Latent, One Giant Leap for Pixels: Fast Latent Upscale Adapter for Your Diffusion Models",
    "authors": [
      "Aleksandr Razin",
      "Danil Kazantsev"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/vaskers5/LUA",
    "huggingface_url": "https://huggingface.co/papers/2511.10629",
    "upvote": 124
  }
}