{
  "context": "A new framework, DynaAct, automatically constructs a compact action space using large language models and submodular functions to enhance sequential reasoning in complex problem-solving scenarios, improving performance while maintaining efficiency. In modernsequential decision-making systems, the construction of anoptimal candidate action spaceis critical to efficient inference. However, existing approaches either rely on manually defined action spaces that lack scalability or utilize unstructured spaces that render exhaustive search computationally prohibitive. In this paper, we propose a novel framework named DynaAct for automatically constructing a compact action space to enhancesequential reasoningin complex problem-solving scenarios. Our method first estimates a proxy for the complete action space by extracting general sketches observed in a corpus covering diverse complex reasoning problems usinglarge language models. We then formulate asubmodular functionthat jointly evaluates candidate actions based on their utility to the current state and their diversity, and employ agreedy algorithmto select an optimal candidate set. Extensive experiments on six diverse standard benchmarks demonstrate that our approach significantly improves overall performance, while maintaining efficient inference without introducing substantial latency. The implementation is available at https://github.com/zhaoxlpku/DynaAct. A new perspective ontest-time scaling— instead of just “thinking longer,” DynaAct makes modelsthink smarterby dynamically constructing compactaction spacesfor each reasoning step. It introduces asubmodular optimization frameworkbalancing utility & diversity to learn effective reasoning actions. 🧩 The open-source code further integratesvLLMintoMCTS, bringing major speedups in node expansion, rollout, and reward computation for large-scale reasoning research. 🔗https://arxiv.org/abs/2511.08043💻https://github.com/zhaoxlpku/DynaAct This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546063",
    "title": "DynaAct: Large Language Model Reasoning with Dynamic Action Spaces",
    "authors": [
      "Xueliang Zhao",
      "Jian Guan"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/zhaoxlpku/DynaAct",
    "huggingface_url": "https://huggingface.co/papers/2511.08043",
    "upvote": 5
  }
}