{
  "context": "Reinforcement Learning with Verifiable Rewards (RLVR) improves large language models by updating a limited set of parameters, which is explained by a Three-Gate Theory, revealing distinct optimization dynamics compared to supervised fine-tuning. Reinforcement Learning with Verifiable Rewards(RLVR) reliably improves the reasoning performance of large language models, yet it appears to modify only a small fraction of parameters. We revisit this paradox and show that sparsity is a surface artifact of a model-conditioned optimization bias: for a fixed pretrained model, updates consistently localize to preferred parameter regions, highly consistent across runs and largely invariant to datasets and RL recipes. We mechanistically explain these dynamics with aThree-Gate Theory: Gate I (KL Anchor) imposes aKL-constrained update; Gate II (Model Geometry) steers the step off principal directions into low-curvature, spectrum-preserving subspaces; and Gate III (Precision) hides micro-updates in non-preferred regions, making the off-principal bias appear as sparsity. We then validate this theory and, for the first time, provide a parameter-level characterization ofRLVR's learning dynamics:RLVRlearns off principal directions inweight space, achieving gains via minimalspectral drift, reducedprincipal-subspace rotation, andoff-principal update alignment. In contrast,SFTtargets principal weights, distorts the spectrum, and even lagsRLVR.\n  Together, these results provide the first parameter-space account ofRLVR's training dynamics, revealing clear regularities in how parameters evolve. Crucially, we show that RL operates in a distinctoptimization regimefromSFT, so directly adaptingSFT-eraparameter-efficient fine-tuning(PEFT) methods can be flawed, as evidenced by our case studies on advancedsparse fine-tuningandLoRAvariants. We hope this work charts a path toward a white-box understanding ofRLVRand the design of geometry-aware,RLVR-native learning algorithms, rather than repurposedSFT-era heuristics. The paper provides the first parameter-space account of RLVR's training dynamics, revealing clear regularities in how parameters evolve. Crucially, it shows that RL operates in a distinct optimization regime from SFT, so directly adapting SFT-era parameter-efficient fine-tuning (PEFT) methods can be flawed, as evidenced by their case studies on advanced sparse fine-tuning and LoRA variants. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546023",
    "title": "The Path Not Taken: RLVR Provably Learns Off the Principals",
    "authors": [],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.08567",
    "upvote": 33
  }
}