{
  "context": "WMPO, a pixel-based world-model framework for VLA RL, enhances sample efficiency, performance, self-correction, and generalization in robotic manipulation tasks. Vision-Language-Action (VLA) models have shown strong potential for general-purpose robotic manipulation, but their reliance on expert demonstrations limits their ability to learn from failures and performself-corrections. Reinforcement learning (RL) addresses these through self-improving interactions with the physical environment, but suffers from high sample complexity on real robots. We introduceWorld-Model-based Policy Optimization(WMPO), a principled framework for on-policy VLA RL without interacting with the real environment. In contrast to widely usedlatent world models,WMPOfocuses onpixel-based predictionsthat align the \"imagined\" trajectories with the VLA features pretrained with web-scale images. Crucially,WMPOenables the policy to performon-policy GRPOthat provides stronger performance than the often-usedoff-policy methods. Extensive experiments in both simulation and real-robot settings demonstrate thatWMPO(i) substantially improvessample efficiency, (ii) achieves stronger overall performance, (iii) exhibitsemergent behaviorssuch asself-correction, and (iv) demonstratesrobust generalizationandlifelong learningcapabilities. WMPO trains on-policy, pixel-based world-models for vision-language-action robots, improving sample efficiency and generalization by aligning imagined trajectories with VLA features learned from web-scale images. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546033",
    "title": "WMPO: World Model-based Policy Optimization for Vision-Language-Action Models",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/WM-PO/WMPO",
    "huggingface_url": "https://huggingface.co/papers/2511.09515",
    "upvote": 18
  }
}