{
  "context": "SynthAgent is a synthetic supervision framework that refines both tasks and trajectories to improve data quality and enhance web agent adaptation to new websites. Web agents struggle to adapt to new websites due to the scarcity of environment specific tasks and demonstrations. Recent works have exploredsynthetic data generationto address this challenge, however, they suffer from data quality issues where synthesized tasks containhallucinationsthat cannot be executed, and collected trajectories are noisy with redundant or misaligned actions. In this paper, we propose SynthAgent, a fully synthetic supervision framework that aims at improving synthetic data quality via dual refinement of both tasks and trajectories. Our approach begins by synthesizing diverse tasks through categorized exploration of web elements, ensuring efficient coverage of the target environment. Duringtrajectory collection, we refine tasks when conflicts with actual observations are detected, mitigatinghallucinationswhile maintaining task consistency. After collection, we conducttrajectory refinementwith aglobal contextto mitigate potential noise or misalignments. Finally, we fine-tuneopen-source web agentson the refined synthetic data to adapt them to the target environment. Experimental results demonstrate that SynthAgent outperforms existing synthetic data methods, validating the importance of high-quality synthetic supervision. The code will be publicly available at https://github.com/aiming-lab/SynthAgent. Web agents struggle to adapt to new websites due to the scarcity of environment specific tasks and demonstrations. Recent works have explored synthetic data generation to address this challenge, however, they suffer from data quality issues where synthesized tasks contain hallucinations that cannot be executed, and collected trajectories are noisy with redundant or misaligned actions. In this paper, we propose SynthAgent, a fully synthetic supervision framework that aims at improving synthetic data quality via dual refinement of both tasks and trajectories. Our approach begins by synthesizing diverse tasks through categorized exploration of web elements, ensuring efficient coverage of the target environment. During trajectory collection, we refine tasks when conflicts with actual observations are detected, mitigating hallucinations while maintaining task consistency. After collection, we conduct trajectory refinement with a global context to mitigate potential noise or misalignments. Finally, we fine-tune open-source web agents on the refined synthetic data to adapt them to the target environment. Experimental results demonstrate that SynthAgent outperforms existing synthetic data methods, validating the importance of high-quality synthetic supervision. The code is publicly available athttps://github.com/aiming-lab/SynthAgent. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546060",
    "title": "Adapting Web Agents with Synthetic Supervision",
    "authors": [
      "Yiming Liang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/aiming-lab/SynthAgent",
    "huggingface_url": "https://huggingface.co/papers/2511.06101",
    "upvote": 6
  }
}