{
  "context": "HAFixAgent, a history-aware bug-fixing agent, improves automated program repair by incorporating repository history, enhancing effectiveness and efficiency for complex multi-hunk bugs. Automated program repair(APR) has recently shifted toward large language\nmodels andagent-based systems, yet most systems rely on local snapshot\ncontext, overlookingrepository history. Prior work shows that repository\nhistory helps repair single-line bugs, since the last commit touching the buggy\nline is often the bug-introducing one. In this paper, we investigate whetherrepository historycan also improve agentic APR systems at scale, especially\nfor complexmulti-hunk bugs. We present HAFixAgent, a History-Aware Bug-Fixing\nAgent that injectsblame-derived repository heuristicsinto its repair loop. A\npreliminary study of all 854 real-world bugs fromDefects4Jmotivates our\ndesign, showing that bug-relevant history is both widely available and highly\nconcentrated. Empirical comparison of HAFixAgent with two state-of-the-art\nbaselines shows: (1) Effectiveness: HAFixAgent significantly improves over the\nagent-based baseline (by 212.3%) and the multi-hunk baseline (by 29.9%). (2)\nEfficiency: history does not significantly increase agent steps and keeps token\ncosts comparable, with notably lower median costs for complex\nmulti-file-multi-hunk bugs. (3) Practicality: combining different historical\nheuristics repairs more bugs, offering a clear cost-benefit trade-off.\nHAFixAgent offers a practical recipe for history-aware agentic APR: ground the\nagent in version control history, prioritizediff-based historical context, and\nintegrate complementary heuristics when needed. HAFixAgent: We gave an AI bug-fixing agentgit blame, and it fixed 212% more bugs in Defects4J. AI agents for code repair are powerful butblind to history. We fixed that. We found 70.7% of all Defects4J bugs trace back to a single historical commit. So, we built HAFixAgent to inject thatblamecontext directly into its reasoning loop. It's not just more effective (+212% vs. SOTA agents), it's also efficient: no significant cost increase. For agentic software engineering, history matters. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546079",
    "title": "HAFixAgent: History-Aware Automated Program Repair Agent",
    "authors": [
      "Hao Li"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.01047",
    "upvote": 3
  }
}