{
  "context": "VeriCoT, a neuro-symbolic method, formalizes and verifies logical arguments in Chain-of-Thought reasoning to improve the reliability and accuracy of LLMs. LLMs can perform multi-step reasoning throughChain-of-Thought(CoT), but\nthey cannot reliably verify their own logic. Even when they reach correct\nanswers, the underlying reasoning may be flawed, undermining trust in\nhigh-stakes scenarios. To mitigate this issue, we introduceVeriCoT, aneuro-symbolic methodthat extracts and verifiesformal logical argumentsfrom\nCoT reasoning.VeriCoTformalizes each CoT reasoning step into first-order\nlogic and identifies premises that ground the argument insource context,commonsense knowledge, or prior reasoning steps. The symbolic representation\nenablesautomated solversto verify logical validity while the NL premises\nallow humans and systems to identify ungrounded or fallacious reasoning steps.\nExperiments on the ProofWriter, LegalBench, and BioASQ datasets showVeriCoTeffectively identifies flawed reasoning, and serves as a strong predictor of\nfinal answer correctness. We also leverageVeriCoT's verification signal for\n(1)inference-time self-reflection, (2)supervised fine-tuning(SFT) onVeriCoT-distilled datasets and (3)preference fine-tuning(PFT) with direct\npreference optimization (DPO) usingverification-based pairwise rewards,\nfurther improving reasoning validity and accuracy. LLM CoT reasoning looks smart but can be logically flawed or... just made up. It's time to hold reasoning accountable! We built VeriCoT to do just that. VeriCoT extracts the core argument of the CoT using well-formed symbolic notions of logical support. It formalizes every CoT step into first-order logic and finds the exact premise it's built on. This gives us two superpowers: 🤖Automated Proof: Solvers can automatically verify if the logic is valid.🧑‍🔬Human-Readable Audits: Natural language premises let you pinpoint ungrounded leaps or fallacies. Best of all, all these can be used as signals to learn more verifiable models! To our knowledge, VeriCoT is the first neuro-symbolic validator of CoT traces in non-math/code domains. 📄 Paper:https://arxiv.org/pdf/2511.04662 This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546022",
    "title": "VeriCoT: Neuro-symbolic Chain-of-Thought Validation via Logical\n  Consistency Checks",
    "authors": [],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.04662",
    "upvote": 34
  }
}