{
  "context": "A novel ERC training framework, PRC-Emo, integrates prompt engineering, demonstration retrieval, and curriculum learning to enhance LLMs' ability to perceive emotions in conversations, achieving state-of-the-art performance on benchmark datasets. Emotion Recognition in Conversation (ERC) is a crucial task for understanding\nhuman emotions and enabling natural human-computer interaction. Although Large\nLanguage Models (LLMs) have recently shown great potential in this field, their\nability to capture the intrinsic connections between explicit and implicit\nemotions remains limited. We propose a novel ERC training framework, PRC-Emo,\nwhich integratesPrompt engineering,demonstration Retrieval, and Curriculum\nlearning, with the goal of exploring whether LLMs can effectively perceive\nemotions in conversational contexts. Specifically, we design emotion-sensitive\nprompt templates based on both explicit and implicit emotional cues to better\nguide the model in understanding the speaker's psychological states. We\nconstruct the first dedicateddemonstration retrievalrepository for ERC, which\nincludes training samples from widely used datasets, as well as high-quality\ndialogue examples generated by LLMs and manually verified. Moreover, we\nintroduce acurriculum learningstrategy into theLoRA fine-tuningprocess,\nincorporating weighted emotional shifts between same-speaker and\ndifferent-speaker utterances to assign difficulty levels to dialogue samples,\nwhich are then organized in an easy-to-hard training sequence. Experimental\nresults on two benchmark datasets--IEMOCAPandMELD--show that our method\nachieves new state-of-the-art (SOTA) performance, demonstrating the\neffectiveness and generalizability of our approach in improving LLM-based\nemotional understanding. Accepted at AAAI 2026 This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546078",
    "title": "Do LLMs Feel? Teaching Emotion Recognition with Prompts, Retrieval, and\n  Curriculum Learning",
    "authors": [
      "Xinran Li"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/LiXinran6/PRC-Emo",
    "huggingface_url": "https://huggingface.co/papers/2511.07061",
    "upvote": 3
  }
}