{
  "context": "MAKER, a system using microagents with error correction, successfully solves tasks with over a million LLM steps, suggesting a new approach for scaling LLM capabilities. LLMshave achieved remarkable breakthroughs in reasoning, insights, and tool use, but chaining these abilities into extended processes at the scale of those routinely executed by humans, organizations, and societies has remained out of reach. The models have a persistent error rate that prevents scale-up: for instance, recent experiments in theTowers of Hanoibenchmark domain showed that the process inevitably becomes derailed after at most a few hundred steps. Thus, although LLM research is often still benchmarked on tasks with relatively few dependent logical steps, there is increasing attention on the ability (or inability) ofLLMsto perform long range tasks. This paper describesMAKER, the first system that successfully solves a task with over one million LLM steps with zero errors, and, in principle, scales far beyond this level. The approach relies on anextreme decompositionof a task into subtasks, each of which can be tackled by focusedmicroagents. The high level of modularity resulting from the decomposition allows error correction to be applied at each step through an efficientmulti-agent voting scheme. This combination ofextreme decompositionand error correction makes scaling possible. Thus, the results suggest that instead of relying on continual improvement of currentLLMs, massively decomposed agentic processes (MDAPs) may provide a way to efficiently solve problems at the level of organizations and societies. This paper shows how even relatively small non-reasoning LLMs can be scaled to completing tasks with over a million steps with zero errors, and in theory can scale far beyond that. It relies on being able to decompose a task into small enough subtasks so that sampling a correct answer is somewhat likely, and no incorrect answer is more likely. How to automatically come up w/ such a decomposition in general is hinted at in the Discussion. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend arXiv explained breakdown of this paper 👉https://arxivexplained.com/papers/solving-a-million-step-llm-task-with-zero-errors ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546031",
    "title": "Solving a Million-Step LLM Task with Zero Errors",
    "authors": [
      "Giuseppe Paolo",
      "Olivier Francon"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.09030",
    "upvote": 20
  }
}