{
  "context": "A pipeline for processing the Common Crawl dataset to create a new Arabic multimodal dataset that preserves document structure and supports both text-only and multimodal pre-training. The performance oflarge language models(LLMs) andlarge multimodal models(LMMs) depends heavily on the quality and scale of theirpre-training datasets.\nRecent research shows thatlarge multimodal modelstrained onnatural documentswhere images and text are interleaved outperform those trained only on\nimage-text pairs across a wide range of benchmarks, leveraging advanced pre-\ntrained models to enforcesemantic alignment,image-sequence consistency, andtextual coherence. ForArabic, however, the lack of high-quality multimodal\ndatasets that preserve document structure has limited progress. In this paper,\nwe present our pipeline Wasm for processing the Common Crawl dataset to create\na newArabicmultimodal dataset that uniquely providesmarkdown output. Unlike\nexistingArabiccorpora that focus solely on text extraction, our approach\npreserves the structural integrity ofweb contentwhile maintaining flexibility\nfor both text-only and multimodal pre-training scenarios. We provide a\ncomprehensivecomparative analysisof ourdata processing pipelineagainst\nthose used for major existing datasets, highlighting the convergences in\nfiltering strategies and justifying our specific design choices. To support\nfuture research, we publicly release a representativedataset dumpalong with\nthe multimodal processing pipeline forArabic. we present our pipeline Wasm for processing the Common Crawl dataset to create a new Arabic multimodal dataset that uniquely provides markdown output. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546025",
    "title": "Wasm: A Pipeline for Constructing Structured Arabic Interleaved\n  Multimodal Corpora",
    "authors": [
      "Khalil Hennara",
      "Ahmad Bastati",
      "Muhammad Hreden",
      "Zeina Aldallal"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.07080",
    "upvote": 31
  }
}