{
  "context": "NINJA, a jailbreak attack method, appends benign content to harmful goals in long-context language models, increasing attack success rates and revealing vulnerabilities in these models. Recent advances inlong-context language models(LMs) have enabled\nmillion-token inputs, expanding their capabilities across complex tasks like\ncomputer-use agents. Yet, the safety implications of these extended contexts\nremain unclear. To bridge this gap, we introduceNINJA(short for\nNeedle-in-haystackjailbreak attack), a method that jailbreaks aligned LMs by\nappending benign,model-generated contentto harmful user goals. Critical to\nour method is the observation that theposition of harmful goalsplay an\nimportant role in safety. Experiments on standard safety benchmark,HarmBench,\nshow thatNINJAsignificantly increases attack success rates across\nstate-of-the-art open and proprietary models, including LLaMA, Qwen, Mistral,\nand Gemini. Unlike prior jailbreaking methods, our approach is low-resource,\ntransferable, and less detectable. Moreover, we show thatNINJAiscompute-optimal-- under a fixed compute budget, increasing context length can\noutperform increasing the number of trials inbest-of-N jailbreak. These\nfindings reveal that even benign long contexts -- when crafted with careful\ngoal positioning -- introduce fundamental vulnerabilities in modern LMs. Recent advances in long-context language models (LMs) have enabled million-token inputs, expanding their capabilities across complex tasks like computer-use agents. Yet, the safety implications of these extended contexts remain unclear. To bridge this gap, we introduce NINJA (short for Needle-in-haystack jailbreak attack), a method that jailbreaks aligned LMs by appending benign, model-generated content to harmful user goals. Critical to our method is the observation that the position of harmful goals play an important role in safety. Experiments on standard safety benchmark, HarmBench, show that NINJA significantly increases attack success rates across state-of-the-art open and proprietary models, including LLaMA, Qwen, Mistral, and Gemini. Unlike prior jailbreaking methods, our approach is low-resource, transferable, and less detectable. Moreover, we show that NINJA is compute-optimal -- under a fixed compute budget, increasing context length can outperform increasing the number of trials in best-of-N jailbreak. These findings reveal that even benign long contexts -- when crafted with careful goal positioning -- introduce fundamental vulnerabilities in modern LMs. This research offers important insights for enhancing the future safety of AI systems. Still, it would be valuable to include a discussion on how we can prevent or mitigate such jailbreak attacks from malicious actors. Highlighting possible defense mechanisms or best practices for model alignment and context handling would make the work more comprehensive and practically useful. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend arXiv explained breakdown of this paper 👉https://arxivexplained.com/papers/jailbreaking-in-the-haystack ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546075",
    "title": "Jailbreaking in the Haystack",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/AR-FORUM/NINJA_Attack",
    "huggingface_url": "https://huggingface.co/papers/2511.04707",
    "upvote": 4
  }
}