{
  "context": "BiCA uses citation links to improve biomedical retrieval models by providing effective hard negatives, enhancing zero-shot and long-tailed performance with minimal fine-tuning. Hard negativesare essential for training effective retrieval models. Hard-negative mining typically relies on ranking documents using cross-encoders or static embedding models based on similarity metrics such as cosine distance. Hard negative mining becomes challenging for biomedical and scientific domains due to the difficulty in distinguishing between source and hard negative documents. However, referenced documents naturally share contextual relevance with the source document but are not duplicates, making them well-suited ashard negatives. In this work, we propose BiCA: BiomedicalDense RetrievalwithCitation-AwareHard Negatives, an approach for hard-negative mining by utilizing citation links in 20,000PubMedarticles for improving a domain-specific small dense retriever. We fine-tune theGTE_smallandGTE_Basemodels using these citation-informed negatives and observe consistent improvements in zero-shotdense retrievalusingnDCG@10for both in-domain and out-of-domain tasks onBEIRand outperform baselines onlong-tailed topicsinLoTTEusingSuccess@5. Our findings highlight the potential of leveraging document link structure to generate highly informative negatives, enabling state-of-the-art performance with minimal fine-tuning and demonstrating a path towards highly data-efficientdomain adaptation. This paper presents a new way to mine hard-negatives, using citation networks and graph traversal methods. Fine-tuning dense retrievers leads to strong performance gains on BEIR and LoTTE. We also publish our model and datasets ☺️ . This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546077",
    "title": "BiCA: Effective Biomedical Dense Retrieval with Citation-Aware Hard Negatives",
    "authors": [
      "Aarush Sinha",
      "Pavan Kumar S",
      "Roshan Balaji"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/NiravBhattLab/BiCA",
    "huggingface_url": "https://huggingface.co/papers/2511.08029",
    "upvote": 3
  }
}