{
  "context": "FLEX, a gradient-free learning paradigm, enables Large Language Model agents to continuously evolve through experience, improving performance in tasks like mathematical reasoning, chemical retrosynthesis, and protein fitness prediction. Autonomous agents driven byLarge Language Models(LLMs) have revolutionized\nreasoning and problem-solving but remain static after training, unable to grow\nwith experience as intelligent beings do during deployment. We introduceForward Learningwith EXperience (FLEX), agradient-free learningparadigm that\nenables LLM agents to continuously evolve through accumulated experience.\nSpecifically, FLEX cultivates scalable and inheritable evolution by\nconstructing a structuredexperience librarythroughcontinual reflectionon\nsuccesses and failures during interaction with the environment. FLEX delivers\nsubstantial improvements onmathematical reasoning,chemical retrosynthesis,\nandprotein fitness prediction(up to 23% onAIME25, 10% onUSPTO50k, and 14%\nonProteinGym). We further identify a clear scaling law ofexperiential growthand the phenomenon ofexperience inheritanceacross agents, marking a step\ntoward scalable and inheritable continuous agent evolution. Project Page:\nhttps://flex-gensi-thuair.github.io. Welcome to FLEX,  a novel learning paradigm that leverages entirely the forward inference ability of LLMs to make a step forward towards Continuous Agent Evolution! This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546046",
    "title": "FLEX: Continuous Agent Evolution via Forward Learning from Experience",
    "authors": [
      "Xinyuan Guo",
      "Yu Pei"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/GenSI-THUAIR/FLEX",
    "huggingface_url": "https://huggingface.co/papers/2511.06449",
    "upvote": 11
  }
}