{
  "context": "Music Flamingo, a large audio-language model, advances music understanding through fine-tuning on a rich dataset and post-training with novel methods, achieving state-of-the-art results across various benchmarks. We introduceMusic Flamingo, a novel largeaudio-language modeldesigned to advance music (including song) understanding in foundational audio models. While audio-language research has progressed rapidly, music remains challenging due to its dynamic, layered, and information-dense nature. Progress has been further limited by the difficulty of scaling open audio understanding models, primarily because of the scarcity of high-quality music data and annotations. As a result, prior models are restricted to producing short, high-level captions, answering only surface-level questions, and showing limited generalization across diverse musical cultures. To address these challenges, we curateMF-Skills, a large-scale dataset labeled through amulti-stage pipelinethat yields rich captions and question-answer pairs covering harmony, structure, timbre, lyrics, and cultural context. We fine-tune an enhancedAudio Flamingo 3backbone onMF-Skillsand further strengthen multiple skills relevant tomusic understanding. To improve the model'sreasoningabilities, we introduce a post-training recipe: we first cold-start withMF-Think, a novelchain-of-thought datasetgrounded in music theory, followed byGRPO-based reinforcement learningwithcustom rewards.Music Flamingoachieves state-of-the-art results across 10+benchmarksformusic understandingandreasoning, establishing itself as a generalist and musically intelligentaudio-language model. Beyond strong empirical results,Music Flamingosets a new standard for advancedmusic understandingby demonstrating how models can move from surface-level recognition toward layered,human-like perceptionof songs. We believe this work provides both a benchmark and a foundation for the community to build the next generation of models that engage with music as meaningfully as humans do. Demo:https://huggingface.co/spaces/nvidia/music-flamingo This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546048",
    "title": "Music Flamingo: Scaling Music Understanding in Audio Language Models",
    "authors": [
      "Sreyan Ghosh",
      "Sang-gil Lee"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.10289",
    "upvote": 10
  }
}