{
  "context": "Transformer-based uncertainty quantification heads improve step-level reasoning verification in LLMs by estimating uncertainty from internal states, offering a lightweight and scalable alternative to existing methods. Solving complex tasks usually requiresLLMsto generate long multi-stepreasoning chains. Previous work has shown that verifying the correctness of\nindividual reasoning steps can further improve the performance and efficiency\nofLLMson such tasks and enhance solution interpretability. However, existingverificationapproaches, such asProcess Reward Models(PRMs), are either\ncomputationally expensive, limited to specific domains, or require large-scale\nhuman or model-generated annotations. Thus, we propose a lightweight\nalternative for step-level reasoningverificationbased on data-drivenuncertainty scores. We traintransformer-baseduncertainty quantification heads(UHeads) that use the internal states of a frozen LLM to estimate the\nuncertainty of its reasoning steps during generation. The approach is fully\nautomatic: target labels are generated either by another larger LLM (e.g.,\nDeepSeek R1) or in aself-supervisedmanner by the original model itself.UHeadsare both effective and lightweight, containing less than 10M parameters.\nAcross multiple domains, including mathematics, planning, and general knowledge\nquestion answering, they match or even surpass the performance of PRMs that are\nup to 810x larger. Our findings suggest that the internal states ofLLMsencode\ntheir uncertainty and can serve as reliable signals for reasoningverification,\noffering a promising direction toward scalable and generalizable introspectiveLLMs. Solving complex tasks usually requires LLMs to generate long multi-step reasoning chains. Previous work has shown that verifying the correctness of individual reasoning steps can further improve the performance and efficiency of LLMs on such tasks and enhance solution interpretability. However, existing verification approaches, such as Process Reward Models (PRMs), are either computationally expensive, limited to specific domains, or require large-scale human or model-generated annotations. Thus, we propose a lightweight alternative for steplevel reasoning verification based on data-driven uncertainty estimation. We train transformer-based uncertainty quantification heads (UHeads) that use the internal states of the frozen LLM to estimate the uncertainty of its reasoning steps during generation. The approach is fully automatic: target labels are generated either by another larger LLM (e.g., DeepSeek R1) or in a self-supervised manner by the original model itself. UHeads are both effective and lightweight, containing less than 10M parameters. Across multiple domains, including mathematics, planning, and general knowledge question answering, they match or even exceed the performance of PRMs that are up to 810× larger. Our findings suggest that the internal states of LLMs encode their uncertainty and can serve as reliable signals for reasoning verification, offering a promising direction towards scalable and generalizable introspective LLMs. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2546034",
    "title": "Reasoning with Confidence: Efficient Verification of LLM Reasoning Steps\n  via Uncertainty Heads",
    "authors": [],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.06209",
    "upvote": 18
  }
}