{
  "context": "VChain enhances video generation by integrating visual reasoning from multimodal models to guide sparse tuning of a pre-trained video generator. Recentvideo generationmodels can produce smooth and visually appealing\nclips, but they often struggle to synthesize complex dynamics with a coherent\nchain of consequences. Accurately modeling visual outcomes and state\ntransitions over time remains a core challenge. In contrast, large language andmultimodal models(e.g., GPT-4o) exhibit strong visual state reasoning and\nfuture prediction capabilities. To bridge these strengths, we introduce VChain,\na novel inference-time chain-of-visual-thought framework that injects visual\nreasoning signals frommultimodal modelsintovideo generation. Specifically,\nVChain contains a dedicated pipeline that leverages largemultimodal modelsto\ngenerate a sparse set of criticalkeyframesas snapshots, which are then used\nto guide thesparse inference-time tuningof apre-trained video generatoronly\nat these key moments. Our approach is tuning-efficient, introduces minimal\noverhead and avoids dense supervision. Extensive experiments on complex,\nmulti-step scenarios show that VChain significantly enhances the quality of\ngenerated videos. Recent video generation models can produce smooth and visually appealing clips, but they often struggle to synthesize complex dynamics with a coherent chain of consequences. Accurately modeling visual outcomes and state transitions over time remains a core challenge. In contrast, large language and multimodal models (e.g., GPT-4o) exhibit strong visual state reasoning and future prediction capabilities. To bridge these strengths, we introduce VChain, a novel inference-time chain-of-visual-thought framework that injects visual reasoning signals from multimodal models into video generation. Specifically, VChain contains a dedicated pipeline that leverages large multimodal models to generate a sparse set of critical keyframes as snapshots, which are then used to guide the sparse inference-time tuning of a pre-trained video generator only at these key moments. Our approach is tuning-efficient, introduces minimal overhead and avoids dense supervision. Extensive experiments on complex, multi-step scenarios show that VChain significantly enhances the quality of generated videos. 🔗 Links:📄 Paper (arXiv):https://arxiv.org/abs/2510.05094🌐 Project Page:https://eyeline-labs.github.io/VChain/💻 Code:https://github.com/Eyeline-Labs/VChain🎬 Video:https://www.youtube.com/watch?v=HV4uAHJwt1k This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2541030",
    "title": "VChain: Chain-of-Visual-Thought for Reasoning in Video Generation",
    "authors": [
      "Ziqi Huang",
      "Gordon Chen"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/Eyeline-Labs/VChain",
    "huggingface_url": "https://huggingface.co/papers/2510.05094",
    "upvote": 37
  }
}