{
  "context": "Clinical Contrastive Cecoding (CCD) enhances radiology report generation by integrating structured clinical signals, reducing medical hallucinations without altering the base MLLM. Multimodal large language models(MLLMs) have recently achieved remarkable\nprogress inradiologyby integratingvisual perceptionwith natural language\nunderstanding. However, they often generate clinically unsupported\ndescriptions, known asmedical hallucinations, which pose serious risks in\nmedical applications that demand accuracy and image-grounded outputs. Through\nempirical analysis, we find thatprompt-induced hallucinationsremain prevalent\ninradiologyMLLMs, largely due to over-sensitivity toclinical sections. To\naddress this, we introduceClinical Contrastive Cecoding(CCD), a training-free\nand retrieval-free inference framework that integrates structured clinical\nsignals from task-specificradiologyexpert models.CCDintroduces a dual-stage\ncontrastive mechanism to refinetoken-level logitsduring generation, thereby\nenhancing clinical fidelity without modifying the base MLLM. Experiments on\nthree datasets and multiple models demonstrate thatCCDconsistently improves\noverall performance onradiology report generation(RRG). On the MIMIC-CXR\ndataset, it yields up to a 17% improvement inRadGraph-F1when applied to\nstate-of-the-artRRGmodels. Our approach provides a lightweight and\ngeneralisable solution for mitigatingmedical hallucinations, effectively\nbridging expert models andMLLMsinradiology.  🚀CCD(ClinicalContrastiveDecoding) helps radiology MLLMs generate more accurate and faithful reports by reducing medical hallucinations — all without retraining or extra data. CCDintroduces adual contrastive decoding strategy: Thislightweight,plug-and-play,training-free, andretrieval-freemethod improves clinical consistency and accuracy across multiple datasets and models, includingMAIRA-2,Libra, andLLaVA-Rad. 📈 On MIMIC-CXR,CCDachieves up to+17% RadGraph-F1improvement onMAIRA-2, greatly reducing unsupported findings and ensuring clinically grounded, image-faithful outputs. 🔗 Resources:🌍 Project:https://x-izhang.github.io/CCD/📦 GitHub:https://github.com/X-iZhang/CCD🤗 Models:Libra Collections🤗 Evaluation dataset:CCD Collections🎮 Online Demo:https://huggingface.co/spaces/X-iZhang/CCD  ⚡TL;DR:CCDis a lightweight,training-free, andretrieval-freedecoding framework that substantially improves clinical accuracy and reduces medical hallucinations inradiology MLLMssuch asMAIRA-2. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2541083",
    "title": "CCD: Mitigating Hallucinations in Radiology MLLMs via Clinical\n  Contrastive Decoding",
    "authors": [
      "Xi Zhang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/X-iZhang/CCD",
    "huggingface_url": "https://huggingface.co/papers/2509.23379",
    "upvote": 14
  }
}