{
  "context": "A survey of self-improvement methods in Multimodal Large Language Models (MLLMs) from data collection, organization, and model optimization perspectives. Recent advancements inself-improvementforLarge Language Models(LLMs) have\nefficiently enhanced model capabilities without significantly increasing costs,\nparticularly in terms of human effort. While this area is still relatively\nyoung, its extension to the multimodal domain holds immense potential for\nleveraging diverse data sources and developing more general self-improving\nmodels. This survey is the first to provide a comprehensive overview ofself-improvementinMultimodal LLMs(MLLMs). We provide a structured overview\nof the current literature and discuss methods from three perspectives: 1) data\ncollection, 2)data organization, and 3)model optimization, to facilitate the\nfurther development ofself-improvementin MLLMs. We also include commonly usedevaluationsanddownstream applications. Finally, we conclude by outlining open\nchallenges andfuture research directions. Self-Improvement in Multimodal Large Language Models: A Survey This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend It would be better to include a citation to the paper available athttps://huggingface.co/papers/2505.22453😀 Thank you for bringing this to our attention. We appreciate the recommendation and will review the paper for possible inclusion in the next iteration of our survey. I believe this paper also focuses on the similar topic but is missed out in the survey. Wang, X., Wu, J., Lin, Z., Zhang, F., Zhang, D., & Nie, L. (2025). Video DataFlywheel: Resolving the Impossible Data Trinity in Video-Language Understanding. IEEE Transactions on Pattern Analysis and Machine Intelligence. \"DataFlywheel\" is what we call \"self-improvment\" in the industry. A fancy name, haha. Thank you for flagging this for us. We appreciate the insight on the \"DataFlywheel\" terminology and will check out the paper for our next revision. ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2541064",
    "title": "Self-Improvement in Multimodal Large Language Models: A Survey",
    "authors": [],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2510.02665",
    "upvote": 20
  }
}