{
  "context": "DeepMiner, a framework using high-difficulty training tasks and dynamic context management, enhances multi-turn reasoning agents through reinforcement learning, achieving significant performance improvements across benchmarks. While recent advances in reasoning models have demonstrated cognitive\nbehaviors throughreinforcement learning, existing approaches struggle to\ninvoke deep reasoning capabilities inmulti-turn agentswith long-horizon\ninteractions. We propose DeepMiner, a novel framework that elicits such\nabilities by introducinghigh-difficulty training tasksand dynamic context\nwindow. DeepMiner presents areverse construction methodto generate complex\nbut verifiablequestion-answer pairsfrom authentic web sources, which ensures\nthe challenge and reliability of training data while injecting cognitive\ncapabilities into multi-turn reasoning scenarios. We further design an elegant\nyet effectivedynamic context managementstrategy for both training and\ninference, utilizingsliding window mechanismswhile eliminating the dependency\non external summarization models, thereby efficiently empowering the model to\nhandle continuously expanding long-horizon contexts. Through reinforcement\nlearning on Qwen3-32B, we develop DeepMiner-32B, which achieves substantial\nperformance improvements across multiple search agent benchmarks. DeepMiner\nattains 33.5% accuracy onBrowseComp-en, surpassing the previous best\nopen-source agent by almost 20 percentage points, and demonstrates consistent\nimprovements onBrowseComp-zh,XBench-DeepSearch, andGAIA. Notably, ourdynamic context managementenables sustained interactions of nearly 100 turns\nwithin standard 32k context length, effectively addressing the context\nlimitations that constrain existing multi-turn interaction systems. While recent advances in reasoning models have demonstrated cognitive behaviors through reinforcement learning, existing approaches struggle to invoke deep reasoning capabilities in multi-turn agents with long-horizon interactions. We propose DeepMiner, a novel framework that elicits such abilities by introducing high-difficulty training tasks and dynamic context window. DeepMiner presents a reverse construction method to generate complex but verifiable question-answer pairs from authentic web sources, which ensures the challenge and reliability of training data while injecting cognitive capabilities into multi-turn reasoning scenarios. We further design an elegant yet effective dynamic context management strategy for both training and inference, utilizing sliding window mechanisms while eliminating the dependency on external summarization models, thereby efficiently empowering the model to handle continuously expanding long-horizon contexts. Through reinforcement learning on Qwen3-32B, we develop DeepMiner-32B, which achieves substantial performance improvements across multiple search agent benchmarks. DeepMiner attains 33.5% accuracy on BrowseComp-en, surpassing the previous best open-source agent by almost 20 percentage points, and demonstrates consistent improvements on BrowseComp-zh, XBench-DeepSearch, and GAIA. Notably, our dynamic context management enables sustained interactions of nearly 100 turns within standard 32k context length, effectively addressing the context limitations that constrain existing multi-turn interaction systems. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2541099",
    "title": "Beyond Turn Limits: Training Deep Search Agents with Dynamic Context\n  Window",
    "authors": [
      "Qiaoyu Tang",
      "Shixuan Liu",
      "Zhenru Zhang"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2510.08276",
    "upvote": 9
  }
}