{
  "context": "EPIC, a progressive learning framework, improves the efficiency of multi-modal large models by reducing training difficulty through token and layer consistency distillation during visual token compression. Visual tokensconsume substantial computational resources in multi-modal\nlarge models (MLLMs), significantly compromising their efficiency. Recent works\nhave attempted to improve efficiency by compressingvisual tokensduring\ntraining, either through modifications to model components or by introducing\nadditional parameters. However, they often overlook the increased learning\ndifficulty caused by such compression, as the model'sparameter spacestruggles\nto quickly adapt to the substantial perturbations in thefeature spaceinduced\nbytoken compression. In this work, we propose to develop EfficientMLLMsvia\nProgressive Consistency Distillation (EPIC), aprogressive learning framework.\nSpecifically, by decomposing thefeature spaceperturbations introduced bytoken compressionalong the token-wise and layer-wise dimensions, we introducetoken consistency distillationandlayer consistency distillation,\nrespectively, aiming to reduce the training difficulty by leveraging guidance\nfrom ateacher modeland following aprogressive learning trajectory. Extensive\nexperiments demonstrate the superior effectiveness, robustness, and\ngeneralization capabilities of our proposed framework. Visual tokens consume substantial computational resources in multi-modal large models (MLLMs), significantly compromising their efficiency. Recent works have attempted to improve efficiency by compressing visual tokens during training, either through modifications to model components or by introducing additional parameters. However, they often overlook the increased learning difficulty caused by such compression, as the model’s parameter space struggles to quickly adapt to the substantial perturbations in the feature space induced by token compression. In this work, we propose to develop Efficient MLLMs via Progressive Consistency Distillation (EPIC), a progressive learning framework. Specifically, by decomposing the feature space perturbations introduced by token compression along the token-wise and layer-wise dimensions, we introduce token consistency distillation and layer consistency distillation, respectively, aiming to reduce the training difficulty by leveraging guidance from a teacher model and following a progressive learning trajectory. Extensive experiments demonstrate the superior effectiveness, robustness, and generalization capabilities of our proposed framework. Code:https://github.com/ZichenWen1/EPICHomepage:https://zichenwen1.github.io/EPIC This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2541029",
    "title": "Efficient Multi-modal Large Language Models via Progressive Consistency\n  Distillation",
    "authors": [
      "Zichen Wen",
      "Shaobo Wang",
      "Yufa Zhou"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/ZichenWen1/EPIC",
    "huggingface_url": "https://huggingface.co/papers/2510.00515",
    "upvote": 39
  }
}