{
  "context": "MATRIX-11K dataset and MATRIX regularization enhance interaction fidelity and semantic alignment in video DiTs by aligning attention with multi-instance mask tracks. Video DiTshave advanced video generation, yet they still struggle to model\nmulti-instance or subject-object interactions. This raises a key question: How\ndo these models internally represent interactions? To answer this, we curate\nMATRIX-11K, a video dataset withinteraction-aware captionsand multi-instance\nmask tracks. Using this dataset, we conduct a systematic analysis that\nformalizes two perspectives ofvideo DiTs:semantic grounding, viavideo-to-text attention, which evaluates whether noun and verb tokens capture\ninstances and their relations; andsemantic propagation, via video-to-video\nattention, which assesses whether instance bindings persist across frames. We\nfind both effects concentrate in a small subset of interaction-dominant layers.\nMotivated by this, we introduce MATRIX, a simple and effective regularization\nthat aligns attention in specific layers ofvideo DiTswith multi-instance mask\ntracks from the MATRIX-11K dataset, enhancing both grounding and propagation.\nWe further proposeInterGenEval, an evaluation protocol for interaction-aware\nvideo generation. In experiments, MATRIX improves bothinteraction fidelityandsemantic alignmentwhile reducingdriftandhallucination. Extensive ablations\nvalidate our design choices. Codes and weights will be released. Video DiTs have advanced video generation, yet they still struggle to model multi-instance or subject-object interactions. This raises a key question: How do these models internally represent interactions? To answer this, we curate MATRIX-11K, a video dataset with interaction-aware captions and multi-instance mask tracks. Using this dataset, we conduct a systematic analysis that formalizes two perspectives of video DiTs: semantic grounding, via video-to-text attention, which evaluates whether noun and verb tokens capture instances and their relations; and semantic propagation, via video-to-video attention, which assesses whether instance bindings persist across frames. We find both effects concentrate in a small subset of interaction-dominant layers. Motivated by this, we introduce MATRIX, a simple and effective regularization that aligns attention in specific layers of video DiTs with multi-instance mask tracks from the MATRIX-11K dataset, enhancing both grounding and propagation. We further propose InterGenEval, an evaluation protocol for interaction-aware video generation. In experiments, MATRIX improves both interaction fidelity and semantic alignment while reducing drift and hallucination. Extensive ablations validate our design choices. Codes and weights will be released. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend nice work ! ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2541032",
    "title": "MATRIX: Mask Track Alignment for Interaction-aware Video Generation",
    "authors": [
      "Siyoon Jin",
      "Seongchan Kim"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/cvlab-kaist/MATRIX",
    "huggingface_url": "https://huggingface.co/papers/2510.07310",
    "upvote": 35
  }
}