{
  "context": "Analysis of reflective behaviors in reasoning models shows that reflections primarily confirm initial answers, and training with more reflections improves first-answer correctness; a question-aware early-stopping method reduces unnecessary reflections and tokens with minimal accuracy loss. Large language models have recently demonstrated significant gains in\nreasoning ability, often attributed to their capacity to generate longer chains\nof thought and engage in reflective reasoning. However, the contribution of\nreflections to performance improvement remains unclear. In this paper, we\nsystematically analyze the rollouts of eightreasoning modelson five\nmathematical datasets. We focus on reflective behaviours where the model has\nalready produced an answer but continues reflecting before finalizing its\noutput. Our analysis reveals that reflections are predominantly confirmatory\nand rarely alter the model's initial answer, a pattern consistent across models\nand datasets. To understand the role of reflections in training, we constructsupervised fine-tuning(SFT) datasets with varying amounts of reflection steps.\nWe observe that training models on rollouts with more reflection steps\nprimarily enhances first-answer correctness rather than the ability to correct\ninitially wrong answers through reflections. This motivates us to propose a\nquestion-awareearly-stopping methodthat enhances inference-time token\nefficiency by stopping the reasoning process once a few plausible candidate\nanswers are generated, thereby reducing unnecessary reflection steps. Motivated\nby this, we further propose to dynamically truncate the reflections after a\ncandidate answer has appeared during generation, which reducesreasoning tokensby 24.5% across five mathematical datasets, within a 2.9% drop in accuracy. In this paper, we present detailed studies of reflection patterns of reasoning models on mathematical datasets. We show that reflections of reasoning models are mostly confirmatory and usually will not change the previous candidate answer. However, training on rollouts with more reflections still leads to better generalization, higher accuracy on test sets. But the performance gain mainly comes from the improvement in first-answer accuracy, while reflections hardly flip an incorrect answer to correct, despite being trained with extensive reflection patterns. We hope our findings deepen understanding of how reasoning models are trained and help guide the development of more efficient models. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend Great work. These findings align with my observations. However, I think the definition of reflection in this study is somewhat narrow, focusing primarily on the thought process between two consecutive explicit answers. In reality, thinking models might engage in reflection even before providing the initial answer. For instance, a model might attempt to solve a problem using a first method, realize it is ineffective, and then switch to a second method. This type of reflection is a key differentiator between thinking models and non-thinking/chat models. In fact, I think there are two main factors that distinguish thinking models from non-thinking/chat models, or enable them to outperform the latter. The first factor is reflection, as previously mentioned. Non-thinking models tend to randomly select a method, proceed with it, and provide a final answer regardless of its effectiveness, which is clearly suboptimal. The second factor is the division of learning target, from formal answers (hard to learn) into an informal thinking process (easy to learn), which reduces the learning complexity for the model. Again, nice work. Happy to see that ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2541049",
    "title": "First Try Matters: Revisiting the Role of Reflection in Reasoning Models",
    "authors": [
      "Liwei Kang",
      "Yue Deng",
      "Yao Xiao",
      "Zhanfeng Mo",
      "Lidong Bing"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/Olafyii/first-try-matters",
    "huggingface_url": "https://huggingface.co/papers/2510.08308",
    "upvote": 24
  }
}