{
  "context": "EvoPresent, a self-improvement agent framework using multi-task reinforcement learning, enhances academic paper promotion by generating coherent narratives, aesthetically pleasing designs, and realistic presentations, supported by a comprehensive benchmark. The promotion of academic papers has become an important means of enhancing\nresearch visibility. However, existing automated methods struggle limited\nstorytelling, insufficient aesthetic quality, and constrained self-adjustment,\nmaking it difficult to achieve efficient and engaging dissemination. At the\nheart of those challenges is a simple principle: there is no way to\nimprove it when you cannot evaluate it right. To address this, we introduce\nEvoPresent, aself-improvement agent frameworkthat unifies coherent\nnarratives, aesthetic-aware designs, and realistic presentation delivery via\nvirtual characters. Central to EvoPresent isPresAesth, a multi-task\nreinforcement learning (RL)aesthetic modelthat provides reliable aesthetic\nscoring,defect adjustment, andcomparative feedback, enabling iterative\nself-improvement even under limited aesthetic training data. To systematically\nevaluate the methods, we introduceEvoPresent Benchmark, a\ncomprehensive benchmark comprising:Presentation Generation Quality,\nbuilt on 650 top-tier AI conference papers with multimodal resources (slides,\nvideos and scripts) to assess both content and design; and Aesthetic\nAwareness, consisting of 2,000 slide pairs with varying aesthetic levels,\nsupporting joint training and evaluation on scoring,defect adjustment, and\ncomparison. Our findings highlight that (i) High-quality feedback is essential\nfor agent self-improvement, while initial capability alone does not guarantee\neffective self-correction. (ii) Automated generation pipelines exhibit a\ntrade-off between visual design and content construction. (iii) Multi-task RL\ntraining shows stronger generalization inaesthetic awarenesstasks. Website:https://evopresent.github.io/ Disclaimer: the demo video was completely generated by our proposed method, no human refinement. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2541085",
    "title": "Presenting a Paper is an Art: Self-Improvement Aesthetic Agents for\n  Academic Presentations",
    "authors": [
      "Chengzhi Liu",
      "Yuzhe Yang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/eric-ai-lab/EvoPresent",
    "huggingface_url": "https://huggingface.co/papers/2510.05571",
    "upvote": 13
  }
}