{
  "context": "A new framework, Text Preference Optimization (TPO), aligns text-to-image models with human preferences without requiring paired image preference data, improving text-to-image alignment and human preference scores. Recent advances indiffusion-based text-to-image(T2I) models have led to\nremarkable success in generating high-quality images from textual prompts.\nHowever, ensuring accurate alignment between the text and the generated image\nremains a significant challenge for state-of-the-art diffusion models. To\naddress this, existing studies employ reinforcement learning with human\nfeedback (RLHF) to align T2I outputs with human preferences. These methods,\nhowever, either rely directly on paired image preference data or require a\nlearned reward function, both of which depend heavily on costly, high-quality\nhuman annotations and thus face scalability limitations. In this work, we\nintroduceText Preference Optimization(TPO), a framework that enables\n\"free-lunch\" alignment ofT2I models, achieving alignment without the need for\npaired image preference data.TPOworks by training the model to prefer matched\nprompts overmismatched prompts, which are constructed by perturbing original\ncaptions using alarge language model. Our framework is general and compatible\nwith existing preference-based algorithms. We extend bothDPOandKTOto our\nsetting, resulting inTDPOandTKTO. Quantitative and qualitative evaluations\nacross multiple benchmarks show that our methods consistently outperform their\noriginal counterparts, delivering better human preference scores and improved\ntext-to-image alignment. Our Open-source code is available at\nhttps://github.com/DSL-Lab/T2I-Free-Lunch-Alignment. Github Repo:https://github.com/DSL-Lab/T2I-Free-Lunch-Alignment This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2541098",
    "title": "Free Lunch Alignment of Text-to-Image Diffusion Models without\n  Preference Image Pairs",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/DSL-Lab/T2I-Free-Lunch-Alignment",
    "huggingface_url": "https://huggingface.co/papers/2509.25771",
    "upvote": 10
  }
}