{
  "context": "MixReasoning dynamically adjusts reasoning depth in models to improve efficiency without sacrificing accuracy. Reasoning modelsenhance performance by tackling problems in astep-by-stepmanner, decomposing them intosub-problemsand exploringlong chains of thoughtbefore producing an answer. However, applying extended reasoning to every step\nintroduces substantial redundancy, assub-problemsvary widely in difficulty\nand complexity: a small number of pivotal steps are genuinely challenging and\ndecisive for the final answer, while many others only involve straightforward\nrevisions or simple computations. Therefore, a natural idea is to endowreasoning modelswith the ability to adaptively respond to this variation,\nrather than treating all steps with the same level of elaboration. To this end,\nwe propose MixReasoning, a framework that dynamically adjusts the depth of\nreasoning within a single response. The resultingchain of thoughtthen becomes\na mixture ofdetailed reasoningon difficult steps andconcise inferenceon\nsimpler ones. Experiments onGSM8K,MATH-500, andAIMEshow that MixReasoning\nshortens reasoning length and substantially improves efficiency without\ncompromising accuracy. Reasoning models enhance performance by tackling problems in a step-by-step manner, decomposing them into sub-problems and exploring long chains of thought before producing an answer. However, applying extended reasoning to every step introduces substantial redundancy, as sub-problems vary widely in difficulty and complexity: a small number of pivotal steps are genuinely challenging and decisive for the final answer, while many others only involve straightforward revisions or simple computations. Therefore, a natural idea is to endow reasoning models with the ability to adaptively respond to this variation, rather than treating all steps with the same level of elaboration. To this end, we propose MixReasoning, a framework that dynamically adjusts the depth of reasoning within a single response. The resulting chain of thought then becomes a mixture of detailed reasoning on difficult steps and concise inference on simpler ones. Experiments on GSM8K, MATH-500, and AIME show that MixReasoning shortens reasoning length and substantially improves efficiency without compromising accuracy. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2541059",
    "title": "MixReasoning: Switching Modes to Think",
    "authors": [
      "Haiquan Lu"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2510.06052",
    "upvote": 21
  }
}