{
  "context": "Fathom-DeepResearch, an agentic system with specialized models for web search and report synthesis, achieves state-of-the-art performance on open-ended information-seeking tasks and diverse reasoning tasks. Tool-integrated reasoning has emerged as a key focus for enabling agentic\napplications. Among these,DeepResearch Agentshave gained significant\nattention for their strong performance on complex, open-ended\ninformation-seeking tasks. We introduceFathom-DeepResearch, an agentic system\ncomposed of two specialized models. The first isFathom-Search-4B, aDeepSearchmodel trained fromQwen3-4Band optimized for evidence-based investigation\nthrough live web search and targeted webpage querying. Its training combines\nthree advances: (i)DUETQA, a 5K-sample dataset generated via multi-agent\nself-play that enforces strict web-search dependence and heterogeneous source\ngrounding; (ii)RAPO, a zero-overhead extension ofGRPOthat stabilizes\nmulti-turn Reinforcement Learning with Verifiable Rewards through curriculum\npruning,reward-aware advantage scaling, andper-prompt replay buffers; and\n(iii) asteerable step-level rewardthat classifies each tool call by cognitive\nbehavior and marginal utility, enabling explicit control over search trajectory\nbreadth, depth, and horizon. These improvements enable reliable extension of\ntool-calling beyond 20 calls when warranted. The second isFathom-Synthesizer-4B, trained fromQwen3-4B, which converts multi-turnDeepSearchtraces into structured, citation-denseDeepResearch Reportsfor\ncomprehensive synthesis. Evaluated onDeepSearchbenchmarks (SimpleQA,FRAMES,WebWalker,Seal0,MuSiQue) andDeepResearch-Bench, the system achieves\nstate-of-the-art performance in the open-weights category while demonstrating\nstrong generalization to diverse reasoning tasks includingHLE,AIME-25,GPQA-Diamond, andMedQA. We present Fathom-DeepResearch, an agentic system that addresses critical gaps in open-source deepresearch capabilities through two specialized 4B models: Fathom-Search-4B for multi-turn web search andreasoning, and Fathom-Synthesizer-4B for structured report synthesis. We are open-sourcing everything ->model weights, research report, training recipe and data ! 🤗Fathom-Search-4B:https://huggingface.co/FractalAIResearch/Fathom-Search-4B 📜 Research Paper:https://huggingface.co/papers/2509.24107 This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2541009",
    "title": "Fathom-DeepResearch: Unlocking Long Horizon Information Retrieval and\n  Synthesis for SLMs",
    "authors": [
      "Shreyas Singh",
      "Kunal Singh"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/FractalAIResearchLabs/Fathom-DeepResearch",
    "huggingface_url": "https://huggingface.co/papers/2509.24107",
    "upvote": 78
  }
}