{
  "context": "TaTToo, a novel table-grounded Process Reward Model, enhances tabular reasoning by explicitly addressing table-specific operations and integrating tool-based verification, leading to significant performance improvements over existing PRMs. Process Reward Models(PRMs) have recently emerged as a powerful framework\nfor enhancing the reasoning capabilities oflarge reasoning models(LRMs),\nparticularly in the context oftest-time scaling(TTS). However, their\npotential for supervising LRMs ontabular reasoningdomains remains\nunderexplored. Through detailed empirical analyses, we identify that existing\nPRMs, though widely adopted for supervising text-only reasoning steps, struggle\nwith table-specific operations such assub-table retrievaland schema\ninteraction, leading to critical performance bottlenecks. To address this\nlimitation, we proposeTaTToo, a novel table-grounded PRM framework that (i)\nreasons explicitly overtabular reasoningsteps and (ii) integrates tool-based\nverification to provide precise reward supervision. Concretely, we first design\na scalabledata curation pipelinethat constructs over 60k high-qualitystep-level annotationsby integrating table verification rationales with\ntool-based executions. Building on the collected data, we trainTaTToowith adual-stage paradigm:cold-start supervised fine-tuningto capture tool-use\nreasoning patterns, followed byreinforcement learningwith tool-groundedreward shapingto align our model with table-based verification. We provide a\ncomprehensive evaluation of thepolicy improvementinduced by our newly\ndesigned PRM. Across 5 challengingtabular reasoningbenchmarks coveringnumerical reasoning,fact-checking, anddata analysis,TaTTooimproves\ndownstream policy LRMs by 30.9% at inference, surpasses strong PRM baselines\nsuch as Qwen-2.5-Math-PRM-72B with only 8B parameters, and demonstrates stronggeneralizabilityacross diverse TTS strategies. 🚀TATTOO – a novel tool-grounded process reward model (PRM) for tabular reasoning 🔎What we do: Conduct detailed pilot analyses to diagnose the performance bottlenecks of prior PRMs on table-specific step-supervision (retrieval & schema interaction). Build a 60k+ instance dataset with tool-augmented, step-level verification. Train with a dual-stage agentic training paradigm for better leverage of tools during the per-step evaluation process. Scale effectively under various TTS strategies, including Best-of-N, Beam Search, and DVTS. 💡Why it matters:TATTOO shows that tool-integrated thinking PRMs can supervise both thinking and table operations, offering more reliable reward signals for better reasoning and verification. 👉 Paper:https://arxiv.org/pdf/2510.06217  This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2541016",
    "title": "TaTToo: Tool-Grounded Thinking PRM for Test-Time Scaling in Tabular\n  Reasoning",
    "authors": [
      "Soumya Roy",
      "Vinay Kumar Verma",
      "Pan Lu"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2510.06217",
    "upvote": 63
  }
}