{
  "context": "BIRD-INTERACT is a benchmark for multi-turn text-to-SQL tasks that simulates realistic database assistant challenges through dynamic interactions, hierarchical knowledge bases, and autonomous decision-making. Large language models(LLMs) have demonstrated remarkable performance on\nsingle-turntext-to-SQLtasks, but real-world database applications\npredominantly requiremulti-turn interactionsto handle ambiguous queries,\nexecution errors, and evolving user requirements. Existing multi-turn\nbenchmarks fall short by treatingconversation historiesas static context or\nlimiting evaluation to read-only operations, failing to reflect\nproduction-grade database assistant challenges. We introduce BIRD-INTERACT, a\nbenchmark that restores this realism through: (1) a comprehensive interaction\nenvironment coupling each database with ahierarchical knowledge base, metadata\nfiles, and a function-drivenuser simulator, enabling models to solicit\nclarifications, retrieve knowledge, and recover from errors without human\nsupervision; (2) two evaluation settings consisting of a pre-defined\nconversational protocol (c-Interact) and an open-ended agentic setting\n(a-Interact) where models autonomously decide when to query theuser simulatoror explore the environment; (3) a challenging task suite covering the fullCRUDspectrum forbusiness-intelligenceandoperational use cases, guarded by\nexecutable test cases. Each task features ambiguous and follow-up sub-tasks\nrequiring dynamic interaction. The suite comprises BIRD-INTERACT-FULL (600\ntasks, up to 11,796 interactions) for comprehensive performance assessment, and\nBIRD-INTERACT-LITE (300 tasks with simplified databases) for detailed\nbehavioral analysis and rapid method development. Our empirical results\nhighlight BIRD-INTERACT's difficulty: GPT-5 completes only 8.67% of tasks in\nc-Interact and 17.00% in a-Interact. Analysis viamemory graftingandInteraction Test-time Scalingvalidates the importance of effective interaction\nfor complex, dynamictext-to-SQLtasks. 47 pages, 26 figures, 11 tables. Submitted to arXiv; based on work from The BIRD Team and Google Cloud. Dataset and code available athttps://bird-interact.github.io/ This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2541060",
    "title": "BIRD-INTERACT: Re-imagining Text-to-SQL Evaluation for Large Language\n  Models via Lens of Dynamic Interactions",
    "authors": [
      "Nan Huo",
      "Xiaohan Xu",
      "Xiaolong Li"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/bird-bench/BIRD-Interact",
    "huggingface_url": "https://huggingface.co/papers/2510.05318",
    "upvote": 21
  }
}