{
  "context": "Early experience, using agent-generated interaction data without reward signals, improves policy effectiveness and generalization, serving as a bridge between imitation learning and reinforcement learning. A long-term goal of language agents is to learn and improve through their own\nexperience, ultimately outperforming humans in complex, real-world tasks.\nHowever, training agents from experience data withreinforcement learningremains difficult in many environments, which either lack verifiable rewards\n(e.g., websites) or require inefficient long-horizon rollouts (e.g., multi-turn\ntool use). As a result, most current agents rely on supervised fine-tuning on\nexpert data, which is challenging to scale and generalizes poorly. This\nlimitation stems from the nature of expert demonstrations: they capture only a\nnarrow range of scenarios and expose the agent to limited environment\ndiversity. We address this limitation with a middle-ground paradigm we callearly experience: interaction data generated by the agent's own actions, where\nthe resulting future states serve as supervision without reward signals. Within\nthis paradigm we study two strategies of using such data: (1) Implicit world\nmodeling, which uses collected states to ground the policy in environment\ndynamics; and (2)Self-reflection, where the agent learns from its suboptimal\nactions to improve reasoning and decision-making. We evaluate across eight\ndiverse environments and multiple model families. Our approaches consistently\nimprove effectiveness andout-of-domain generalization, highlighting the value\nofearly experience. Moreover, in environments with verifiable rewards, our\nresults provide promising signals thatearly experienceoffers a strong\nfoundation for subsequentreinforcement learning, positioning it as a practical\nbridge between imitation learning and fully experience-driven agents. A long-term goal of language agents is to learn and improve through their own experience, ultimately outperforming humans in complex, real-world tasks. However, training agents from experience data with reinforcement learning remains difficult in many environments, which either lack verifiable rewards (e.g., websites) or require inefficient long-horizon rollouts (e.g., multi-turn tool use). As a result, most current agents rely on supervised fine-tuning on expert data, which is challenging to scale and generalizes poorly. This limitation stems from the nature of expert demonstrations: they capture only a narrow range of scenarios and expose the agent to limited environment diversity. We address this limitation with a middle-ground paradigm we call early experience: interaction data generated by the agent's own actions, where the resulting future states serve as supervision without reward signals. Within this paradigm we study two strategies of using such data: (1) Implicit world modeling, which uses collected states to ground the policy in environment dynamics; and (2) Self-reflection, where the agent learns from its suboptimal actions to improve reasoning and decision-making. We evaluate across eight diverse environments and multiple model families. Our approaches consistently improve effectiveness and out-of-domain generalization, highlighting the value of early experience. Moreover, in environments with verifiable rewards, our results provide promising signals that early experience offers a strong foundation for subsequent reinforcement learning, positioning it as a practical bridge between imitation learning and fully experience-driven agents. model-based RL? How did they write \"rollout\" ~147 times in this paper and not once think\"wait, should we cite Ludacris?\"The Related Work section has 3 paragraphs on exploration but somehow missesthe definitive work on the topic. Hi, thanks for the suggestion. I’ve been searching for this work (by title, author, and book title) across the web, but no matter how hard I try, I can’t seem to find it anywhere. I’m very interested in reading the paper, could you please share a pointer or link? This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend arXiv explained breakdown of this paper 👉https://arxivexplained.com/papers/agent-learning-via-early-experience So essentially, this paper is still doing SFT; it just augments the trajectory with (1) the model’s anticipated reasoning about the consequences of taking an action (implicit world modeling), and (2) self-reflection about why alternative actions weren’t taken. Right? arXiv lens breakdown of this paper 👉https://arxivlens.com/PaperView/Details/agent-learning-via-early-experience-7731-2f1ee1b5 ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2541002",
    "title": "Agent Learning via Early Experience",
    "authors": [
      "Kai Zhang",
      "Xiangchao Chen",
      "Bo Liu",
      "Xiyao Wang",
      "Yuting Ning",
      "Xiaohan Fu",
      "Boyu Gou"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2510.08558",
    "upvote": 270
  }
}