{
  "context": "Drax, a discrete flow matching framework for ASR, achieves state-of-the-art recognition accuracy with improved efficiency by constructing an audio-conditioned probability path. Diffusion and flow-based non-autoregressive (NAR) models have shown strong\npromise in large language modeling, however, their potential for automatic\nspeech recognition (ASR) remains largely unexplored. We propose Drax, adiscrete flow matchingframework forASRthat enables efficient parallel\ndecoding. To better align training with inference, we construct anaudio-conditioned probability paththat guides the model through trajectories\nresembling likely intermediate inference errors, rather than direct random\nnoise to target transitions. Our theoretical analysis links the generalization\ngap todivergencesbetween training and inference occupancies, controlled bycumulative velocity errors, thereby motivating our design choice. Empirical\nevaluation demonstrates that our approach attainsrecognition accuracyon par\nwith state-of-the-art speech models while offering improved accuracy-efficiency\ntrade-offs, highlightingdiscrete flow matchingas a promising direction for\nadvancing NARASR. 💻Code|  🤗Models We propose Drax, a non-autoregressive ASR model using discrete flow matching that includes an audio-conditioned intermediate distribution to better match inference dynamics.Drax achieves accuracy comparable to state-of-the-art autoregressive models while offering better control over the accuracy-efficiency trade-off point. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2541044",
    "title": "Drax: Speech Recognition with Discrete Flow Matching",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/aiola-lab/drax",
    "huggingface_url": "https://huggingface.co/papers/2510.04162",
    "upvote": 27
  }
}