{
  "context": "LVLMs struggle with preserving cultural identities in mixed visual scenes, but supervised fine-tuning with culture mixing datasets improves their performance. In a globalized world, cultural elements from diverse origins frequently appear together within a single visual scene. We refer to these asculture mixingscenarios, yet howLarge Vision-Language Models(LVLMs) perceive them remains underexplored. We investigateculture mixingas a critical challenge forLVLMsand examine how current models behave when cultural items from multiple regions appear together. To systematically analyze these behaviors, we construct CultureMix, a foodVisual Question Answering(VQA) benchmark with 23kdiffusion-generated, human-verifiedculture mixingimages across four subtasks: (1)food-only, (2)food+food, (3)food+background, and (4)food+food+background. Evaluating 10LVLMs, we find consistent failures to preserve individual cultural identities in mixed settings. Models show strong background reliance, with accuracy dropping 14% when cultural backgrounds are added tofood-onlybaselines, and they produce inconsistent predictions for identical foods across different contexts. To address these limitations, we explore three robustness strategies. We findsupervised fine-tuningusing a diverseculture mixingdataset substantially improve model consistency and reduce background sensitivity. We call for increased attention toculture mixingscenarios as a critical step toward developingLVLMscapable of operating reliably in culturally diverse real-world environments.  This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549099",
    "title": "World in a Frame: Understanding Culture Mixing as a New Challenge for Vision-Language Models",
    "authors": [
      "Eunsu Kim",
      "Na Min An",
      "Jiho Jin",
      "Alice Oh"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.22787",
    "upvote": 9
  }
}