{
  "context": "Skywork-R1V4, a 30B parameter multimodal agentic model, achieves top performance in perception and multimodal search benchmarks through supervised fine-tuning and interleaved reasoning without reinforcement learning. Despite recent progress inmultimodal agentic systems, existing approaches often treatimage manipulationandweb searchas disjoint capabilities, rely heavily on costlyreinforcement learning, and lack planning grounded in real tool-execution traces. To address these limitations, we present Skywork-R1V4, a 30B (A3B) parameter multimodal agentic model that unifiesmultimodal planning,active image manipulation(\"thinking with images\"),deep multimodal search, and, most critically,interleaved reasoningthat dynamically alternates between visual operations and external knowledge retrieval. Trained solely viasupervised fine-tuningon fewer than 30,000 high-quality, planning-execution-consistent trajectories and validated through stepwise consistency filtering, Skywork-R1V4 achieves state-of-the-art results across perception and multimodal search benchmarks: it scores 66.1 onMMSearchand 67.2 onFVQA, surpassingGemini 2.5 Flashon all 11 metrics. Skywork-R1V4 exhibits emergentlong-horizon reasoningat inference time, successfully orchestrating more than 10 tool calls to solve complex, multi-step tasks. Our results demonstrate that sophisticated agentic multimodal intelligence can be achieved through carefully curated supervised learning alone, without any reliance onreinforcement learning. Skywork-R1V4: Toward Agentic Multimodal Intelligence through Interleaved Thinking with Images and DeepResearch  This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549023",
    "title": "Skywork-R1V4: Toward Agentic Multimodal Intelligence through Interleaved Thinking with Images and DeepResearch",
    "authors": [
      "Yifan Zhang",
      "Peiyu Wang",
      "Peng Xia"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/SkyworkAI/Skywork-R1V/tree/main/r1v4",
    "huggingface_url": "https://huggingface.co/papers/2512.02395",
    "upvote": 47
  }
}