{
  "context": "The introduction of NexAU, NexA4A, and NexGAP enables the scaling of complexity, diversity, and fidelity in interactive environments for training large language models as autonomous agents, resulting in superior performance. The evolution ofLarge Language Models(LLMs) from passive responders toautonomous agentsnecessitates a fundamental shift in learning paradigms -- from static imitation toincentive-driven decision making. However, this transition is significantly impeded by the lack of scalable infrastructure capable of constructing high-qualityinteraction signalsfor effectivepolicy learning. To address this, we introduce a comprehensive method designed to systematically scale the diversity and complexity of interactive environments. Our method realizes this scaling by addressing three orthogonal dimensions: (1) Complexity:NexAU, a flexible agent framework that supports building complexagent hierarchiesvia simple configurations; (2) Diversity:NexA4Aautomatically generates diverseagent hierarchiesfromnatural languageto cover infinite domains; and (3) Fidelity:NexGAPbridges thesimulation-reality gapby integrating dynamic real-world environment forgrounded trajectories synthesis. We train Nex-N1 upon the diverse and complex interactive environments established by our infrastructure. Empirical results on benchmarks such asSWE-benchandtau2demonstrate that Nex-N1 consistently outperforms SOTA open-source models and achieves competitive performance against frontier proprietary models on complex agentic tasks. We open-source the Nex ecosystem and model weights to facilitate further research. The evolution of Large Language Models (LLMs) from passive responders to autonomous agents necessitates a fundamental shift in learning paradigms -- from static imitation to incentive-driven decision making. However, this transition is significantly impeded by the lack of scalable infrastructure capable of constructing high-quality interaction signals for effective policy learning. To address this, we introduce a comprehensive method designed to systematically scale the diversity and complexity of interactive environments. Our method realizes this scaling by addressing three orthogonal dimensions: (1) Complexity: NexAU, a flexible agent framework that supports building complex agent hierarchies via simple configurations; (2) Diversity: NexA4A automatically generates diverse agent hierarchies from natural language to cover infinite domains; and (3) Fidelity: NexGAP bridges the simulation-reality gap by integrating dynamic real-world environment for grounded trajectories synthesis. We train Nex-N1 upon the diverse and complex interactive environments established by our infrastructure. Empirical results on benchmarks such as SWE-bench and tau2 demonstrate that Nex-N1 consistently outperforms SOTA open-source models and achieves competitive performance against frontier proprietary models on complex agentic tasks. We open-source the Nex ecosystem and model weights to facilitate further research. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend arXiv lens breakdown of this paper 👉https://arxivlens.com/PaperView/Details/nex-n1-agentic-models-trained-via-a-unified-ecosystem-for-large-scale-environment-construction-2085-7e052b17 ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549012",
    "title": "Nex-N1: Agentic Models Trained via a Unified Ecosystem for Large-Scale Environment Construction",
    "authors": [
      "Yufei Gao",
      "Honglin Guo",
      "Pinxue Guo"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/nex-agi/Nex-N1",
    "huggingface_url": "https://huggingface.co/papers/2512.04987",
    "upvote": 76
  }
}