{
  "context": "The ViDiC task and ViDiC-1K dataset evaluate Multimodal Large Language Models' ability to describe differences between video pairs, addressing limitations in capturing motion continuity and event evolution. Understanding visual differences between dynamic scenes requires the comparative perception of compositional, spatial, and temporal changes--a capability that remains underexplored in existing vision-language systems. While prior work onImage Difference Captioning(IDC) has enabled models to describe semantic changes between static images, these approaches fail to capture motion continuity, event evolution, or editing consistency over time. We introduce theViDiC(Video Difference Captioning) task and its correspondingViDiC-1Kdataset, designed to evaluate the ability ofMultimodal Large Language Models(MLLMs) to provide fine-grained descriptions of similarities and differences between video pairs.ViDiC-1Kcomprises 1,000 curated video pairs annotated with over 4,000 comparativechecklist items, covering seven categories: subject, style, background, cinematography, motion, location, and playback techniques. To ensure reliable evaluation, we propose adual-checklist frameworkthat measures the accuracy of similarity and difference separately, based on theLLM-as-a-Judge protocol. Experiments on nineteen representative multimodal models reveal a significant performance gap in their comparative description and difference perception abilities. We hopeViDiC-1Kcan be a challenging benchmark that lays a solid foundation for advancingvideo understanding,edit awareness, andcomparative reasoningin multimodal intelligence. Understanding visual differences between dynamic scenes requires the comparative perception of compositional, spatial, and temporal changes--a capability that remains underexplored in existing vision-language systems. While prior work on Image Difference Captioning (IDC) has enabled models to describe semantic changes between static images, these approaches fail to capture motion continuity, event evolution, or editing consistency over time. We introduce the ViDiC (Video Difference Captioning) task and its corresponding ViDiC-1K dataset, designed to evaluate the ability of Multimodal Large Language Models (MLLMs) to provide fine-grained descriptions of similarities and differences between video pairs. ViDiC-1K comprises 1,000 curated video pairs annotated with over 4,000 comparative checklist items, covering seven categories: subject, style, background, cinematography, motion, location, and playback techniques. To ensure reliable evaluation, we propose a dual-checklist framework that measures the accuracy of similarity and difference separately, based on the LLM-as-a-Judge protocol. Experiments on nineteen representative multimodal models reveal a significant performance gap in their comparative description and difference perception abilities. We hope ViDiC-1K can be a challenging benchmark that lays a solid foundation for advancing video understanding, edit awareness, and comparative reasoning in multimodal intelligence. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549048",
    "title": "ViDiC: Video Difference Captioning",
    "authors": [
      "Shihao Li",
      "Yuanxing Zhang",
      "Runzhe Wen",
      "Yiwen He",
      "Jiakai Wang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/NJU-LINK/ViDiC-1K",
    "huggingface_url": "https://huggingface.co/papers/2512.03405",
    "upvote": 27
  }
}