{
  "context": "STC, a hierarchical framework, optimizes streaming VideoLLMs by reducing ViT encoding and LLM pre-filling latency through token caching and pruning, without significantly impacting accuracy. Streaming Video Large Language Models(VideoLLMs) have demonstrated impressive performance across various video understanding tasks, but they face significant challenges in real-time deployment due to the high computational cost of processing dense visual tokens from continuous video streams. In streaming video scenarios, the primary bottleneck lies in theVision Transformer(ViT) encoding stage, where redundant processing of temporally similar frames leads to inefficiency. Additionally, inflated token sequences during LLM pre-filling further exacerbate latency and memory overhead. To address these challenges, we propose StreamingToken Compression(STC), a plug-and-play hierarchical framework that seamlessly integrates into existing streamingVideoLLMs, optimizing bothViTencoding and LLM pre-filling stages to accelerate processing. STC introduces two token-level accelerators:STC-Cacher, which reducesViTencoding overhead by caching and reusing features from temporally similar frames, andSTC-Pruner, which compresses the visual token sequence before it enters the LLM, preserving only the most salient tokens based on both spatial and temporal relevance. Extensive experiments on four baseline streamingVideoLLMsacross five benchmarks demonstrate that STC outperforms other compression methods. Notably, STC retains up to 99\\% of accuracy on theReKV frameworkwhile reducingViTencoding latency and LLM pre-filling latency by 24.5\\% and 45.3\\%. Streaming Video Large Language Models (VideoLLMs) have demonstrated impressive performance across various video understanding tasks, but they face significant challenges in real-time deployment due to the high computational cost of processing dense visual tokens from continuous video streams. In streaming video scenarios, the primary bottleneck lies in the Vision Transformer (ViT) encoding stage, where redundant processing of temporally similar frames leads to inefficiency. Additionally, inflated token sequences during LLM pre-filling further exacerbate latency and memory overhead. To address these challenges, we propose \\textbf{S}treaming \\textbf{T}oken \\textbf{C}ompression (\\textbf{STC}), a plug-and-play hierarchical framework that seamlessly integrates into existing streaming VideoLLMs, optimizing both ViT encoding and LLM pre-filling stages to accelerate processing. STC introduces two token-level accelerators: \\textbf{STC-Cacher}, which reduces ViT encoding overhead by caching and reusing features from temporally similar frames, and \\textbf{STC-Pruner}, which compresses the visual token sequence before it enters the LLM, preserving only the most salient tokens based on both spatial and temporal relevance. Extensive experiments on four baseline streaming VideoLLMs across five benchmarks demonstrate that STC outperforms other compression methods. Notably, STC retains up to \\textbf{99%} of accuracy on the ReKV framework while reducing ViT encoding latency and LLM pre-filling latency by \\textbf{24.5%} and \\textbf{45.3%}. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549076",
    "title": "Accelerating Streaming Video Large Language Models via Hierarchical Token Compression",
    "authors": [
      "Xuyang Liu",
      "Boxue Yang",
      "Chenfei Liao"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/lern-to-write/STC",
    "huggingface_url": "https://huggingface.co/papers/2512.00891",
    "upvote": 14
  }
}