{
  "context": "Captain Safari, a pose-conditioned world engine using a dynamic local memory and retriever for pose-aligned world tokens, generates high-quality, 3D-consistent long videos with accurate camera maneuvers, outperforming existing methods across quality, consistency, and trajectory following. World engines aim to synthesize long, 3D-consistent videos that support interactive exploration of a scene under user-controlled camera motion. However, existing systems struggle under aggressive 6-DoF trajectories and complex outdoor layouts: they lose long-range geometric coherence, deviate from the target path, or collapse into overly conservative motion. To this end, we introduce Captain Safari, apose-conditioned world enginethat generates videos by retrieving from a persistentworld memory. Given a camera path, our method maintains adynamic local memoryand uses aretrieverto fetchpose-aligned world tokens, which then conditionvideo generationalong the trajectory. This design enables the model to maintain stable 3D structure while accurately executing challenging camera maneuvers. To evaluate this setting, we curate OpenSafari, a new in-the-wildFPV datasetcontaining high-dynamic drone videos with verified camera trajectories, constructed through a multi-stage geometric andkinematic validationpipeline. Across video quality, 3D consistency, and trajectory following, Captain Safari substantially outperforms state-of-the-art camera-controlled generators. It reducesMEt3Rfrom 0.3703 to 0.3690, improvesAUC@30from 0.181 to 0.200, and yields substantially lowerFVDthan all camera-controlled baselines. More importantly, in a 50-participant, 5-wayhuman studywhere annotators select the best result among five anonymized models, 67.6% of preferences favor our method across all axes. Our results demonstrate that pose-conditionedworld memoryis a powerful mechanism for long-horizon, controllablevideo generationand provide OpenSafari as a challenging new benchmark for future world-engine research. World engines aim to synthesize long, 3D-consistent videos that support interactive exploration of a scene under user-controlled camera motion. However, existing systems struggle under aggressive 6-DoF trajectories and complex outdoor layouts: they lose long-range geometric coherence, deviate from the target path, or collapse into overly conservative motion. To this end, we introduce Captain Safari, a pose-conditioned world engine that generates videos by retrieving from a persistent world memory. Given a camera path, our method maintains a dynamic local memory and uses a retriever to fetch pose-aligned world tokens, which then condition video generation along the trajectory. This design enables the model to maintain stable 3D structure while accurately executing challenging camera maneuvers. To evaluate this setting, we curate OpenSafari, a new in-the-wild FPV dataset containing high-dynamic drone videos with verified camera trajectories, constructed through a multi-stage geometric and kinematic validation pipeline. Across video quality, 3D consistency, and trajectory following, Captain Safari substantially outperforms state-of-the-art camera-controlled generators. It reduces MEt3R from 0.3703 to 0.3690, improves AUC@30 from 0.181 to 0.200, and yields substantially lower FVD than all camera-controlled baselines. More importantly, in a 50-participant, 5-way human study where annotators select the best result among five anonymized models, 67.6% of preferences favor our method across all axes. Our results demonstrate that pose-conditioned world memory is a powerful mechanism for long-horizon, controllable video generation and provide OpenSafari as a challenging new benchmark for future world-engine research. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549098",
    "title": "Captain Safari: A World Engine",
    "authors": [
      "Yu-Cheng Chou",
      "Xingrui Wang",
      "Hanting Liu",
      "Junfei Xiao"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.22815",
    "upvote": 9
  }
}