{
  "context": "Hierarchical Sparse Attention (HSA) is integrated into Transformers to efficiently handle ultra-long contexts, achieving high accuracy on in-context retrieval tasks. This work explores the challenge of building ``Machines that Can Remember'', framing long-term memory as the problem of efficientultra-long context modeling. We argue that this requires three key properties:sparsity,random-access flexibility, andlength generalization. To address ultra-long-context modeling, we leverageHierarchical Sparse Attention (HSA), a novel attention mechanism that satisfies all three properties. We integrate HSA intoTransformersto build HSA-UltraLong, which is an 8B-parameterMoE modeltrained on over 8 trillion tokens and is rigorously evaluated on different tasks with in-domain and out-of-domain context lengths to demonstrate its capability in handling ultra-long contexts. Results show that our model performs comparably to full-attention baselines on in-domain lengths while achieving over 90\\% accuracy on most in-context retrieval tasks with contexts up to 16M. This report outlines our experimental insights and open problems, contributing a foundation for future research inultra-long context modeling. This work introduces HSA-UltraLong, an 8B-parameter MoE model trained on over 8 trillion tokens, which employs Hierarchical Sparse Attention to achieve efficient ultra-long context modeling. The model maintains comparable performance to full-attention baselines on in-domain tasks while demonstrating remarkable length generalization—achieving over 90% accuracy on in-context retrieval tasks with contexts extending up to 16M tokens despite being trained on only 32K context lengths. This represents a significant advancement in building machines capable of long-term memory through scalable context modeling. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549057",
    "title": "Every Token Counts: Generalizing 16M Ultra-Long Context in Large Language Models",
    "authors": [
      "Zhanchao Zhou",
      "Jianguo Li"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.23319",
    "upvote": 22
  }
}