{
  "context": "Pretrained diffusion transformers, adapted with LoRA and synthetic PBR data, achieve state-of-the-art reflection removal performance. We introduce adiffusion-transformer(DiT) framework for single-imagereflection removalthat leverages the generalization strengths offoundation diffusion modelsin the restoration setting. Rather than relying on task-specific architectures, we repurpose a pre-trainedDiT-based foundation model by conditioning it onreflection-contaminated inputsand guiding it towardclean transmission layers. We systematically analyze existingreflection removaldata sources for diversity, scalability, and photorealism. To address the shortage of suitable data, we construct aphysically based rendering(PBR) pipeline inBlender, built around thePrincipled BSDF, to synthesize realistic glass materials and reflection effects. EfficientLoRA-based adaptation of the foundation model, combined with the proposed synthetic data, achievesstate-of-the-artperformance onin-domainandzero-shot benchmarks. These results demonstrate that pretrained diffusion transformers, when paired withphysically grounded data synthesisand efficient adaptation, offer a scalable and high-fidelity solution forreflection removal. Project page: https://hf.co/spaces/huawei-bayerlab/windowseat-reflection-removal-web Project page:https://huggingface.co/spaces/huawei-bayerlab/windowseat-reflection-removal-web This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend  ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549073",
    "title": "Reflection Removal through Efficient Adaptation of Diffusion Transformers",
    "authors": [
      "Daniyar Zakarin",
      "Thiemo Wandel",
      "Anton Obukhov"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/huawei-bayerlab/windowseat-reflection-removal",
    "huggingface_url": "https://huggingface.co/papers/2512.05000",
    "upvote": 15
  }
}