{
  "context": "DiG-Flow enhances VLA models' robustness by using geometric regularization to align observation and action embeddings, improving performance on complex tasks and with limited data. Vision-Language-Action (VLA) models trained withflow matchinghave demonstrated impressive capabilities on robotic manipulation tasks. However, their performance often degrades under distribution shift and on complex multi-step tasks, suggesting that the learned representations may not robustly capture task-relevant semantics. We introduce DiG-Flow, a principled framework that enhances VLA robustness through geometric regularization. Our key insight is that thedistributional discrepancybetween observation andaction embeddingsprovides a meaningful geometric signal: lowertransport costindicates compatible representations, while higher cost suggests potential misalignment. DiG-Flow computes a discrepancy measure betweenempirical distributionsof observation andaction embeddings, maps it to amodulation weightvia amonotone function, and appliesresidual updatesto theobservation embeddingsbeforeflow matching. Crucially, this intervention operates at the representation level without modifying theflow matchingpath or target vector field. We provide theoretical guarantees showing that discrepancy-guided training provably decreases thetraining objective, and that guidedinference refinementconverges withcontraction. Empirically, DiG-Flow integrates into existing VLA architectures with negligible overhead and consistently improves performance, with particularly pronounced gains on complex multi-step tasks and under limited training data. DiG-Flow is a plug-and-play module for flow-matching based VLAs that rebalances control between the autoregressive foundation model and the flow expert. It embeds model inputs and flow outputs into a unified discrepancy space and uses this signal to gate the flow path, preventing shortcut transports that bypass the pretrained model and steering the expert toward more general, robust actions. DiG-Flow integrates seamlessly into diverse VLA architectures. Project Page:https://beingbeyond.github.io/DiG-FlowarXiv:https://arxiv.org/abs/2512.01715 This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549094",
    "title": "DiG-Flow: Discrepancy-Guided Flow Matching for Robust VLA Models",
    "authors": [
      "Wanpeng Zhang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/BeingBeyond/DiG-Flow",
    "huggingface_url": "https://huggingface.co/papers/2512.01715",
    "upvote": 9
  }
}