{
  "context": "Wikontic is a multi-stage pipeline that constructs high-quality, ontology-consistent knowledge graphs from open-domain text, achieving state-of-the-art performance in information retention and efficiency. Knowledge graphs(KGs) provide structured, verifiable grounding forlarge language models(LLMs), but current LLM-based systems commonly use KGs as auxiliary structures for text retrieval, leaving their intrinsic quality underexplored. In this work, we propose Wikontic, a multi-stage pipeline that constructs KGs from open-domain text by extractingcandidate tripletswithqualifiers, enforcingWikidata-based type andrelation constraints, and normalizing entities to reduce duplication. The resulting KGs are compact, ontology-consistent, and well-connected; onMuSiQue, the correct answer entity appears in 96% of generated triplets. OnHotpotQA, our triplets-only setup achieves 76.0 F1, and onMuSiQue59.8 F1, matching or surpassing several retrieval-augmented generation baselines that still require textual context. In addition, Wikontic attains state-of-the-art information-retention performance on theMINE-1benchmark (86%), outperforming prior KG construction methods. Wikontic is also efficient at build time: KG construction uses less than 1,000 output tokens, about 3times fewer thanAriGraphand <1/20 ofGraphRAG. The proposed pipeline enhances the quality of the generated KG and offers a scalable solution for leveraging structured knowledge in LLMs.         This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549026",
    "title": "Wikontic: Constructing Wikidata-Aligned, Ontology-Aware Knowledge Graphs with Large Language Models",
    "authors": [
      "Aydar Bulatov",
      "Yuri Kuratov"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/screemix/Wikontic",
    "huggingface_url": "https://huggingface.co/papers/2512.00590",
    "upvote": 45
  }
}