{
  "context": "TACO, a test-time-scaling framework with a pseudo-count estimator, enhances the inference stability and success rates of Vision-Language-Action models in downstream tasks by preventing distribution shifts. Vision-Language-Action (VLA) models, trained viaflow-matchingordiffusion objectives, excel at learning complex behaviors from large-scale, multi-modal datasets (e.g., human teleoperation, scripted policies). However, since VLAs incorporate diverse data modes in thepre-trainingstage, and thefinetuningdataset often contains demonstration data collected in a kinematically suboptimal or undesirable way, it exists redundant action modes that are irrelevant to the success action modes of the downstream task. Specifically, we observe a critical inference-time fragility among various sampled noises after supervisedfinetuningof pre-trained VLAs. In this paper, we attribute this instability to thedistribution shiftbetween the VLA policy and the policy induced by stable success modes of the downstream task dataset. Thus, we propose TACO, atest-time-scaling(TTS) framework that applies a lightweightpseudo-count estimatoras a high-fidelity verifier ofaction chunks. The VLA models integrated with TACO can execute the actions with maximum pseudo-count from all sampledaction chunks, thereby preventingdistribution shifts while preserving the generalization ability of VLAs since the constraint is applied only during inference. Our method resembles the classicalanti-exploration principleinoffline reinforcement learning(RL), and beinggradient-free, it incurs significant computational benefits compared to RL update, especially for flow or diffusion-based VLAs which are difficult to perform RL update due todenoising process. Extensive experiments across four simulation benchmarks (RoboTwin2.0,Robotwin,LIBERO,SimplerEnv) and adual-arm platformdemonstrate that our method significantly improves the inference stability and success rates in downstream-task adaptations. 🚀 Excited to share our latest work: TACO 🌮: Test-time Anti-exploration via pseudo-COunts!We found a critical instability in VLA models: even after fine-tuning, the same model can swing from 80% success to 0% just by varying initial noise! 😱 Inspired by the Anti-Exploration principle, we tackle the critical instability in VLAs (success rates swinging 80%→0% due to noise!) by bridging out-of-support inference of VLAs and Offline RL.🤝 💡 The Theoretical Bridge: We identify VLA inference fragility as an Out-of-Distribution (OOD) problem.🧠 Our key insight: Test-Time Scaling is not just a heuristic—it is a theoretically equivalent realization of the Anti-Exploration principle from Offline RL! Just as Offline RL penalizes OOD actions, TACO steers the VLA policy toward high-density \"success modes\" at test time, effectively filtering out redundant behaviors. ✨ Highlights:1️⃣ Principled: Realizes anti-exploration without gradient updates.2️⃣ Effective: +16% real-world success rate; fixes distribution shifts.3️⃣ Efficient: Coupled CFN verifier + KV Cache = Low Latency.4️⃣ Plug-and-Play: Compatible with $\\pi_0$, OpenVLA, and more. 🌐 Project:https://vla-anti-exploration.github.io/📄 Paper:https://arxiv.org/abs/2512.02834💻 Code:https://github.com/breez3young/TACO For questions or collaborations, please contact:breezeyoung9470@gmail.com This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549033",
    "title": "Steering Vision-Language-Action Models as Anti-Exploration: A Test-Time Scaling Approach",
    "authors": [
      "Yang Zhang",
      "Haoran He"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/breez3young/TACO",
    "huggingface_url": "https://huggingface.co/papers/2512.02834",
    "upvote": 40
  }
}