{
  "context": "Rectified MeanFlow enables efficient one-step sampling for flow-based generative models by modeling mean velocity fields with a single reflow step and a truncation heuristic, improving both sample quality and training efficiency. Flow-based generative modelshave recently demonstrated strong performance, yet sampling typically relies on expensive numerical integration ofordinary differential equations(ODEs).Rectified Flowenablesone-step samplingby learning nearly straightprobability paths, but achieving such straightness requires multiple computationally intensivereflow iterations.MeanFlowachieves one-step generation by directly modeling the average velocity over time; however, when trained on highly curved flows, it suffers from slow convergence and noisy supervision. To address these limitations, we propose RectifiedMeanFlow, a framework that models themean velocity fieldalong the rectified trajectory using only a single reflow step. This eliminates the need for perfectly straightened trajectories while enabling efficient training. Furthermore, we introduce a simple yet effective truncation heuristic that aims to reduce residual curvature and further improve performance. Extensive experiments on ImageNet at 64, 256, and 512 resolutions show that Re-MeanFlowconsistently outperforms prior one-step flow distillation andRectified Flowmethods in bothsample qualityandtraining efficiency. Code is available at https://github.com/Xinxi-Zhang/Re-MeanFlow. Github repo:https://github.com/Xinxi-Zhang/Re-MeanFlow Re-Meanflowis a simple yet effective framework for one-step modeling. In one sentence: We first straighten the underlying ODE using the reflow algorithm from Rectified Flow  (with a pre-trained flow model), and then train a  MeanFlow model on top of the rectified trajectories. This combination yields an organic synergy that: Meanflow relaxes the need for perfectly straight trajectories from the original Rectified Flow, while the rectified trajectory provides a much straighter and simpler underlying ODE path for extremely efficient Meanflow training. Hence, we canflow straighter and faster. More concretely, Re-MeanFlow comes with several nice advantages: This is an excellent work by an excellent group of ppl. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549077",
    "title": "Flow Straighter and Faster: Efficient One-Step Generative Modeling via MeanFlow on Rectified Trajectories",
    "authors": [
      "Xinxi Zhang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/Xinxi-Zhang/Re-MeanFlow",
    "huggingface_url": "https://huggingface.co/papers/2511.23342",
    "upvote": 14
  }
}