{
  "context": "CodeVision, a flexible code-as-tool framework, enhances multimodal large language models' robustness and tool-based reasoning by generating code to handle image operations, overcoming brittleness and improving performance through supervised fine-tuning and reinforcement learning. Multimodal large language models (MLLMs) that think with images can interactively use tools to reason about visual inputs, but current approaches often rely on a narrow set of tools with limited real-world necessity and scalability. In this work, we first reveal a critical and previously overlooked weakness: even state-of-the-artMLLMsare surprisingly brittle, showing significant performance degradation on images with simple orientation changes or natural corruptions, underscoring the need for more robust tool-based reasoning. To address this, we proposeCodeVision, a flexible and scalablecode-as-tool frameworkwhere the model generates code as a universal interface to invoke any image operation, moving beyond fixed tool registries. We train our model using a two-stage methodology, beginning withSupervised Fine-Tuning(SFT) on a high-quality dataset curated for complex, multi-turntool compositionanderror recovery, followed byReinforcement Learning(RL) with a novel and denseprocess reward functionto encourage strategic and efficient tool use. To facilitate this research, we construct new SFT and RL datasets and introduce a challenging new benchmark suite designed to rigorously evaluate robustness to orientation changes and multi-tool reasoning. Experiments onQwen2.5-VLandQwen3-VLseries show that our approach significantly improves model performance and fosters emergent capabilities such as flexibletool composition, efficient chained execution, and robusterror recoveryfrom runtime feedback. Code is available at https://github.com/ByteDance-BandAI/CodeVision. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549070",
    "title": "Thinking with Programming Vision: Towards a Unified View for Thinking with Images",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/ByteDance-BandAI/CodeVision",
    "huggingface_url": "https://huggingface.co/papers/2512.03746",
    "upvote": 16
  }
}