{
  "context": "MultiBanana is a benchmark dataset for evaluating multi-reference text-to-image generation models across various challenging conditions, providing insights into model strengths and weaknesses. Recenttext-to-image generationmodels have acquired the ability ofmulti-reference generationand editing; the ability to inherit the appearance of subjects from multiple reference images and re-render them under new contexts. However, the existingbenchmark datasetsoften focus on the generation with single or a few reference images, which prevents us from measuring the progress on how model performance advances or pointing out their weaknesses, under different multi-reference conditions. In addition, their task definitions are still vague, typically limited to axes such as \"what to edit\" or \"how many references are given\", and therefore fail to capture the intrinsic difficulty of multi-reference settings. To address this gap, we introduce MultiBanana, which is carefully designed to assesses the edge of model capabilities by widely covering multi-reference-specific problems at scale: (1) varying the number of references, (2)domain mismatchamong references (e.g., photo vs. anime), (3)scale mismatchbetween reference and target scenes, (4) references containingrare concepts(e.g., a red banana), and (5)multilingual textual referencesfor rendering. Our analysis among a variety of text-to-image models reveals their superior performances, typical failure modes, and areas for improvement. MultiBanana will be released as an open benchmark to push the boundaries and establish a standardized basis for fair comparison in multi-reference image generation. Our data and code are available at https://github.com/matsuolab/multibanana . If you find this open-source benchmark helpful, please consider upvoting for us. Thank you! This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549075",
    "title": "MultiBanana: A Challenging Benchmark for Multi-Reference Text-to-Image Generation",
    "authors": [
      "Yuta Oshima",
      "Daiki Miyake",
      "Kohsei Matsutani",
      "Hiroki Furuta"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/matsuolab/multibanana",
    "huggingface_url": "https://huggingface.co/papers/2511.22989",
    "upvote": 15
  }
}