{
  "context": "DualVLA enhances action performance while preserving reasoning capability in Vision-Language-Action models through dual-layer data pruning and dual-teacher adaptive distillation, achieving high success rates in multimodal benchmarks. To build a generalizableVision-Language-Action (VLA)model with strongreasoningability, a common strategy is to first train a specialist VLA on robot demonstrations to acquire reliable manipulation skills, and then incorporate mixed annotated robot data together with multimodal data to restore broaderreasoningcapabilities. However, we observe that the resultingreasoningVLA often suffers from degradedactionperformance compared to the specialist model before fine-tuning, a phenomenon we refer to asactiondegeneration. To address this issue, we proposeDualVLA, which enhancesactionperformance through carefully designed post-training while still preservingreasoningcapability. We first introduce adual-layer data pruningmethod that removes redundant embodiedreasoning, preventing it from adversely influencingactionlearning. To further strengthenactiongeneration, we design adual-teacher adaptive distillationstrategy that assigns different supervision signals to different data domains while maintainingreasoningability. To fill the evaluation gap for generalist VLAs, we also proposeVLA Score, which decouples VLA capability intoreasoning,intention,action, andalignmentdimensions for a more fine-grained assessment. Experiments show thatDualVLAachieves an average success rate of 61.0 inSimplerEnvand an average score of 65.4 across eight competitivemultimodal benchmarks, demonstrating a stronger balance between preciseactionexecution and multimodal understanding. Project Website: https://costaliya.github.io/DualVLA/. To build a generalizable Vision-Language-Action (VLA) model with strong reasoning ability, a common strategy is to first train a specialist VLA on robot demonstrations to acquire reliable manipulation skills, and then incorporate mixed annotated robot data together with multimodal data to restore broader reasoning capabilities. However, we observe that the resulting reasoning VLA often suffers from degraded action performance compared to the specialist model before fine-tuning, a phenomenon we refer to as action degeneration. To address this issue, we propose DualVLA, which enhances action performance through carefully designed post-training while still preserving reasoning capability. We first introduce a dual-layer data pruning method that removes redundant embodied reasoning, preventing it from adversely influencing action learning. To further strengthen action generation, we design a dual-teacher adaptive distillation strategy that assigns different supervision signals to different data domains while maintaining reasoning ability. To fill the evaluation gap for generalist VLAs, we also propose VLA Score, which decouples VLA capability into reasoning, intention, action, and alignment dimensions for a more fine-grained assessment. Experiments show that DualVLA achieves an average success rate of 61.0 in SimplerEnv and an average score of 65.4 across eight competitive multimodal benchmarks, demonstrating a stronger balance between precise action execution and multimodal understanding. Project Website:https://costaliya.github.io/DualVLA/. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549060",
    "title": "DualVLA: Building a Generalizable Embodied Agent via Partial Decoupling of Reasoning and Action",
    "authors": [
      "Zhen Fang",
      "Yu Zeng",
      "Zehui Chen",
      "Lin Chen"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.22134",
    "upvote": 21
  }
}