{
  "context": "Geometrically-Constrained Agent (GCA) addresses the semantic-to-geometric gap in vision language models by decoupling semantic analysis and task solving with formal constraints, achieving state-of-the-art performance in spatial reasoning. Vision Language Models(VLMs) exhibit a fundamentalsemantic-to-geometric gapinspatial reasoning: they excel at qualitative semantic inference but their reasoning operates within a lossy semantic space, misaligned with high-fidelity geometry. Current paradigms fail to bridge this gap.Training-based methodssuffer from an ``oracle paradox,'' learning flawed spatial logic from imperfect oracles.Tool-integrated methodsconstrain the final computation but critically leave the VLM's planning process unconstrained, resulting in geometrically flawed plans. In this work, we proposeGeometrically-Constrained Agent(GCA), a training-free agentic paradigm that resolves this gap by introducing aformal task constraint. Specifically, we strategically decouples the VLM's role into two stages. First, acting as asemantic analyst, the VLM translates the user's ambiguous query into the formal, verifiable task constraint, which defines the reference frame and objective. Second, acting as atask solver, the VLM generates and executes tool calls strictly within thedeterministic boundsdefined by the constraint. This geometrically-constrained reasoning strategy successfully resolve thesemantic-to-geometric gap, yielding a robust and verifiable reasoning pathway forspatial reasoning. Comprehensive experiments demonstrate that GCA achieves SOTA performance on multiplespatial reasoning benchmarks, surpassing existing training-based andtool-integrated methodsby ~27%. Please see our homepage at https://gca-spatial-reasoning.github.io. HomePage:https://gca-spatial-reasoning.github.ioCode:https://github.com/gca-spatial-reasoning/gca This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549034",
    "title": "Geometrically-Constrained Agent for Spatial Reasoning",
    "authors": [
      "Zeren Chen",
      "Zhijie Zheng",
      "Pengrui Li",
      "Lu Sheng"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/gca-spatial-reasoning/gca",
    "huggingface_url": "https://huggingface.co/papers/2511.22659",
    "upvote": 40
  }
}