{
  "context": "CaptionQA evaluates caption utility by measuring their effectiveness in supporting downstream tasks, revealing significant gaps compared to traditional image-QA benchmarks. Image captions serve as efficient surrogates for visual content in multimodal systems such as retrieval, recommendation, and multi-step agentic inference pipelines. Yet current evaluation practices miss a fundamental question: Can captions stand-in for images in real downstream tasks? We propose autility-based benchmark,CaptionQA, to evaluate model-generated captions, where caption quality is measured by how well it supports downstream tasks.CaptionQAis an extensible domain-dependent benchmark covering 4 domains--Natural, Document, E-commerce, and Embodied AI--each with fine-grained taxonomies (25 top-level and 69 subcategories) that identify useful information for domain-specific tasks.CaptionQAbuilds 33,027 densely annotated multiple-choice questions (50.3 per image on average) that explicitly require visual information to answer, providing a comprehensive probe of caption utility. In our evaluation protocol, anLLManswers these questions using captions alone, directly measuring whether captions preserve image-level utility and are utilizable by a downstreamLLM. Evaluating state-of-the-artMLLMsreveals substantial gaps between the image and its caption utility. Notably, models nearly identical on traditionalimage-QAbenchmarks lower by up to 32% in caption utility. We releaseCaptionQAalong with an open-source pipeline for extension to new domains. The code is available at https://github.com/bronyayang/CaptionQA. Image captions serve as efficient surrogates for visual content in multimodal systems such as retrieval, recommendation, and multi-step agentic inference pipelines. Yet current evaluation practices miss a fundamental question: Can captions stand-in for images in real downstream tasks? We propose a utility-based benchmark, CaptionQA, to evaluate model-generated captions, where caption quality is measured by how well it supports downstream tasks. CaptionQA is an extensible domain-dependent benchmark covering 4 domains–Natural, Document, E-commerce, and Embodied AI–each with fine-grained taxonomies (25 toplevel and 69 subcategories) that identify useful information for domain-specific tasks. CaptionQA builds 33,027 densely annotated multiple-choice questions (50.3 per image on average) that explicitly require visual information to answer, providing a comprehensive probe of caption utility. In our evaluation protocol, an LLM answers these questions using captions alone, directly measuring whether captions preserve image-level utility and are utilizable by a downstream LLM. Evaluating state-of-the-art MLLMs reveals substantial gaps between the image and its caption utility. Notably, models nearly identical on traditional image-QA benchmarks lower by up to 32% in caption utility. We release CaptionQA along with an open-source pipeline for extension to new domains. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend Linking an article/blog associated with this work:https://huggingface.co/blog/Borise/rethinking-mm-from-industry-view ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549049",
    "title": "CaptionQA: Is Your Caption as Useful as the Image Itself?",
    "authors": [
      "Shijia Yang",
      "Yunong Liu",
      "Bohan Zhai"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/bronyayang/CaptionQA",
    "huggingface_url": "https://huggingface.co/papers/2511.21025",
    "upvote": 27
  }
}