{
  "context": "A two-stage deterministic framework, Lotus-2, leverages diffusion models' world priors for high-quality geometric inference, achieving state-of-the-art results in monocular depth estimation and competitive surface normal prediction with limited training data. Recovering pixel-wise geometric properties from a single image is fundamentally ill-posed due to appearance ambiguity and non-injective mappings between 2D observations and 3D structures. While discriminative regression models achieve strong performance through large-scale supervision, their success is bounded by the scale, quality and diversity of available data and limited physical reasoning. Recentdiffusion modelsexhibit powerfulworld priorsthat encode geometry and semantics learned from massive image-text data, yet directly reusing their stochastic generative formulation is suboptimal for deterministic geometric inference: the former is optimized for diverse and high-fidelity image generation, whereas the latter requires stable and accurate predictions. In this work, we propose Lotus-2, a two-stagedeterministic frameworkfor stable, accurate and fine-grained geometric dense prediction, aiming to provide an optimal adaption protocol to fully exploit the pre-trained generative priors. Specifically, in the first stage, thecore predictoremploys a single-step deterministic formulation with a clean-data objective and alightweight local continuity module(LCM) to generate globally coherent structures without grid artifacts. In the second stage, the detail sharpener performs a constrained multi-steprectified-flow refinementwithin the manifold defined by thecore predictor, enhancing fine-grained geometry through noise-free deterministic flow matching. Using only 59K training samples, less than 1% of existing large-scale datasets, Lotus-2 establishes new state-of-the-art results inmonocular depth estimationand highly competitivesurface normal prediction. These results demonstrate thatdiffusion modelscan serve as deterministicworld priors, enabling high-quality geometric reasoning beyond traditional discriminative and generative paradigms. Page:https://lotus-2.github.io/Code:https://github.com/EnVision-Research/Lotus-2Demos:https://huggingface.co/spaces/haodongli/Lotus-2_Depth;https://huggingface.co/spaces/haodongli/Lotus-2_Normal This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549064",
    "title": "Lotus-2: Advancing Geometric Dense Prediction with Powerful Image Generative Model",
    "authors": [
      "Haodong Li"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/EnVision-Research/Lotus-2",
    "huggingface_url": "https://huggingface.co/papers/2512.01030",
    "upvote": 19
  }
}