{
  "context": "A physics-grounded post-training framework using verifiable rewards improves physical realism and motion quality in video diffusion models. Recentvideo diffusion modelscan synthesize visually compelling clips, yet often violate basic physical laws-objects float, accelerations drift, and collisions behave inconsistently-revealing a persistent gap between visual realism and physical realism. We proposeNewtonRewards, the first physics-grounded post-training framework for video generation based onverifiable rewards. Instead of relying on human or VLM feedback,NewtonRewardsextracts measurable proxies from generated videos using frozen utility models:optical flowserves as a proxy for velocity, whilehigh-level appearance featuresserve as a proxy for mass. These proxies enable explicit enforcement of Newtonian structure through two complementary rewards: aNewtonian kinematic constraintenforcing constant-acceleration dynamics, and amass conservation rewardpreventing trivial, degenerate solutions. We evaluateNewtonRewardson fiveNewtonian Motion Primitives(free fall, horizontal/parabolic throw, and ramp sliding down/up) using our newly constructed large-scale benchmark,NewtonBench-60K. Across all primitives in visual and physics metrics,NewtonRewardsconsistently improves physical plausibility,motion smoothness, andtemporal coherenceover prior post-training methods. It further maintains strong performance under out-of-distribution shifts in height, speed, and friction. Our results show that physics-groundedverifiable rewardsoffer a scalable path toward physics-aware video generation. Project page:https://cvlab-stonybrook.github.io/NewtonRewards This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2549019",
    "title": "What about gravity in video generation? Post-Training Newton's Laws with Verifiable Rewards",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/cvlab-stonybrook/NewtonRewards",
    "huggingface_url": "https://huggingface.co/papers/2512.00425",
    "upvote": 50
  }
}