{
  "context": "This study investigates reinforcement learning for text-to-3D generation, focusing on reward designs, RL algorithms, benchmarking, and hierarchical optimization, introducing AR3D-R1 as the first RL-enhanced model for 3D generation. Reinforcement learning(RL), earlier proven to be effective in large language and multi-modal models, has been successfully extended to enhance 2D image generation recently. However, applying RL to 3D generation remains largely unexplored due to the higher spatial complexity of 3D objects, which require globally consistent geometry and fine-grained local textures. This makes 3D generation significantly sensitive toreward designsand RL algorithms. To address these challenges, we conduct the first systematic study of RL for text-to-3D autoregressive generation across several dimensions. (1)Reward designs: We evaluate reward dimensions and model choices, showing that alignment with human preference is crucial, and that general multi-modal models provide robust signal for 3D attributes. (2) RL algorithms: We studyGRPO variants, highlighting the effectiveness oftoken-level optimization, and further investigate the scaling of training data and iterations. (3) Text-to-3D Benchmarks: Since existing benchmarks fail to measure implicit reasoning abilities in 3D generation models, we introduceMME-3DR. (4) Advanced RL paradigms: Motivated by the natural hierarchy of 3D generation, we proposeHi-GRPO, which optimizes the global-to-localhierarchical 3D generationthrough dedicated reward ensembles. Based on these insights, we developAR3D-R1, the first RL-enhanced text-to-3D model, expert from coarse shape to texture refinement. We hope this study provides insights into RL-driven reasoning for 3D generation. Code is released at https://github.com/Ivan-Tang-3D/3DGen-R1. Code is released athttps://github.com/Ivan-Tang-3D/3DGen-R1.Model is released athttps://huggingface.co/IvanTang/3DGen-R1. paper is good This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2550011",
    "title": "Are We Ready for RL in Text-to-3D Generation? A Progressive Investigation",
    "authors": [
      "Yiwen Tang",
      "Zoey Guo",
      "Kaixin Zhu",
      "Qizhi Chen",
      "Dongzhi Jiang",
      "Bohan Zeng",
      "Haoming Song",
      "Delin Qu",
      "Dan Xu"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/Ivan-Tang-3D/3DGen-R1",
    "huggingface_url": "https://huggingface.co/papers/2512.10949",
    "upvote": 45
  }
}