{
  "context": "A controlled experimental framework isolates and evaluates the contributions of pre-training, mid-training, and reinforcement learning in improving language model reasoning, demonstrating the necessity of each phase and the role of process-level rewards. Recentreinforcement learning(RL) techniques have yielded impressivereasoning improvementsinlanguage models, yet it remains unclear whether post-training truly extends a model's reasoning ability beyond what it acquires duringpre-training. A central challenge is the lack of control in modern training pipelines: large-scalepre-trainingcorpora are opaque,mid-trainingis often underexamined, and RL objectives interact with unknown prior knowledge in complex ways. To resolve this ambiguity, we develop a fully controlled experimental framework that isolates the causal contributions ofpre-training,mid-training, andRL-based post-training. Our approach employssynthetic reasoning taskswith explicit atomic operations,parseable step-by-step reasoning traces, and systematic manipulation of training distributions. We evaluate models along two axes:extrapolative generalizationto more complex compositions andcontextual generalizationacross surface contexts. Using this framework, we reconcile competing views on RL's effectiveness. We show that: 1) RL produces true capability gains (pass@128) only whenpre-trainingleaves sufficient headroom and when RL data target the model's edge of competence, tasks at the boundary that are difficult but not yet out of reach. 2)Contextual generalizationrequires minimal yet sufficientpre-trainingexposure, after which RL can reliably transfer. 3)Mid-trainingsignificantly enhances performance under fixed compute compared with RL only, demonstrating its central but underexplored role in training pipelines. 4) Process-level rewards reducereward hackingand improvereasoning fidelity. Together, these results clarify the interplay betweenpre-training,mid-training, and RL, offering a foundation for understanding and improving reasoning LM training strategies. We develop a fully controlled experimental framework that isolates the causal contributions of pre-training, mid-training, and RL-based post-training. We show that: 1) RL produces true capability gains (pass@128) only when pre-training leaves sufficient headroom and when RL data target the model’s edge of competence, tasks at the boundary that are difficult but not yet out of reach. 2) Contextual generalization requires minimal yet sufficient pre-training exposure, after which RL can reliably transfer. 3) Mid-training significantly enhances performance under fixed compute compared with RL only, demonstrating its central but underexplored role in training pipelines. 4) Process-level rewards reduce reward hacking and improve reasoning fidelity. Very nice paper. I wonder if authors tried following experimentIn mid-training: instead of using mid-difficulty examples (op 11-14), use the hard ones (op 15-19). I'm curious to know if training on hard ones can automatically enable model perform on easier ones. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2550017",
    "title": "On the Interplay of Pre-Training, Mid-Training, and RL on Reasoning Language Models",
    "authors": [
      "Charlie Zhang",
      "Xiang Yue"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/Interplay-LM-Reasoning/Interplay-LM-Reasoning",
    "huggingface_url": "https://huggingface.co/papers/2512.07783",
    "upvote": 36
  }
}