{
  "context": "SpaceControl enables explicit spatial control of 3D generation using various geometric inputs, outperforming existing methods in geometric faithfulness while maintaining visual quality. Generative methodsfor3D assetshave recently achieved remarkable progress, yet providing intuitive and precise control over the object geometry remains a key challenge. Existing approaches predominantly rely on text orimage prompts, which often fall short in geometric specificity: language can be ambiguous, and images are cumbersome to edit. In this work, we introduceSpaceControl, a training-free test-time method for explicit spatial control of 3D generation. Our approach accepts a wide range ofgeometric inputs, from coarseprimitivesto detailedmeshes, and integrates seamlessly with modernpre-trained generative modelswithout requiring any additional training. A controllable parameter lets users trade off betweengeometric fidelityand output realism. Extensive quantitative evaluation and user studies demonstrate thatSpaceControloutperforms both training-based and optimization-based baselines in geometric faithfulness while preserving highvisual quality. Finally, we present aninteractive user interfacethat enables online editing ofsuperquadricsfor direct conversion into textured3D assets, facilitating practical deployment in creative workflows. Find our project page at https://spacecontrol3d.github.io/ Generative methods for 3D assets have recently achieved remarkable progress, yet providing intuitive and precise control over the object geometry remains a key challenge. Existing approaches predominantly rely on text or image prompts, which often fall short in geometric specificity: language can be ambiguous, and images are cumbersome to edit. In this work, we introduce SpaceControl, a training-free test-time method for explicit spatial control of 3D generation. Our approach accepts a wide range of geometric inputs, from coarse primitives to detailed meshes, and integrates seamlessly with modern pre-trained generative models without requiring any additional training. A controllable parameter lets users trade off between geometric fidelity and output realism. Extensive quantitative evaluation and user studies demonstrate that SpaceControl outperforms both training-based and optimization-based baselines in geometric faithfulness while preserving high visual quality. Finally, we present an interactive user interface that enables online editing of superquadrics for direct conversion into textured 3D assets, facilitating practical deployment in creative workflows. Find our project page at this https URL This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2550034",
    "title": "SpaceControl: Introducing Test-Time Spatial Control to 3D Generative Modeling",
    "authors": [
      "Elisabetta Fedele"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2512.05343",
    "upvote": 24
  }
}