{
  "context": "A modular neural ISP framework provides high rendering accuracy, scalability, and flexibility for diverse photo-editing operations with competitive results. This paper presents a modular neural image signal processing (ISP) framework that processes raw inputs and renders high-quality display-referred images. Unlike priorneural ISPdesigns, our method introduces a high degree of modularity, providing full control over multiple intermediate stages of the rendering process.~Thismodular designnot only achieves highrendering accuracybut also improvesscalability,debuggability,generalizationto unseen cameras, and flexibility to match differentuser-preference styles. To demonstrate the advantages of this design, we built a user-interactivephoto-editing toolthat leverages ourneural ISPto support diverse editing operations and picture styles. The tool is carefully engineered to take advantage of the high-quality rendering of ourneural ISPand to enable unlimitedpost-editable re-rendering. Our method is a fully learning-based framework with variants of different capacities, all of moderate size (ranging from ~0.5 M to ~3.9 M parameters for the entire pipeline), and consistently delivers competitive qualitative and quantitative results across multiple test sets. Watch the supplemental video at: https://youtu.be/ByhQjQSjxVM  🎬Click to watch the video We present amodular neural image signal processing(ISP) framework that produces high-quality display-referred images while providing a high degree of modularity with explicit control over multiple intermediate stages of the rendering pipeline. Our ISP is fully differentiable and requires no manual tuning, and its modular structure not only improves rendering accuracy but also enhances scalability, debuggability, generalization to unseen cameras, and flexibility to support different user-preference picture styles within a lightweight and efficient design. On top of this modular neural ISP, we developed a user-interactive photo-editing tool that supports diverse editing operations, different picture styles, and enables unlimited post-editable re-rendering and re-styling. The tool accepts DNG raw images from any camera as well as sRGB images from third-party sources. Across multiple test sets, our method consistently delivers competitive qualitative and quantitative performance. Links:paper-code This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2550082",
    "title": "Modular Neural Image Signal Processing",
    "authors": [
      "Mahmoud Afifi"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/mahmoudnafifi/modular_neural_isp",
    "huggingface_url": "https://huggingface.co/papers/2512.08564",
    "upvote": 6
  }
}