{
  "context": "Visionary is an open web-native platform enabling real-time rendering of 3D Gaussian Splatting and meshes with efficient GPU-based inference, supporting dynamic content and generative models. Neural rendering, particularly3D Gaussian Splatting(3DGS), has evolved rapidly and become a key component for building world models. However, existing viewer solutions remain fragmented, heavy, or constrained by legacy pipelines, resulting in high deployment friction and limited support for dynamic content and generative models. In this work, we present Visionary, an open, web-native platform for real-time various Gaussian Splatting and meshes rendering. Built on an efficientWebGPUrenderer with per-frameONNX inference, Visionary enables dynamic neural processing while maintaining a lightweight, \"click-to-run\" browser experience. It introduces a standardizedGaussian Generator contract, which not only supports standard3DGSrendering but also allows plug-and-play algorithms to generate or update Gaussians each frame. Such inference also enables us to apply feedforward generative post-processing. The platform further offers a plug inthree.jslibrary with a conciseTypeScript APIfor seamless integration into existing web applications. Experiments show that, under identical3DGSassets, Visionary achieves superior rendering efficiency compared to current Web viewers due toGPU-based primitive sorting. It already supports multiple variants, includingMLP-based 3DGS,4DGS,neural avatars, andstyle transformationor enhancement networks. By unifying inference and rendering directly in the browser, Visionary significantly lowers the barrier to reproduction, comparison, and deployment of3DGS-family methods, serving as a unifiedWorld Model Carrierfor both reconstructive and generative paradigms. TL;DR: Visionary is an open, web-native platform built on WebGPU and ONNX Runtime. Enabling real-time rendering of diverse Gaussian Splatting variants (3DGS, MLP-based 3DGS, 4DGS, Neural Avatars and ✨any future algorithms✨), and traditional 3d Mesh, directly in the browser. It also supports post-processing using feed-forward networks. • 💻 GitHub:https://github.com/Visionary-Laboratory/visionary• 🌍 Project page：https://visionary-laboratory.github.io/visionary/• 🎬 Video:https://www.youtube.com/watch?v=-K8EjMfk09c• 📝 Technical report:https://arxiv.org/abs/2512.08478 This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2550003",
    "title": "Visionary: The World Model Carrier Built on WebGPU-Powered Gaussian Splatting Platform",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/Visionary-Laboratory/visionary",
    "huggingface_url": "https://huggingface.co/papers/2512.08478",
    "upvote": 76
  }
}