{
  "context": "TrackingWorld provides dense 3D tracking of pixels in a world-centric coordinate system by upsampling sparse 2D tracks and optimizing camera poses and 3D coordinates. Monocular 3D trackingaims to capture the long-term motion of pixels in 3D space from a single monocular video and has witnessed rapid progress in recent years. However, we argue that the existingmonocular 3D trackingmethods still fall short in separating the camera motion from foreground dynamic motion and cannot densely track newly emerging dynamic subjects in the videos. To address these two limitations, we propose TrackingWorld, a novel pipeline fordense 3D trackingof almost all pixels within aworld-centric 3D coordinate system. First, we introduce atracking upsamplerthat efficiently lifts the arbitrary sparse2D tracksinto dense2D tracks. Then, to generalize the current tracking methods to newly emerging objects, we apply the upsampler to all frames and reduce the redundancy of2D tracksby eliminating the tracks in overlapped regions. Finally, we present an efficientoptimization-based frameworkto back-project dense2D tracksinto world-centric 3D trajectories by estimating thecamera posesand the3D coordinatesof these2D tracks. Extensive evaluations on both synthetic andreal-world datasetsdemonstrate that our system achieves accurate anddense 3D trackingin a world-centric coordinate frame. Monocular 3D tracking aims to capture the long-term motion of pixels in 3D space from a single monocular video and has witnessed rapid progress in recent years. However, we argue that the existing monocular 3D tracking methods still fall short in separating the camera motion from foreground dynamic motion and cannot densely track newly emerging dynamic subjects in the videos. To address these two limitations, we propose TrackingWorld, a novel pipeline for dense 3D tracking of almost all pixels within a world-centric 3D coordinate system. First, we introduce a tracking upsampler that efficiently lifts the arbitrary sparse 2D tracks into dense 2D tracks. Then, to generalize the current tracking methods to newly emerging objects, we apply the upsampler to all frames and reduce the redundancy of 2D tracks by eliminating the tracks in overlapped regions. Finally, we present an efficient optimization-based framework to back-project dense 2D tracks into world-centric 3D trajectories by estimating the camera poses and the 3D coordinates of these 2D tracks. Extensive evaluations on both synthetic and real-world datasets demonstrate that our system achieves accurate and dense 3D tracking in a world-centric coordinate frame. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2550086",
    "title": "TrackingWorld: World-centric Monocular 3D Tracking of Almost All Pixels",
    "authors": [
      "Weitao Xiong"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/IGL-HKUST/TrackingWorld",
    "huggingface_url": "https://huggingface.co/papers/2512.08358",
    "upvote": 5
  }
}