{
  "context": "A quantitative framework for agent system scaling using empirical coordination metrics identifies optimal multi-agent strategies based on task properties. Agents,language model (LM)-based systems that are capable ofreasoning,planning, andactingare becoming the dominant paradigm for real-world AI applications. Despite this widespread adoption, the principles that determine their performance remain underexplored, leaving practitioners to rely on heuristics rather than principled design choices. We address this gap by derivingquantitative scaling principlesforagent systems. We evaluate this across four diverse benchmarks:Finance-Agent,BrowseComp-Plus,PlanCraft, andWorkbench. Using five canonical architectures (Single,Independent,Centralized,Decentralized,Hybrid) instantiated across threeLLM families, we perform a controlled evaluation spanning 180 configurations with standardized tools and token budgets. We derive apredictive modelusing empiricalcoordination metrics, includingefficiency,overhead,error amplification, andredundancy, that achieves cross-validated R^2=0.513. We identify three dominant effects: (1) atool-coordination trade-off: under fixed computational budgets, tool-heavy tasks suffer disproportionately from multi-agentoverhead. (2) acapability saturation: coordination yields diminishing or negative returns (beta=-0.408, p<0.001) oncesingle-agent baselines exceed ~45%. (3)topology-dependent error amplification:independentagents amplify errors 17.2x through unchecked propagation, whilecentralized coordinationcontains this to 4.4x.Centralized coordinationimproves performance by 80.9% on parallelizable tasks like financialreasoning, whiledecentralized coordinationexcels on dynamic web navigation (+9.2% vs. +0.2%). Yet forsequential reasoning tasks, all multi-agent variants degraded performance by 39-70%. The framework predicts the optimal coordination strategy for 87% of held-out configurations, providing a predictive principle ofagentic scalingbased on measurable task properties.  so single agents perform better at centralized tasks  (e.g. planning) and parallel agents at independent tasks. the main limitations being \"coordination tax\" for parallel agents and \"capability saturation\" for single agents. it seems like a perfect opportunity for a dynamic mixed strategy and adaptive topology? This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2550057",
    "title": "Towards a Science of Scaling Agent Systems",
    "authors": [],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2512.08296",
    "upvote": 14
  }
}