{
  "context": "RealGen is a photorealistic text-to-image framework that uses an LLM for prompt optimization and a diffusion model for image generation, enhanced by a Detector Reward mechanism and RealBench for automated evaluation. With the continuous advancement of image generation technology, advanced models such as GPT-Image-1 and Qwen-Image have achieved remarkable text-to-image consistency and world knowledge However, these models still fall short in photorealistic image generation. Even on simple T2I tasks, they tend to produce \" fake\" images with distinct AI artifacts, often characterized by \"overly smooth skin\" and \"oily facial sheens\". To recapture the original goal of \"indistinguishable-from-reality\" generation, we propose RealGen, a photorealistic text-to-image framework. RealGen integrates anLLMcomponent for prompt optimization and adiffusion modelfor realistic image generation. Inspired by adversarial generation, RealGen introduces a \"Detector Reward\" mechanism, which quantifies artifacts and assesses realism using both semantic-level and feature-level synthetic image detectors. We leverage this reward signal with theGRPO algorithmto optimize the entire generation pipeline, significantly enhancing image realism and detail. Furthermore, we proposeRealBench, an automated evaluation benchmark employingDetector-ScoringandArena-Scoring. It enables human-free photorealism assessment, yielding results that are more accurate and aligned with real user experience. Experiments demonstrate that RealGen significantly outperforms general models like GPT-Image-1 and Qwen-Image, as well as specialized photorealistic models like FLUX-Krea, in terms of realism, detail, and aesthetics. The code is available at https://github.com/yejy53/RealGen. arXiv:https://arxiv.org/abs/2512.00473code:https://github.com/yejy53/RealGenproject page:https://yejy53.github.io/RealGen/ This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2550032",
    "title": "RealGen: Photorealistic Text-to-Image Generation via Detector-Guided Rewards",
    "authors": [
      "Yuncheng Guo"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/yejy53/RealGen",
    "huggingface_url": "https://huggingface.co/papers/2512.00473",
    "upvote": 25
  }
}