{
  "context": "Colon-X advances multimodal intelligence in colonoscopy by constructing comprehensive datasets and developing reasoning-centric models that outperform traditional methods under data scarcity. In this study, we present Colon-X, an open initiative aimed at advancingmultimodal intelligencein colonoscopy. We begin by constructingColonVQA, the most comprehensive multimodal dataset ever built for colonoscopy, featuring over 1.1M+visual question answeringentries across 76 clinical findings and 18 multimodal tasks. Beyond serving as a community-wide data foundation, we further investigate a critical yet underexplored transition in colonoscopy - evolving from multimodal understanding to clinical reasoning: (a) To capture the current landscape of multimodal understanding behaviors, we systematically assess the generalizability of 22multimodal large language modelsand examine their reliability underhuman-induced perturbations. The results reveal that clinical outputs from leading MLLMs remain far from robust and trustworthy. (b) To narrow this gap, we further explore reasoning-centric intelligence tailored for colonoscopy. Specifically, we curateColonReason, a clinically grounded reasoning dataset annotated through a multi-expert debating pipeline, and developColonR1, the firstR1-styled modelincorporatingtask-adaptive rewardingandgradient-stable optimizationtechniques. Under data-scarce conditions, ourColonR1achieves 56.61% overall accuracy, outperforming supervised fine-tuning by 25.22%, and sets a new reasoning-enabled baseline for multimodal colonoscopy analysis. All data and model resources are publicly available at https://github.com/ai4colonoscopy/Colon-X.  Colonoscopy saves lives — but AI for colonoscopy is still far from intelligent. We are excited to launch the Colon-X project, an open initiative aimed at advancing multimodal intelligence in colonoscopy and beyond. Beyond serving as a community-wide data foundation, we're focused on a critical yet under-explored transition – evolving from multimodal understanding to clinical reasoning. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2550104",
    "title": "Colon-X: Advancing Intelligent Colonoscopy from Multimodal Understanding to Clinical Reasoning",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/ai4colonoscopy/Colon-X",
    "huggingface_url": "https://huggingface.co/papers/2512.03667",
    "upvote": 3
  }
}