{
  "context": "ProPhy, a two-stage framework with Semantic and Refinement Experts, enhances video generation by incorporating physics-aware conditioning and anisotropic generation, improving physical consistency and realism. Recent advances invideo generationhave shown remarkable potential for constructingworld simulators. However, current models still struggle to produce physically consistent results, particularly when handling large-scale orcomplex dynamics. This limitation arises primarily because existing approaches respond isotropically to physical prompts and neglect the fine-grained alignment between generated content and localized physical cues. To address these challenges, we proposeProPhy, aProgressive Physical Alignment Frameworkthat enables explicit physics-aware conditioning and anisotropic generation.ProPhyemploys a two-stageMixture-of-Physics-Experts (MoPE)mechanism for discriminative physical prior extraction, whereSemantic Expertsinfersemantic-level physical principlesfrom textual descriptions, andRefinement Expertscapturetoken-level physical dynamics. This mechanism allows the model to learn fine-grained,physics-aware video representationsthat better reflect underlying physical laws. Furthermore, we introduce a physical alignment strategy that transfers thephysical reasoning capabilitiesofvision-language models (VLMs)into theRefinement Experts, facilitating a more accurate representation ofdynamic physical phenomena. Extensive experiments on physics-awarevideo generationbenchmarks demonstrate thatProPhyproduces more realistic, dynamic, and physically coherent results than existing state-of-the-art methods. Recent advances in video generation have shown remarkable potential for constructing world simulators. However, current models still struggle to produce physically consistent results, particularly when handling large-scale or complex dynamics. This limitation arises primarily because existing approaches respond isotropically to physical prompts and neglect the fine-grained alignment between generated content and localized physical cues. To address these challenges, we propose ProPhy, a Progressive Physical Alignment Framework that enables explicit physics-aware conditioning and anisotropic generation. ProPhy employs a two-stage Mixture-of-Physics-Experts (MoPE) mechanism for discriminative physical prior extraction, where Semantic Experts infer semantic-level physical principles from textual descriptions, and Refinement Experts capture token-level physical dynamics. This mechanism allows the model to learn fine-grained, physics-aware video representations that better reflect underlying physical laws. Furthermore, we introduce a physical alignment strategy that transfers the physical reasoning capabilities of vision-language models (VLMs) into the Refinement Experts, facilitating a more accurate representation of dynamic physical phenomena. Extensive experiments on physics-aware video generation benchmarks demonstrate that ProPhy produces more realistic, dynamic, and physically coherent results than existing state-of-the-art methods. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2550088",
    "title": "ProPhy: Progressive Physical Alignment for Dynamic World Simulation",
    "authors": [],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2512.05564",
    "upvote": 5
  }
}