{
  "context": "Valori introduces a deterministic AI memory system using fixed-point arithmetic to ensure bit-identical results across platforms, addressing non-determinism in vector embeddings and similarity search for trustworthy AI. Modern AI systems rely onvector embeddingsstored and searched usingfloating-point arithmetic. While effective forapproximate similarity search, this design introduces fundamentalnon-determinism: identical models, inputs, and code can produce different memory states and retrieval results across hardware architectures (e.g., x86 vs. ARM). This prevents replayability and safe deployment, leading tosilent data divergencethat prevents post-hoc verification and compromises audit trails in regulated sectors. We present Valori, a deterministic AI memory substrate that replaces floating-point memory operations withfixed-point arithmetic (Q16.16)and models memory as areplayable state machine. Valori guaranteesbit-identical memory states,snapshots, and search results across platforms. We demonstrate thatnon-determinismarises before indexing or retrieval and show how Valori enforces determinism at the memory boundary. Our results suggest thatdeterministic memoryis a necessary primitive for trustworthy AI systems. The reference implementation is open-source and available at https://github.com/varshith-Git/Valori-Kernel (archived at https://zenodo.org/records/18022660). Tags:vector-database,rust,determinism,finance,audit,hnsw,fixed-point,systems-engineering Floating-point math causes vector search results to drift between ARM (Mac) and x86 (Linux) architectures due to compiler and hardware variances.Valoriis a Q16.16 Fixed-Point kernel written in Rust that guaranteesbit-exact reproducibilityacross all hardware platforms, making it the first \"Audit-Grade\" vector engine for high-stakes AI. Most vector databases (FAISS, Pinecone, Weaviate) rely on hardware-accelerated floating-point arithmetic (f32). While fast, this introducesNon-Determinism: InRAG pipelines, this is annoying. InHigh-Frequency TradingorLegal Forensics, this variance is a liability. You cannot audit a probabilistic black box. Valori is a forensic memory engine built from scratch inRust. It replaces standard floating-point math with a customQ16.16 Fixed-Point Arithmeticsystem inside an HNSW graph. Validated on Apple M2 (ARM64) vs Intel Xeon (x86_64). Valori is designed to be embedded directly into high-integrity Rust applications. Add toCargo.toml: Example: Deterministic Ingest & Audit If you use Valori in your research, please cite: This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend arXiv lens breakdown of this paper 👉https://arxivlens.com/PaperView/Details/valori-a-deterministic-memory-substrate-for-ai-systems-2532-3eed512e ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2601071",
    "title": "Valori: A Deterministic Memory Substrate for AI Systems",
    "authors": [
      "Varshith Gudur"
    ],
    "publication_year": 2026,
    "github_url": "https://github.com/varshith-Git/Valori-Kernel",
    "huggingface_url": "https://huggingface.co/papers/2512.22280",
    "upvote": 3
  }
}