{
  "context": "Simulation optimization (SO) is frequently challenged by noisy evaluations, high computational costs, and complex, multimodal search landscapes. This paper introduces Tabu-Enhanced Simulation Optimization (TESO), a novel metaheuristic framework integrating adaptive search with memory-based strategies. TESO leverages a short-term Tabu List to prevent cycling and encourage diversification, and a long-term Elite Memory to guide intensification by perturbing high-performing solutions. An aspiration criterion allows overriding tabu restrictions for exceptional candidates. This combination facilitates a dynamic balance between exploration and exploitation in stochastic environments. We demonstrate TESO's effectiveness and reliability using an queue optimization problem, showing improved performance compared to benchmarks and validating the contribution of its memory components. Source code and data are available at: https://github.com/bulentsoykan/TESO. Simulation optimization (SO) is frequently challenged by noisy evaluations, high computationalcosts, and complex, multimodal search landscapes. This paper introduces Tabu-Enhanced Simulation Optimization (TESO), a novel metaheuristic framework integrating adaptive search withmemory-based strategies. TESO leverages a short-term Tabu List to prevent cycling and encouragediversification, and a long-term Elite Memory to guide intensification by perturbing high-performingsolutions. An aspiration criterion allows overriding tabu restrictions for exceptional candidates.This combination facilitates a dynamic balance between exploration and exploitation in stochasticenvironments. We demonstrate TESO’s effectiveness and reliability using an queue optimizationproblem, showing improved performance compared to benchmarks and validating the contribution ofits memory components. Source code and data are available at: github.com/bulentsoykan/TESO. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2601073",
    "title": "TESO Tabu Enhanced Simulation Optimization for Noisy Black Box Problems",
    "authors": [],
    "publication_year": 2026,
    "github_url": "https://github.com/bulentsoykan/TESO",
    "huggingface_url": "https://huggingface.co/papers/2512.24007",
    "upvote": 2
  }
}