{
  "context": "CoLog, a log anomaly detection framework, employs collaborative transformers and multi-head impressed attention with a modality adaptation layer to achieve high-precision detection of both point and collective anomalies across diverse log modalities. Log anomaly detection is crucial for preserving the security of operating systems. Depending on the source of log data collection, various information is recorded in logs that can be considered log modalities. In light of this intuition, unimodal methods often struggle by ignoring the different modalities of log data. Meanwhile, multimodal methods fail to handle the interactions between these modalities. Applying multimodal sentiment analysis to log anomaly detection, we proposeCoLog, a framework that collaboratively encodes logs utilizing various modalities.CoLogutilizescollaborative transformersandmulti-head impressed attentionto learn interactions among several modalities, ensuring comprehensive anomaly detection. To handle the heterogeneity caused by these interactions,CoLogincorporates amodality adaptation layer, which adapts the representations from different log modalities. This methodology enablesCoLogto learn nuanced patterns and dependencies within the data, enhancing its anomaly detection capabilities. Extensive experiments demonstrateCoLog's superiority over existing state-of-the-art methods. Furthermore, in detecting both point and collective anomalies,CoLogachieves a mean precision of 99.63%, a mean recall of 99.59%, and a mean F1 score of 99.61% across seven benchmark datasets for log-based anomaly detection. The comprehensive detection capabilities ofCoLogmake it highly suitable for cybersecurity, system monitoring, and operational efficiency.CoLogrepresents a significant advancement in log anomaly detection, providing a sophisticated and effective solution to point and collective anomaly detection through a unified framework and a solution to the complex challenges automatic log data analysis poses. We also provide the implementation ofCoLogat https://github.com/NasirzadehMoh/CoLog.  This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend arXiv lens breakdown of this paper 👉https://arxivlens.com/PaperView/Details/a-unified-framework-for-detecting-point-and-collective-anomalies-in-operating-system-logs-via-collaborative-transformers-8543-7dac2c50 ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2601015",
    "title": "A unified framework for detecting point and collective anomalies in operating system logs via collaborative transformers",
    "authors": [
      "Mohammad Nasirzadeh"
    ],
    "publication_year": 2026,
    "github_url": "https://github.com/NasirzadehMoh/CoLog",
    "huggingface_url": "https://huggingface.co/papers/2512.23380",
    "upvote": 42
  }
}