{
  "context": "CVD-STORM, a cross-view video diffusion model with a spatial-temporal reconstruction VAE, enhances video generation quality and provides depth estimation for dynamic scenes. Generative models have been widely applied to world modeling for environment\nsimulation and future state prediction. With advancements in autonomous\ndriving, there is a growing demand not only for high-fidelity video generation\nunder various controls, but also for producing diverse and meaningful\ninformation such as depth estimation. To address this, we propose CVD-STORM, across-view video diffusion modelutilizing aspatial-temporal reconstructionVariational Autoencoder (VAE)that generates long-term, multi-view videos with4D reconstructioncapabilities under various control inputs. Our approach first\nfine-tunes the VAE with an auxiliary4D reconstructiontask, enhancing its\nability to encode 3D structures and temporal dynamics. Subsequently, we\nintegrate this VAE into the video diffusion process to significantly improve\ngeneration quality. Experimental results demonstrate that our model achieves\nsubstantial improvements in bothFIDandFVDmetrics. Additionally, the\njointly-trainedGaussian Splatting Decodereffectively reconstructs dynamic\nscenes, providing valuable geometric information for comprehensive scene\nunderstanding. We will publish our code on our codebasehttps://github.com/SenseTime-FVG/OpenDWM This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2542064",
    "title": "CVD-STORM: Cross-View Video Diffusion with Spatial-Temporal\n  Reconstruction Model for Autonomous Driving",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/SenseTime-FVG/OpenDWM",
    "huggingface_url": "https://huggingface.co/papers/2510.07944",
    "upvote": 24
  }
}