{
  "context": "AutoPR, a multi-agent framework, automates the promotion of research papers by transforming them into engaging public content, significantly improving engagement metrics compared to direct LLM pipelines. As the volume of peer-reviewed research surges, scholars increasingly rely on\nsocial platforms for discovery, while authors invest considerable effort in\npromoting their work to ensure visibility and citations. To streamline this\nprocess and reduce the reliance on human effort, we introduce Automatic\nPromotion (AutoPR), a novel task that transforms research papers into accurate,\nengaging, and timely public content. To enable rigorous evaluation, we release\nPRBench, amultimodal benchmarkthat links 512 peer-reviewed articles to\nhigh-quality promotional posts, assessing systems along three axes: Fidelity\n(accuracy and tone), Engagement (audience targeting and appeal), and Alignment\n(timing and channel optimization). We also introduce PRAgent, a multi-agent\nframework that automates AutoPR in three stages:content extractionwith\nmultimodal preparation,collaborative synthesisfor polished outputs, andplatform-specific adaptationto optimize norms, tone, and tagging for maximum\nreach. When compared to directLLM pipelineson PRBench, PRAgent demonstrates\nsubstantial improvements, including a 604% increase in total watch time, a 438%\nrise in likes, and at least a 2.9x boost in overall engagement. Ablation\nstudies show that platform modeling and targeted promotion contribute the most\nto these gains. Our results position AutoPR as a tractable, measurable research\nproblem and provide a roadmap for scalable, impactful automated scholarly\ncommunication. 🧐 Why AutoPR?The academic community continues to expand output each year without a corresponding increase in visibility or value. In 2024 alone, NeurIPS accepted over 4,000 papers, with conference volumes at CVPR and ICCV also soaring. In such an environment of overwhelming information, how can individual research stand out? Limitations of Traditional Human-Curated Promotion:🤯 Manually creating post-publication publicity is time-consuming: writing copy, selecting visuals, and adapting to multiple platforms can take hours or even days per paper.😭 Worse, such posts often fail to match platform styles and end up buried by recommendation algorithms.Can Existing LLMs Help? 💡Concept Overview — AutoPR This work propose a new task, AutoPR, which enables large language models (LLMs) to automatically generate accurate, engaging, and platform-optimized promotional content directly from research materials — including manuscripts, figures, and supplementary data. [Figure 2] To support this task, this work introduce PRBench, the first benchmark dataset for academic promotion. It contains 512 published papers paired with human-written high-quality promotional examples, establishing gold standards for three core metrics: 🍖 Findings  🔧 Solution — PRAgent  We propose PRAgent, a three-stage multi-agent system for end-to-end generation of research promotion content.🧩 Content Extraction: Hierarchical summarization and PDF layout analysis enable precise alignment between visual and textual components.🤝Multi-Agent Synthesis: Specialized agents collaboratively compose a coherent and visually integrated draft that highlights key contributions.🎯 Platform Adaptation: The final output is refined for tone, format, hashtags, and visual layout, producing platform-optimized, ready-to-publish content. 📊 Key ResultsOn the PRBench-Core dataset, PRAgent achieves an average improvement of at least 7.15% over direct LLM generation, with boosts exceeding 20% for certain models.In real-world deployment on the Xiaohongshu platform over a continuous 10-day test (PRAgent  @Synaptic Flow  vs. Direct Baseline@EmergentMind ):  ☺️ Broader ImpactBeyond saving researchers substantial time and effort, AutoPR and PRAgent seek to democratize the dissemination of scientific knowledge—empowering those less skilled in self-promotion to achieve equal visibility in the global research ecosystem. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2542025",
    "title": "AutoPR: Let's Automate Your Academic Promotion!",
    "authors": [
      "Qiguang Chen",
      "Zheng Yan"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/LightChen233/AutoPR",
    "huggingface_url": "https://huggingface.co/papers/2510.09558",
    "upvote": 51
  }
}