{
  "context": "DiT360 framework enhances panoramic image generation by hybrid training on perspective and panoramic data, incorporating cross-domain knowledge and hybrid supervision to improve boundary consistency and image fidelity. In this work, we proposeDiT360, aDiT-based framework that performs hybrid\ntraining on perspective andpanoramic datafor panoramic image generation. For\nthe issues of maintaininggeometric fidelityandphotorealismin generation\nquality, we attribute the main reason to the lack of large-scale, high-quality,\nreal-worldpanoramic data, where such a data-centric view differs from prior\nmethods that focus on model design. Basically,DiT360 has several key modules\nfor inter-domain transformation and intra-domain augmentation, applied at both\nthepre-VAEimage level and thepost-VAEtoken level. At the image level, we\nincorporatecross-domain knowledgethroughperspective image guidanceandpanoramic refinement, which enhanceperceptual qualitywhile regularizingdiversityandphotorealism. At the token level, hybrid supervision is applied\nacross multiple modules, which includecircular paddingfor boundary\ncontinuity,yaw lossfor rotational robustness, andcube lossfor distortion\nawareness. Extensive experiments ontext-to-panorama,inpainting, andoutpaintingtasks demonstrate that our method achieves better boundary\nconsistency and image fidelity across eleven quantitative metrics. Our code is\navailable at https://github.com/Insta360-Research-Team/DiT360. Code:https://github.com/Insta360-Research-Team/DiT360Web Page:https://fenghora.github.io/DiT360-Page/Demo:https://huggingface.co/spaces/Insta360-Research/DiT360Pretrained Model:https://huggingface.co/Insta360-Research/DiT360-Panorama-Image-GenerationDataset:https://huggingface.co/datasets/Insta360-Research/Matterport3D_polished @fenghoraThe model link and the dataset link are the same in the comment. 👆 Dataset:https://huggingface.co/datasets/Insta360-Research/Matterport3D_polished Thanks for pointing that out! The links were the same by mistake — we’ve corrected it now. Appreciate your attention! This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2542049",
    "title": "DiT360: High-Fidelity Panoramic Image Generation via Hybrid Training",
    "authors": [
      "Haoran Feng",
      "Xiangtai Li"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/Insta360-Research-Team/DiT360",
    "huggingface_url": "https://huggingface.co/papers/2510.11712",
    "upvote": 30
  }
}