{
  "context": "Agentic reinforcement learning enhances LLMs' reasoning ability through real datasets, exploration techniques, and a deliberative strategy, achieving strong performance with smaller models. Recently, the emergence ofagentic RLhas showcased that RL could also\neffectively improve the agentic reasoning ability of LLMs, yet the key design\nprinciples and optimal practices remain unclear. In this work, we conduct a\ncomprehensive and systematic investigation to demystify reinforcement learning\nin agentic reasoning from three key perspectives: data, algorithm, and\nreasoning mode. We highlight our key insights: (i) Replacing stitched synthetic\ntrajectories withreal end-to-end tool-use trajectoriesyields a far strongerSFT initialization; high-diversity,model-aware datasetssustain exploration\nand markedly improve RL performance. (ii)Exploration-friendly techniquesare\ncrucial foragentic RL, such asclip higher,overlong reward shaping, and\nmaintaining adequatepolicy entropycould improve the training efficiency.\n(iii) Adeliberative strategywith fewer tool calls outperforms frequent tool\ncalls or verbose self-reasoning, improving tool efficiency and final accuracy.\nTogether, these simple practices consistently enhance agentic reasoning and\ntraining efficiency, achieving strong results on challenging benchmarks with\nsmaller models, and establishing a practical baseline for futureagentic RLresearch. Beyond these empirical insights, we further contribute a\nhigh-quality, real end-to-endagentic SFT datasetalong with a high-quality RL\ndataset, and demonstrate the effectiveness of our insights in boosting the\nagentic reasoning ability of LLMs across four challenging benchmarks, includingAIME2024/AIME2025,GPQA-Diamond, andLiveCodeBench-v6. With our recipes,\n4B-sized models could also achieve superior agentic reasoning performance\ncompared to 32B-sized models. Code and models:\nhttps://github.com/Gen-Verse/Open-AgentRL Code, data and models:https://github.com/Gen-Verse/Open-AgentRL This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2542046",
    "title": "Demystifying Reinforcement Learning in Agentic Reasoning",
    "authors": [
      "Ling Yang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/Gen-Verse/Open-AgentRL",
    "huggingface_url": "https://huggingface.co/papers/2510.11701",
    "upvote": 31
  }
}