{
  "context": "Stable Video Infinity generates infinite-length videos with high temporal consistency and controllable storylines by using Error-Recycling Fine-Tuning on the Diffusion Transformer. We propose Stable Video Infinity (SVI) that is able to generate\ninfinite-length videos with hightemporal consistency, plausible scene\ntransitions, and controllable streaming storylines. While existing long-video\nmethods attempt to mitigate accumulated errors via handcrafted anti-drifting\n(e.g., modified noise scheduler, frame anchoring), they remain limited to\nsingle-prompt extrapolation, producing homogeneous scenes with repetitive\nmotions. We identify that the fundamental challenge extends beyond error\naccumulation to a critical discrepancy between the training assumption (seeing\nclean data) and the test-time autoregressive reality (conditioning on\nself-generated, error-prone outputs). To bridge this hypothesis gap, SVI\nincorporatesError-Recycling Fine-Tuning, a new type of efficient training that\nrecycles theDiffusion Transformer(DiT)'s self-generated errors into\nsupervisory prompts, thereby encouragingDiTto actively identify and correct\nits own errors. This is achieved by injecting, collecting, and banking errors\nthrough closed-loop recycling, autoregressively learning from error-injected\nfeedback. Specifically, we (i) inject historical errors made byDiTto\nintervene on clean inputs, simulating error-accumulated trajectories in flow\nmatching; (ii) efficiently approximate predictions with one-step bidirectional\nintegration and calculate errors with residuals; (iii) dynamically bank errors\nintoreplay memoryacross discretized timesteps, which are resampled for new\ninput. SVI is able to scale videos from seconds to infinite durations with no\nadditional inference cost, while remaining compatible with diverse conditions\n(e.g., audio, skeleton, and text streams). We evaluate SVI on three benchmarks,\nincluding consistent, creative, and conditional settings, thoroughly verifying\nits versatility and state-of-the-art role. Stable-Video-Infinity(SVI)is able to generate ANY-length videos with high temporal consistency, plausible scene transitions, and controllable streaming storylines in ANY domains. paper:https://arxiv.org/abs/2510.09212project page:https://stable-video-infinity.github.io/homepage/code:https://github.com/vita-epfl/Stable-Video-Infinitymodel:https://huggingface.co/vita-video-gen/svi-modeldataset:https://huggingface.co/datasets/vita-video-gen/svi-benchmark This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2542081",
    "title": "Stable Video Infinity: Infinite-Length Video Generation with Error\n  Recycling",
    "authors": [
      "Wuyang Li"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/vita-epfl/Stable-Video-Infinity",
    "huggingface_url": "https://huggingface.co/papers/2510.09212",
    "upvote": 17
  }
}