{
  "context": "FlashWorld generates 3D scenes from single images or text prompts quickly and with high quality by combining MV-oriented and 3D-oriented generation methods. We propose FlashWorld, agenerative modelthat produces3D scenesfrom asingle imageortext promptin seconds, 10~100times faster than previous\nworks while possessing superior rendering quality. Our approach shifts from the\nconventional multi-view-oriented (MV-oriented) paradigm, which generates\nmulti-view images for subsequent 3D reconstruction, to a3D-oriented approachwhere the model directly produces3D Gaussian representationsduring multi-view\ngeneration. While ensuring 3D consistency, 3D-oriented method typically suffers\npoor visual quality. FlashWorld includes adual-mode pre-trainingphase\nfollowed by across-mode post-trainingphase, effectively integrating the\nstrengths of both paradigms. Specifically, leveraging the prior from a video\ndiffusion model, we first pre-train a dual-modemulti-view diffusion model,\nwhich jointly supports MV-oriented and 3D-oriented generation modes. To bridge\nthe quality gap in 3D-oriented generation, we further propose a cross-mode\npost-training distillation by matching distribution from consistent 3D-oriented\nmode to high-quality MV-oriented mode. This not only enhances visual quality\nwhile maintaining 3D consistency, but also reduces the requireddenoising stepsfor inference. Also, we propose a strategy to leverage massive single-view\nimages andtext prompts during this process to enhance the model's\ngeneralization toout-of-distribution inputs. Extensive experiments demonstrate\nthe superiority and efficiency of our method. TLDR: FlashWorld enables fast (7 seconds on a single A100/A800 GPU) and high-quality 3D scene generation across diverse scenes, from a single image or text prompt.  Project Page:https://imlixinyang.github.io/FlashWorld-Project-Page/Demo:  This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2542016",
    "title": "FlashWorld: High-quality 3D Scene Generation within Seconds",
    "authors": [
      "Zixiao Gu"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/imlixinyang/FlashWorld",
    "huggingface_url": "https://huggingface.co/papers/2510.13678",
    "upvote": 72
  }
}