{
  "context": "LATTICE, a hierarchical retrieval framework, enables efficient and accurate reasoning over large document collections using a semantic tree structure and a traversal algorithm that calibrates relevance scores. Modern IR systems are increasingly tasked with answering complex,\nmulti-faceted queries that require deep reasoning rather than simple keyword or\nsemantic matching. WhileLLM-based IRhas shown great promise, the prevailingretrieve-then-rerankparadigm inherits the limitations of embedding-based\nretrieval;parametric generative approachesare difficult to update with new\ninformation; andlong-context methodsthat place the entire corpus in context\nare computationally infeasible for large document collections. To address these\nchallenges, we introduce LATTICE, ahierarchical retrieval frameworkthat\nenables an LLM to reason over and navigate large corpora with logarithmic\nsearch complexity by imposing asemantic tree structureon the corpus. Our\napproach consists of two stages: (1) anoffline phasethat organizes the corpus\ninto a semantic hierarchy via either abottom-up agglomerative strategyor atop-down divisive strategyusingmulti-level summariesand (2) an online\ntraversal phase where asearch LLMnavigates this tree. A central challenge in\nsuch LLM-guided search is that the model'srelevance judgmentsare noisy,\ncontext-dependent, and unaware of the hierarchy, making cross-branch and\ncross-level comparisons difficult. To overcome this, we propose a traversal\nalgorithm that estimates calibratedlatent relevance scoresfrom local LLM\noutputs and aggregates them into aglobal path relevance metric. Our\ntraining-free framework achieves state-of-the-artzero-shot performanceon the\nreasoning-intensiveBRIGHT benchmark, demonstrating up to 9% improvement inRecall@100and 5% innDCG@10over the next best zero-shot baseline.\nFurthermore, compared to the fine-tuned SOTA methodDIVER-v2, LATTICE attains\ncomparable results on BRIGHT subsets that use a static corpus for evaluation. LATTICE turns retrieval into an LLM-driven navigation problem over a semantic scaffold for computational tractability needed for large corpora. 🔗 Project page:https://nilesh2797.github.io/publications/lattice/🔗 Paper link:https://arxiv.org/abs/2510.13217🔗 Code link:https://github.com/nilesh2797/lattice🔗 Colab link:https://colab.research.google.com/drive/1AwDrHzipFVe-9kNAUJjCC4CNL4soRsqb?usp=sharing This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2542071",
    "title": "LLM-guided Hierarchical Retrieval",
    "authors": [
      "Nilesh Gupta"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/nilesh2797/lattice",
    "huggingface_url": "https://huggingface.co/papers/2510.13217",
    "upvote": 20
  }
}