{
  "context": "Tangential Amplifying Guidance (TAG) improves diffusion model sample quality by directly amplifying tangential components of estimated scores without modifying the model architecture. Recentdiffusion modelsachieve the state-of-the-art performance in image\ngeneration, but often suffer fromsemantic inconsistenciesorhallucinations.\nWhile variousinference-time guidancemethods can enhance generation, they\noften operate indirectly by relying on external signals or architectural\nmodifications, which introduces additional computational overhead. In this\npaper, we propose Tangential Amplifying Guidance (TAG), a more efficient and\ndirect guidance method that operates solely ontrajectory signalswithout\nmodifying the underlying diffusion model. TAG leverages anintermediate sampleas aprojection basisand amplifies thetangential componentsof the estimated\nscores with respect to this basis to correct thesampling trajectory. We\nformalize this guidance process by leveraging afirst-order Taylor expansion,\nwhich demonstrates that amplifying the tangential component steers the state\ntowardhigher-probability regions, thereby reducing inconsistencies and\nenhancing sample quality. TAG is aplug-and-play,architecture-agnosticmodule\nthat improves diffusion sampling fidelity with minimal computational addition,\noffering a new perspective on diffusion guidance. Recent diffusion models achieve the state-of-the-art performance in image generation, but often suffer from semantic inconsistencies or hallucinations. While various inference-time guidance methods can enhance generation, they often operate indirectly by relying on external signals or architectural modifications, which introduces additional computational overhead. In this paper, we propose Tangential Amplifying Guidance (TAG), a more efficient and direct guidance method that operates solely on trajectory signals without modifying the underlying diffusion model. TAG leverages an intermediate sample as a projection basis and amplifies the tangential components of the estimated scores with respect to this basis to correct the sampling trajectory. We formalize this guidance process by leveraging a first-order Taylor expansion, which demonstrates that amplifying the tangential component steers the state toward higher-probability regions, thereby reducing inconsistencies and enhancing sample quality. TAG is a plug-and-play, architecture-agnostic module that improves diffusion sampling fidelity with minimal computational addition, offering a new perspective on diffusion guidance. Project:https://hyeon-cho.github.io/TAG/Paper(arXiv):https://arxiv.org/pdf/2510.04533Demo (w/ code):https://huggingface.co/spaces/hyeoncho01/Tangential-Amplifying-Guidancegithub:https://github.com/hyeon-cho/Tangential-Amplifying-Guidance This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend Can this be turned into a comfyui node? https://github.com/comfyanonymous/ComfyUI/pull/10403 Made one Will this work on the new Z-Image model by Alibaba? ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2542029",
    "title": "TAG:Tangential Amplifying Guidance for Hallucination-Resistant Diffusion\n  Sampling",
    "authors": [
      "Hyunmin Cho"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/hyeon-cho/Tangential-Amplifying-Guidance",
    "huggingface_url": "https://huggingface.co/papers/2510.04533",
    "upvote": 47
  }
}