{
  "context": "ARES, a unified framework for adaptive reasoning, dynamically adjusts exploration effort based on task difficulty using high window-entropy tokens and hierarchical entropy rewards, improving performance and efficiency across various benchmarks. Recent advances inmultimodal large reasoning models(MLRMs) have\nsubstantially improved their ability to solve complex textual and visual tasks.\nHowever, these models tend to overthink on simple problems, producing\nunnecessarily lengthy reasoning traces, while under-exploring on challenging\nones, leading to missed solutions. To address this imbalance, we propose ARES,\na unified open-source framework foradaptive reasoningthat dynamically\nallocates exploration effort based on task difficulty. Our approach is\nmotivated by two key empirical findings: (i) while single-token entropy is\nnoisy,high window-entropy(HWE) tokens (token-level entropies averaged under a\nsliding window) can reliably capture reasoning-critical moments; and (ii)\nreducingHWEusage benefits easy problems, while increasing it is essential for\nsolving hard ones. Building on these insights, ARES introduces a two-stage\ntraining pipeline. In theAdaptive Cold-Startstage, we curate multimodal and\ntextual data paired with reasoning traces of length proportional to problem\ndifficulty, equipping the model with initial difficulty awareness. In the\nsecond stage, we developAdaptive Entropy Policy Optimization(AEPO), which\nusesHWEtokens as exploration triggers to decide when to explore, and a\nhierarchicalentropy rewardwithdynamic KL controlto decide how much to\nexplore. Extensive experiments demonstrate that ARES achieves superior\nperformance and reasoning efficiency across diverse mathematical, logical, and\nmultimodal benchmarks, while closing the gap to leading commercial systems\nunder significantly lower inference costs. Paper(arXiv):https://arxiv.org/abs/2510.08457Github:https://github.com/shawn0728/ARESModel & Dataset (hugging face):https://huggingface.co/collections/ares0728/ares-68e7c7160dcb48734dee4e95 This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2542103",
    "title": "ARES: Multimodal Adaptive Reasoning via Difficulty-Aware Token-Level\n  Entropy Shaping",
    "authors": [
      "Shuang Chen",
      "Shijue Huang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/shawn0728/ARES",
    "huggingface_url": "https://huggingface.co/papers/2510.08457",
    "upvote": 12
  }
}