{
  "context": "Agent-REINFORCE optimizes multi-LLM collaboration graphs for test-time scaling, improving sample efficiency and search performance under accuracy and latency constraints. Test-Time Scaling(TTS) improveslarge language models(LLMs) by allocating\nadditional computation during inference, typically through parallel,\nsequential, orhybrid scaling. However, prior studies often assume fixedcollaboration architectures(e.g., topologies) and single-model usage,\noverlooking that optimal architectures and model combinations can vary across\ntasks. Therefore, we study the novel problem of searching for compute-optimal\nmodel combinations and architectures in TTS under a fixed budget. We formalize\nit as amulti-LLM collaboration graph, where nodes encode roles and LLM model\nassignments, and edges capture information flow. This problem is challenging\nbecause (i) the combinatorial search space is prohibitively large, and (ii)\ntask-specific requirements demand tailored designs. To address these, we\nreformulate the problem asprobabilistic graph optimizationand, through pilot\nexperiments, derive three empirical insights into TTS collaboration graphs.\nGuided by these insights, we proposeAgent-REINFORCE, an LLM-agent-augmented\nframework that mirrors theREINFORCE pipelineby mapping\nsampling-gradient-update to sampling-feedback-update, where feedback serves as\natextual gradientto update the probabilistic graph and efficiently search for\noptimalmulti-LLM collaboration graphs. Experiments show thatAgent-REINFORCEoutperforms both traditional and LLM-based baselines in sample efficiency and\nsearch performance, and effectively identifies optimal graphs under joint\nobjectives of accuracy and inference latency. Under review ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2545017",
    "title": "Generalizing Test-time Compute-optimal Scaling as an Optimizable Graph",
    "authors": [],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.00086",
    "upvote": 41
  }
}