{
  "context": "UME-R1, a generative multimodal embedding framework, enhances performance through reasoning-driven generation and reinforcement learning, outperforming conventional discriminative models. The remarkable success ofmultimodal large language models(MLLMs) has driven\nadvances inmultimodal embeddings, yet existing models remain inherently\ndiscriminative, limiting their ability to benefit from reasoning-driven\ngeneration paradigm. In this work, we pioneer the exploration of generative\nembeddings, unifying embedding tasks within a generative paradigm. We propose\nUME-R1, a universal multimodal embedding framework consisting of a two-stage\ntraining strategy: acold-start supervised fine-tuningequips the model with\nreasoning capabilities and enables it to generate both discriminative andgenerative embeddings; a subsequentreinforcement learningenhances reasoning\nand further optimizes generative embedding quality. This pioneering work\nreveals four key insights: 1)generative embeddingsunlock substantial\nperformance gains over conventionaldiscriminative embeddingsby leveraging the\npowerful generative reasoning capabilities of MLLMs; 2) discriminative andgenerative embeddingsare complementary, whose combined oracle performance far\nexceeding that of either alone; 3) RL can effectively enhance generative\nembeddings, establishing a scalable optimization paradigm.; 4) repeated\nsampling at inference boosts downstream task coverage (pass@k), highlighting\ntheinference-time scalabilitypotential ofgenerative embeddings. Evaluated on\ntheMMEB-V2 benchmarkacross 78 tasks spanning video, image, and visual\ndocuments, UME-R1 significantly outperforms conventional discriminative\nembedding models and offers a foundation for more interpretable,\nreasoning-driven generativemultimodal embeddings. Our code, models, and\ndatasets will be publicly available at https://github.com/XMUDeepLIT/UME-R1. ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2545077",
    "title": "UME-R1: Exploring Reasoning-Driven Generative Multimodal Embeddings",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/XMUDeepLIT/UME-R1",
    "huggingface_url": "https://huggingface.co/papers/2511.00405",
    "upvote": 5
  }
}