{
  "context": "A novel rank-2 projection subspace is proposed to analyze multi-step knowledge interactions in Large Language Models, revealing how Parametric Knowledge and Context Knowledge contribute to Natural Language Explanations. Natural Language Explanations(NLEs) describe howLarge Language Models(LLMs) make decisions, drawing on both externalContext Knowledge(CK) andParametric Knowledge(PK) stored in model weights. Understanding their\ninteraction is key to assessing the grounding of NLEs, yet it remains\nunderexplored. Prior work has largely examined only single-step generation,\ntypically the final answer, and has modelled PK and CK interaction only as a\nbinary choice in a rank-1 subspace. This overlooks richer forms of interaction,\nsuch as complementary or supportive knowledge. We propose a novel rank-2\nprojection subspace that disentangles PK and CK contributions more accurately\nand use it for the firstmulti-step analysisofknowledge interactionsacross\nlonger NLE sequences. Experiments on four QA datasets and three open-weight\ninstruction-tuned LLMs show that diverseknowledge interactionsare poorly\nrepresented in a rank-1 subspace but are effectively captured in our rank-2\nformulation. Ourmulti-step analysisreveals thathallucinated NLEsalign\nstrongly with the PK direction, context-faithful ones balance PK and CK, andChain-of-Thought promptingfor NLEs shifts generated NLEs toward CK by reducing\nPK reliance. This work provides the first framework for systematic studies of\nmulti-stepknowledge interactionsin LLMs through a richer rank-2 subspace\ndisentanglement. Code and data:\nhttps://github.com/copenlu/pk-ck-knowledge-disentanglement. This work provides the first framework for systematic studies of multi-step knowledge interactions in LLMs through a richer rank-2 subspace disentanglement. ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2545096",
    "title": "Multi-Step Knowledge Interaction Analysis via Rank-2 Subspace\n  Disentanglement",
    "authors": [
      "Sekh Mainul Islam"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/copenlu/pk-ck-knowledge-disentanglement",
    "huggingface_url": "https://huggingface.co/papers/2511.01706",
    "upvote": 2
  }
}