{
  "context": "A fine-tuning strategy called BOB improves synthetic data quality for low-shot fine-grained classification by conditioning on class-agnostic attributes and marginalizing them during generation. Text-to-image (T2I) models are increasingly used forsynthetic dataset\ngeneration, but generating effective synthetic training data for classification\nremains challenging.Fine-tuninga T2I model with a few real examples can help\nimprove the quality of synthetic training data; however, it may also cause\noverfitting and reduce diversity in the generated samples. We propose afine-tuningstrategy BOB (BeyondOBjects) to mitigate these concerns for\nfine-grained classification. Given a small set of real examples, we first\nextractclass-agnostic attributessuch asscene backgroundandobject pose. We\nthen explicitly condition on these attributes duringfine-tuningof the T2I\nmodel and marginalize them out during generation. This design mitigates\noverfitting, preserves the T2I model'sgenerative prior, reduces estimation\nerrors, and further minimizesunintended inter-class associations. Extensive\nexperiments across multiple T2I models, backbones, and datasets show that our\nmethod achieves state-of-the-art performance in low-shot fine-grained\nclassification when augmented withsynthetic data. Concretely, BOB outperformsDataDreamby 7.4% on the Aircraft dataset (from 50.0% to 57.4% whenfine-tuningaCLIP classifierwith five real images augmented with 100 synthetic images).\nIn three of the four benchmarks,fine-tuningdownstream models with 5 real\nimages augmented with BOB achieves better performance thanfine-tuningwith 10\nreal images. Collectively, BOB outperforms prior art in 18 of 24 experimental\nsettings, with 2+% accuracy improvements in 14 of these settings. Github:https://github.com/princetonvisualai/BeyondObjects This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2545100",
    "title": "Beyond Objects: Contextual Synthetic Data Generation for Fine-Grained\n  Classification",
    "authors": [
      "William Yang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/princetonvisualai/BeyondObjects",
    "huggingface_url": "https://huggingface.co/papers/2510.24078",
    "upvote": 2
  }
}