{
  "context": "AthenaBench, an enhanced benchmark for evaluating LLMs in CTI, reveals limitations in reasoning capabilities of current models, especially for tasks like threat actor attribution and risk mitigation. Large Language Models(LLMs) have demonstrated strong capabilities in natural\nlanguage reasoning, yet their application toCyber Threat Intelligence(CTI)\nremains limited.CTIanalysis involves distilling large volumes of unstructured\nreports into actionable knowledge, a process where LLMs could substantially\nreduce analyst workload.CTIBenchintroduced a comprehensive benchmark for\nevaluating LLMs across multipleCTItasks. In this work, we extendCTIBenchby\ndevelopingAthenaBench, an enhanced benchmark that includes an improved dataset\ncreation pipeline,duplicate removal, refinedevaluation metrics, and a new\ntask focused onrisk mitigation strategies. We evaluate twelve LLMs, including\nstate-of-the-art proprietary models such asGPT-5andGemini-2.5 Pro, alongside\nseven open-source models from theLLaMAandQwenfamilies. While proprietary\nLLMs achieve stronger results overall, their performance remains subpar on\nreasoning-intensive tasks, such as threat actor attribution and risk\nmitigation, with open-source models trailing even further behind. These\nfindings highlight fundamental limitations in the reasoning capabilities of\ncurrent LLMs and underscore the need for models explicitly tailored toCTIworkflows and automation. This is the updated version of our work onCTIBench, NeurIPS 2024. It includes an additional task, improved data construction pipeline, and more recent datasets with refined evaluation. Code and dataset:https://github.com/Athena-Software-Group/athenabench Please use this version of the dataset going forward. ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2545093",
    "title": "AthenaBench: A Dynamic Benchmark for Evaluating LLMs in Cyber Threat\n  Intelligence",
    "authors": [
      "Md Tanvirul Alam"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/Athena-Software-Group/athenabench",
    "huggingface_url": "https://huggingface.co/papers/2511.01144",
    "upvote": 3
  }
}