{
  "context": "YOLOv11, an advanced deep learning model, achieves high accuracy in building instance segmentation and height classification from satellite imagery, outperforming earlier models in both detection and inference speed. Accurate buildinginstance segmentationandheight classificationare\ncritical for urban planning, 3D city modeling, and infrastructure monitoring.\nThis paper presents a detailed analysis ofYOLOv11, the recent advancement in\nthe YOLO series of deep learning models, focusing on its application to joint\nbuilding extraction and discreteheight classificationfrom satellite imagery.YOLOv11builds on the strengths of earlier YOLO models by introducing a more\nefficient architecture that better combines features at different scales,\nimprovesobject localizationaccuracy, and enhances performance in complex\nurban scenes. Using theDFC2023 Track 2dataset -- which includes over 125,000\nannotated buildings across 12 cities -- we evaluateYOLOv11's performance using\nmetrics such asprecision,recall,F1 score, andmean average precision (mAP).\nOur findings demonstrate thatYOLOv11achieves stronginstance segmentationperformance with 60.4\\% mAP@50 and 38.3\\% mAP@50--95 while maintaining robust\nclassification accuracy across five predefined height tiers. The model excels\nin handlingocclusions, complexbuilding shapes, andclass imbalance,\nparticularly for rare high-rise structures. Comparative analysis confirms thatYOLOv11outperforms earliermultitask frameworksin both detection accuracy and\ninference speed, making it well-suited forreal-time, large-scale urban\nmapping. This research highlightsYOLOv11's potential to advance semantic urban\nreconstruction through streamlinedcategorical height modeling, offering\nactionable insights for future developments inremote sensingand geospatial\nintelligence. This paper presents a detailedanalysis of YOLOv11, the recent advancement in the YOLOseries of deep learning models, focusing on its application to jointbuilding extraction and discrete height classification from satelliteimagery. YOLOv11 builds on the strengths of earlier YOLOmodels by introducing a more efficient architecture that bettercombines features at different scales, improves object localizationaccuracy, and enhances performance in complex urban scenes. ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2545098",
    "title": "Mask-to-Height: A YOLOv11-Based Architecture for Joint Building Instance\n  Segmentation and Height Classification from Satellite Imagery",
    "authors": [
      "Mahmoud El Hussieni"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2510.27224",
    "upvote": 2
  }
}