{
  "context": "A novel framework, Detector-to-Differentiable (D2D), transforms non-differentiable detection models into differentiable critics to improve object counting accuracy in text-to-image diffusion models with minimal impact on image quality. Text-to-image (T2I) diffusion modelshave achieved strong performance insemantic alignment, yet they still struggle with generating the correct number\nof objects specified in prompts. Existing approaches typically incorporateauxiliary counting networksas external critics to enhance numeracy. However,\nsince these critics must providegradient guidanceduring generation, they are\nrestricted to regression-based models that are inherently differentiable, thus\nexcludingdetector-based modelswith superior counting ability, whose\ncount-via-enumeration nature isnon-differentiable. To overcome this\nlimitation, we proposeDetector-to-Differentiable (D2D), a novel framework that\ntransformsnon-differentiabledetection models into differentiable critics,\nthereby leveraging their superior counting ability to guide numeracy\ngeneration. Specifically, we designcustom activation functionsto convert\ndetector logits intosoft binary indicators, which are then used to optimize\nthenoise priorat inference time with pre-trained T2I models. Our extensive\nexperiments onSDXL-Turbo,SD-Turbo, andPixart-DMDacross four benchmarks of\nvarying complexity (low-density, high-density, and multi-object scenarios)\ndemonstrate consistent and substantial improvements inobject counting accuracy(e.g., boosting up to 13.7% on D2D-Small, a 400-prompt, low-density benchmark),\nwith minimal degradation in overallimage qualityandcomputational overhead. We show a new way to convert high-accuracy, but non-differentiable, detectors into differentiable critics to improve numeracy in text-to-image generation. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2545101",
    "title": "D2D: Detector-to-Differentiable Critic for Improved Numeracy in\n  Text-to-Image Generation",
    "authors": [
      "Nobline Yoo"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2510.19278",
    "upvote": 2
  }
}