{
  "context": "A perspectivist annotation scheme for the HCRC MapTask corpus reveals how understanding emerges, diverges, and repairs in collaborative dialogue, highlighting the role of multiplicity discrepancies in referential misalignment. Collaborative dialogue relies on participants incrementally establishing\ncommon ground, yet in asymmetric settings they may believe they agree while\nreferring to different entities. We introduce aperspectivist annotation schemefor theHCRC MapTask corpus(Anderson et al., 1991) that separately capturesspeaker and addressee grounded interpretationsfor eachreference expression,\nenabling us to trace how understanding emerges, diverges, and repairs over\ntime. Using a scheme-constrained LLM annotation pipeline, we obtain 13k\nannotatedreference expressions with reliability estimates and analyze the\nresultingunderstanding states. The results show that full misunderstandings\nare rare once lexical variants are unified, butmultiplicity discrepanciessystematically induce divergences, revealing how apparent grounding can maskreferential misalignment. Our framework provides both a resource and an\nanalytic lens for studying grounded misunderstanding and for evaluating(V)LLMs' capacity to modelperspective-dependent groundingin collaborative\ndialogue. We operationalize reference grounding as perspective-dependent alignment, introducing a five-attribute hierarchy that separately tracks speaker-intended vs. addressee-interpreted referents. Our LLM-assisted annotation pipeline achieves high accuracy on 13k MapTask reference expressions. Analyses reveal that multiplicity discrepancies, where the same landmark appears twice on one map but once on another, systematically induce misunderstandings (12% rate vs. 1.8% corpus average), while participants show strong preferences for reusing grounded landmarks. Our work establishes both a resource and benchmark for evaluating (V)LLMs on incremental grounding. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2545088",
    "title": "Grounded Misunderstandings in Asymmetric Dialogue: A Perspectivist\n  Annotation Scheme for MapTask",
    "authors": [
      "Nan Li"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.03718",
    "upvote": 3
  }
}