{
  "context": "A novel detection method based on multi-modal semantic perturbation is proposed to identify contaminated Vision-Language Models, demonstrating robustness across various contamination strategies. Recent advances inVision-Language Models(VLMs) have achieved\nstate-of-the-art performance on numerous benchmark tasks. However, the use of\ninternet-scale, often proprietary,pretraining corporaraises a critical\nconcern for both practitioners and users: inflated performance due to test-set\nleakage. While prior works have proposed mitigation strategies such asdecontaminationof pretraining data andbenchmark redesignfor LLMs, the\ncomplementary direction of developingdetection methodsfor contaminatedVLMsremains underexplored. To address this gap, we deliberately contaminate\nopen-sourceVLMson popular benchmarks and show that existing detection\napproaches either fail outright or exhibit inconsistent behavior. We then\npropose a novel simple yet effective detection method based on multi-modal\nsemantic perturbation, demonstrating that contaminated models fail to\ngeneralize under controlled perturbations. Finally, we validate our approach\nacross multiple realistic contamination strategies, confirming its robustness\nand effectiveness. The code and perturbed dataset will be released publicly. We introduceMulti-modal Semantic Perturbation, a pipeline to create perturbed benchmarks that can be used to detect data contamination in VLMs. This perturbation pipeline generates image-question pairs with the original image composition intact but modified slightly so that the answer is changed. The perturbed benchmark will have a similar or lower difficulty than the original benchmark, meaning clean models that truly generalize should perform better. However, we discover that contaminated models consistently underperform, showing dramatic performance drops up to -45%. By simply comparing the performance on the two versions of the benchmark, we show that we can reliably detect contaminated VLMs with varying training strategies, number of epochs, model architectures and sizes, while existing approaches fail. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2545052",
    "title": "Contamination Detection for VLMs using Multi-Modal Semantic Perturbation",
    "authors": [
      "Jaden Park",
      "Feng Yao"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.03774",
    "upvote": 12
  }
}