{
  "context": "EVTAR is an end-to-end virtual try-on model that enhances accuracy by using reference images, simplifying the inference process and improving garment texture and detail preservation. We propose EVTAR, anEnd-to-End Virtual Try-onmodel with Additional\nReference, that directly fits the target garment onto the person image while\nincorporating reference images to enhance try-on accuracy. Most existing\nvirtual try-on approaches rely on complex inputs such as agnostic person\nimages,human pose,densepose, orbody keypoints, making them labor-intensive\nand impractical for real-world applications. In contrast, EVTAR adopts atwo-stage training strategy, enabling simple inference with only the source\nimage and the target garment inputs. Our model generates try-on results without\nmasks,densepose, or segmentation maps. Moreover, EVTAR leverages additional\nreference images of different individuals wearing the same clothes to preservegarment textureandfine-grained detailsbetter. This mechanism is analogous to\nhow humans consider reference models when choosing outfits, thereby simulating\na more realistic and high-quality dressing effect. We enrich the training data\nwithsupplementary referencesandunpaired person imagesto support these\ncapabilities. We evaluate EVTAR on two widely used benchmarks and diverse\ntasks, and the results consistently validate the effectiveness of our approach. Code is available at:https://github.com/360CVGroup/EVTAR. Model is available at:https://huggingface.co/qihoo360/EVTAR. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2545085",
    "title": "EVTAR: End-to-End Try on with Additional Unpaired Visual Reference",
    "authors": [
      "Liuzhuozheng Li",
      "Shanyuan Liu",
      "Dengyang Jiang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/360CVGroup/EVTAR",
    "huggingface_url": "https://huggingface.co/papers/2511.00956",
    "upvote": 4
  }
}