{
  "context": "TabTune is a unified library that standardizes the workflow for tabular foundation models, supporting various adaptation strategies and evaluation metrics. Tabular foundation modelsrepresent a growing paradigm in structured data\nlearning, extending the benefits of large-scale pretraining to tabular domains.\nHowever, their adoption remains limited due to heterogeneous preprocessing\npipelines, fragmented APIs, inconsistent fine-tuning procedures, and the\nabsence of standardized evaluation for deployment-oriented metrics such ascalibrationandfairness. We present TabTune, a unified library that\nstandardizes the complete workflow fortabular foundation modelsthrough a\nsingle interface. TabTune provides consistent access to seven state-of-the-art\nmodels supporting multiple adaptation strategies, including zero-shot\ninference,meta-learning,supervised fine-tuning(SFT), and parameter-efficient\nfine-tuning (PEFT). The framework automatesmodel-aware preprocessing, manages\narchitectural heterogeneity internally, and integrates evaluation modules for\nperformance,calibration, andfairness. Designed for extensibility and\nreproducibility, TabTune enables consistent benchmarking of adaptation\nstrategies oftabular foundation models. The library is open source and\navailable at https://github.com/Lexsi-Labs/TabTune . TabTune is a powerful and flexible Python library designed to simplify the training and fine-tuning of modern foundation models on tabular data. It provides a high-level, scikit-learn-compatible API that abstracts away the complexities of data preprocessing, model-specific training loops, and benchmarking, letting you focus on delivering results. Whether you are a practitioner aiming for production-grade pipelines or a researcher exploring advanced architectures, TabTune streamlines your workflow for tabular deep learning. Github Repo :https://github.com/Lexsi-Labs/TabTune This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2545046",
    "title": "TabTune: A Unified Library for Inference and Fine-Tuning Tabular\n  Foundation Models",
    "authors": [
      "Pratinav Seth"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/Lexsi-Labs/TabTune",
    "huggingface_url": "https://huggingface.co/papers/2511.02802",
    "upvote": 14
  }
}