{
  "context": "BRAINS, a system using Large Language Models, effectively detects and monitors Alzheimer's disease by integrating cognitive assessments and case retrieval. As the global burden of Alzheimer's disease (AD) continues to grow, early and\naccurate detection has become increasingly critical, especially in regions with\nlimited access to advanced diagnostic tools. We propose BRAINS (Biomedical\nRetrieval-Augmented Intelligence for Neurodegeneration Screening) to address\nthis challenge. This novel system harnesses the powerful reasoning capabilities\nofLarge Language Models(LLMs) for Alzheimer's detection and monitoring.\nBRAINS features a dual-module architecture: acognitive diagnostic moduleand acase-retrieval module. The Diagnostic Module utilizes LLMs fine-tuned on\ncognitive and neuroimaging datasets -- including MMSE, CDR scores, and brain\nvolume metrics -- to perform structured assessments ofAlzheimer's risk.\nMeanwhile, the Case Retrieval Module encodes patient profiles into latent\nrepresentations and retrieves similar cases from a curated knowledge base.\nThese auxiliary cases are fused with the input profile via aCase Fusion Layerto enhance contextual understanding. The combined representation is then\nprocessed withclinical promptsfor inference. Evaluations on real-world\ndatasets demonstrate BRAINS effectiveness in classifyingdisease severityand\nidentifying early signs ofcognitive decline. This system not only shows strong\npotential as an assistive tool for scalable, explainable, and early-stage\nAlzheimer's disease detection, but also offers hope for future applications in\nthe field. 🧠 BRAINS: Biomedical Retrieval-Augmented Intelligence for Neurodegeneration Screening As Alzheimer’s disease (AD) continues to impose a growing global burden, early and accessible diagnosis is crucial—particularly in regions with limited medical resources. BRAINS introduces a retrieval-augmented large language model (LLM) framework designed for Alzheimer’s detection and monitoring. The system integrates two synergistic components: Cognitive Diagnostic Module: Fine-tuned LLMs analyze cognitive and neuroimaging metrics (e.g., MMSE, CDR, brain volume) to predict Alzheimer’s risk and progression. Case Retrieval Module: Embeds patient profiles into latent representations and retrieves semantically similar cases from a curated clinical knowledge base. Retrieved cases are fused via a Case Fusion Layer, allowing the model to reason contextually and improve inference accuracy. Evaluations on real-world datasets demonstrate BRAINS’ strong performance in identifying early cognitive decline and classifying disease severity. ⚙️ Key Features: Retrieval-Augmented Clinical Reasoning Explainable Predictions Scalable Early-Stage Screening 💡 BRAINS represents a step toward trustworthy, multimodal, and explainable AI-assisted neurodiagnosis—bridging biomedical intelligence with accessible patient care. ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2545089",
    "title": "BRAINS: A Retrieval-Augmented System for Alzheimer's Detection and\n  Monitoring",
    "authors": [
      "Rajan Das Gupta",
      "Md Kishor Morol"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.02490",
    "upvote": 3
  }
}