{
  "context": "Multimodal foundation models like SenseNova-SI improve spatial intelligence through diverse data scaling and demonstrate strong performance across various spatial benchmarks while maintaining general multimodal understanding. Despite remarkable progress,multimodal foundation modelsstill exhibit surprising deficiencies inspatial intelligence. In this work, we explore scaling upmultimodal foundation modelsto cultivatespatial intelligencewithin theSenseNova-SIfamily, built upon established multimodal foundations includingvisual understanding models(i.e., Qwen3-VL and InternVL3) andunified understanding and generation models(i.e., Bagel). We take a principled approach to constructing high-performing and robustspatial intelligenceby systematically curatingSenseNova-SI-8M: eight million diverse data samples under a rigorous taxonomy ofspatial capabilities.SenseNova-SIdemonstrates unprecedented performance across a broad range ofspatial intelligencebenchmarks: 68.7% onVSI-Bench, 43.3% onMMSI, 85.6% onMindCube, 54.6% onViewSpatial, and 50.1% onSITE, while maintaining strong general multimodal understanding (e.g., 84.9% onMMBench-En). More importantly, we analyze the impact of data scaling, discuss early signs of emergent generalization capabilities enabled by diverse data training, analyze the risk of overfitting and language shortcuts, present a preliminary study onspatial chain-of-thought reasoning, and validate the potential downstream application.SenseNova-SIis an ongoing project, and this report will be updated continuously. All newly trainedmultimodal foundation modelsare publicly released to facilitate further research in this direction. Despite remarkable progress, multimodal foundation models still exhibit surprising deficiencies in spatial intelligence. In this work, we explore scaling up multimodal foundation models to cultivate spatial intelligence within the SenseNova-SI family, built upon established multimodal foundations including visual understanding models (i.e., Qwen3-VL and InternVL3) and unified understanding and generation models (i.e., Bagel). We take a principled approach to constructing high-performing and robust spatial intelligence by systematically curating SenseNova-SI-8M: eight million diverse data samples under a rigorous taxonomy of spatial capabilities. SenseNova-SI demonstrates unprecedented performance across a broad range of spatial intelligence benchmarks: 68.7% on VSI-Bench, 43.3% on MMSI, 85.6% on MindCube, 54.6% on ViewSpatial, and 50.1% on SITE, while maintaining strong general multimodal understanding (e.g., 84.9% on MMBench-En). More importantly, we analyze the impact of data scaling, discuss early signs of emergent generalization capabilities enabled by diverse data training, analyze the risk of overfitting and language shortcuts, present a preliminary study on spatial chain-of-thought reasoning, and validate the potential downstream application. SenseNova-SI is an ongoing project, and this report will be updated continuously. All newly trained multimodal foundation models are publicly released to facilitate further research in this direction. Model:https://huggingface.co/collections/sensenova/sensenova-siCode:https://github.com/OpenSenseNova/SenseNova-SI This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2547023",
    "title": "Scaling Spatial Intelligence with Multimodal Foundation Models",
    "authors": [
      "Zhongang Cai",
      "Fanyi Pu",
      "Oscar Qian",
      "Xuanke Shi",
      "Xiaoyang Han"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/OpenSenseNova/SenseNova-SI",
    "huggingface_url": "https://huggingface.co/papers/2511.13719",
    "upvote": 46
  }
}