{
  "context": "Recent progress in large language models (LLMs) has moved the frontier from puzzle-solving to science-grade reasoning-the kind needed to tackle problems whose answers must stand against nature, not merely fit a rubric. Physics is the sharpest test of this shift, which binds symbols to reality in a fundamental way, serving as the cornerstone of most modern technologies. In this work, we manage to advance physics research by developing large language models with exceptional physics reasoning capabilities, especially excel at solving Olympiad-level physics problems. We introduce P1, a family of open-source physics reasoning models trained entirely through reinforcement learning (RL). Among them, P1-235B-A22B is the first open-source model with Gold-medal performance at the latest International Physics Olympiad (IPhO 2025), and wins 12 gold medals out of 13 international/regional physics competitions in 2024/2025. P1-30B-A3B also surpasses almost all other open-source models on IPhO 2025, getting a silver medal. Further equipped with an agentic framework PhysicsMinions, P1-235B-A22B+PhysicsMinions achieves overall No.1 on IPhO 2025, and obtains the highest average score over the 13 physics competitions. Besides physics, P1 models also present great performance on other reasoning tasks like math and coding, showing the great generalibility of P1 series. We release the P1 series models for physics reasoning and a full-stack open-source ecosystem spanning models, algorithms, benchmarks, and agent frameworks. The flagship modelP1-235B-A22Bwins 12 golds and 1 silver across 13 top international/regional physics contests, tying Gemini-2.5-Pro for first on the medal table, and becomes the first open-source model to win gold at IPhO 2025.P1-30B-A3Balso surpasses almost all other open-source models on IPhO 2025, getting a silver medal. indeed appreciate the team members for open sourcing these  superb series of model for solving the Physics Olympiad with benchmark performance. Couple of questions  to the authors :--> Also I am also currently building another dataset for the competitive examinations from multilingual languages for sciences thus will indeed  refer to your implementation as citations. thanks arXiv explained breakdown of this paper 👉https://arxivexplained.com/papers/p1-mastering-physics-olympiads-with-reinforcement-learning This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend arXiv lens breakdown of this paper 👉https://arxivlens.com/PaperView/Details/p1-mastering-physics-olympiads-with-reinforcement-learning-2179-13033627 ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2547004",
    "title": "P1: Mastering Physics Olympiads with Reinforcement Learning",
    "authors": [
      "Jiacheng Chen",
      "Haiyuan Wan",
      "Qingyang Zhang",
      "Rui Huang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/PRIME-RL/P1",
    "huggingface_url": "https://huggingface.co/papers/2511.13612",
    "upvote": 134
  }
}