{
  "context": "Orion, a visual agent framework, uses a suite of specialized computer vision tools to execute complex visual workflows, achieving competitive performance on multiple benchmarks and enabling autonomous visual reasoning. We introduce Orion, a visual agent framework that can take in any modality and generate any modality. Using anagentic frameworkwith multipletool-calling capabilities, Orion is designed for visual AI tasks and achieves state-of-the-art results. Unlike traditional vision-language models that produce descriptive outputs, Orion orchestrates a suite of specialized computer vision tools, includingobject detection,keypoint localization,panoptic segmentation,Optical Character Recognition, andgeometric analysis, to execute complex multi-step visual workflows. The system achieves competitive performance onMMMU,MMBench,DocVQA, andMMLongBenchwhile extending monolithic vision-language models to production-grade visual intelligence. By combiningneural perceptionwithsymbolic execution, Orion enablesautonomous visual reasoning, marking a transition from passive visual understanding to active, tool-driven visual intelligence. We introduce Orion, a visual agent framework that can take in any modality and generate any modality. Using an agentic framework with multiple tool-calling capabilities, Orion is designed for visual AI tasks and achieves state-of-the-art results. Unlike traditional vision-language models that produce descriptive outputs, Orion orchestrates a suite of specialized computer vision tools, including object detection, keypoint localization, panoptic segmentation, Optical Character Recognition, and geometric analysis, to execute complex multi-step visual workflows. The system achieves competitive performance on MMMU, MMBench, DocVQA, and MMLongBench while extending monolithic vision-language models to production-grade visual intelligence. By combining neural perception with symbolic execution, Orion enables autonomous visual reasoning, marking a transition from passive visual understanding to active, tool-driven visual intelligence. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend Very cool to see this up on Huggingface, happy to answer any questions folks may have on Orion. Try it for free here:https://chat.vlm.run/ ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2547046",
    "title": "Orion: A Unified Visual Agent for Multimodal Perception, Advanced Visual Reasoning and Execution",
    "authors": [
      "N Dinesh Reddy"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.14210",
    "upvote": 20
  }
}