{
  "context": "This survey examines methods for using large language models to generate scientific ideas, categorizing them into five families and aligning them with creativity frameworks to improve scientific soundness and novelty. Scientific idea generation lies at the heart of scientific discovery and has driven human progress-whether by solving unsolved problems or proposing novel hypotheses to explain unknown phenomena. Unlike standard scientific reasoning or general creative generation, idea generation in science is a multi-objective and open-ended task, where the novelty of a contribution is as essential as its empirical soundness.Large language models(LLMs) have recently emerged as promising generators of scientific ideas, capable of producing coherent and factual outputs with surprising intuition and acceptable reasoning, yet their creative capacity remains inconsistent and poorly understood. This survey provides a structured synthesis of methods for LLM-drivenscientific ideation, examining how different approaches balance creativity with scientific soundness. We categorize existing methods into five complementary families:External knowledge augmentation,Prompt-based distributional steering,Inference-time scaling,Multi-agent collaboration, andParameter-level adaptation. To interpret their contributions, we employ two complementary frameworks:Boden's taxonomyof Combinatorial, Exploratory andTransformational creativityto characterize the level of ideas each family expected to generate, andRhodes' 4Ps framework-Person, Process, Press, and Product-to locate the aspect or source of creativity that each method emphasizes. By aligning methodological advances with creativity frameworks, this survey clarifies the state of the field and outlines key directions toward reliable, systematic, and transformative applications of LLMs in scientific discovery. A Survey About LLM-based Scientific Discovery, From the Viewpoint of Creativity This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2547095",
    "title": "Large Language Models for Scientific Idea Generation: A Creativity-Centered Survey",
    "authors": [],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.07448",
    "upvote": 2
  }
}