{
  "context": "MiMo-Embodied, a cross-embodied foundation model, achieves state-of-the-art performance in both autonomous driving and embodied AI through multi-stage learning, curated data, and CoT/RL fine-tuning. We open-source MiMo-Embodied, the firstcross-embodied foundation modelto successfully integrate and achieve state-of-the-art performance in both Autonomous Driving and Embodied AI. MiMo-Embodied sets new records across 17 embodied AI benchmarks inTask Planning,Affordance PredictionandSpatial Understanding, while also excelling in 12 autonomous driving benchmarks acrossEnvironmental Perception,Status Prediction, andDriving Planning. Across these tasks, MiMo-Embodied significantly outperforms existing open-source, closed-source, and specialized baselines. Our results indicate that throughmulti-stage learning,curated data construction, andCoT/RL fine-tuning, these two domains exhibit strongpositive transferand mutually reinforce one another. We provide a detailed analysis of our model design and training methodologies to facilitate further research. Code and models are available at https://github.com/XiaomiMiMo/MiMo-Embodied. We open-source MiMo-Embodied, the first cross-embodied foundation model to successfully integrate and achieve state-of-the-art performance in both Autonomous Driving and Embodied AI. MiMo-Embodied sets new records across 17 embodied AI benchmarks in Task Planning, Affordance Prediction and Spatial Understanding, while also excelling in 12 autonomous driving benchmarks across Environmental Perception, Status Prediction, and Driving Planning. Across these tasks, MiMo-Embodied significantly outperforms existing open-source, closed-source, and specialized baselines. Our results indicate that through multi-stage learning, curated data construction, and CoT/RL fine-tuning, these two domains exhibit strong positive transfer and mutually reinforce one another. We provide a detailed analysis of our model design and training methodologies to facilitate further research. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend arXiv explained breakdown of this paper 🔙https://arxivexplained.com/papers/mimo-embodied-x-embodied-foundation-model-technical-report ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2547037",
    "title": "MiMo-Embodied: X-Embodied Foundation Model Technical Report",
    "authors": [
      "Zhijian Huang",
      "Yingbo Tang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/XiaomiMiMo/MiMo-Embodied",
    "huggingface_url": "https://huggingface.co/papers/2511.16518",
    "upvote": 25
  }
}