{
  "context": "A new instruction-guided lesion segmentation paradigm using a large-scale dataset and a vision-language model enables diverse CXR lesion segmentation with simple instructions. The applicability of current lesion segmentation models for chest X-rays (CXRs) has been limited both by a small number of target labels and the reliance on long, detailed expert-level text inputs, creating a barrier to practical use. To address these limitations, we introduce a new paradigm:instruction-guided lesion segmentation(ILS), which is designed to segment diverse lesion types based on simple, user-friendly instructions. Under this paradigm, we constructMIMIC-ILS, the first large-scale instruction-answer dataset for CXR lesion segmentation, using our fully automatedmultimodal pipelinethat generates annotations from chest X-ray images and their corresponding reports.MIMIC-ILScontains 1.1M instruction-answer pairs derived from 192K images and 91K unique segmentation masks, covering seven major lesion types. To empirically demonstrate its utility, we introduce ROSALIA, avision-language modelfine-tuned onMIMIC-ILS. ROSALIA can segment diverse lesions and provide textual explanations in response to user instructions. The model achieves high segmentation and textual accuracy in our newly proposed task, highlighting the effectiveness of our pipeline and the value ofMIMIC-ILSas a foundational resource forpixel-level CXR lesion grounding. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2547038",
    "title": "Instruction-Guided Lesion Segmentation for Chest X-rays with Automatically Generated Large-Scale Dataset",
    "authors": [
      "Geon Choi",
      "Hangyul Yoon"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.15186",
    "upvote": 25
  }
}