{
  "context": "RF-DETR, a light-weight detection transformer, uses weight-sharing NAS to optimize accuracy and latency for real-time detection across diverse datasets. Open-vocabulary detectorsachieve impressive performance onCOCO, but often fail to generalize to real-world datasets with out-of-distribution classes not typically found in their pre-training. Rather than simply fine-tuning a heavy-weightvision-language model(VLM) for new domains, we introduce RF-DETR, a light-weight specialistdetection transformerthat discovers accuracy-latency Pareto curves for any target dataset withweight-sharing neural architecture search(NAS). Ourapproach fine-tunes a pre-trained base network on a target dataset and evaluates thousands of network configurations with different accuracy-latency tradeoffs without re-training. Further, we revisit the \"tunable knobs\" forNASto improve the transferability of DETRs to diverse target domains. Notably, RF-DETR significantly improves on prior state-of-the-artreal-time methodsonCOCOandRoboflow100-VL. RF-DETR (nano) achieves 48.0APonCOCO, beating D-FINE (nano) by 5.3APat similar latency, and RF-DETR (2x-large) outperforms GroundingDINO (tiny) by 1.2APonRoboflow100-VLwhile running 20x as fast. To the best of our knowledge, RF-DETR (2x-large) is the first real-time detector to surpass 60APonCOCO. Our code is at https://github.com/roboflow/rf-detr bleeding edge detection, soon coming to transformers library too! 🙌🏻 This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2547070",
    "title": "RF-DETR: Neural Architecture Search for Real-Time Detection Transformers",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/roboflow/rf-detr",
    "huggingface_url": "https://huggingface.co/papers/2511.09554",
    "upvote": 7
  }
}