{
  "context": "GGBench is introduced to evaluate geometric generative reasoning, addressing the gap in assessing integrated cognitive processes in multimodal models. The advent ofUnified Multimodal Models(UMMs) signals a paradigm shift in artificial intelligence, moving from passive perception to active, cross-modal generation. Despite their unprecedented ability to synthesize information, a critical gap persists inevaluation: existingbenchmarks primarily assessdiscriminative understandingorunconstrained image generationseparately, failing to measure the integrated cognitive process ofgenerative reasoning. To bridge this gap, we propose thatgeometric constructionprovides an ideal testbed as it inherently demands a fusion oflanguage comprehensionand precisevisual generation. We introduce GGBench, abenchmarkdesigned specifically to evaluate geometricgenerative reasoning. It provides a comprehensive framework for systematically diagnosing a model's ability to not only understand and reason but to actively construct a solution, thereby setting a more rigorous standard for the next generation of intelligent systems. Project website: https://opendatalab-raiser.github.io/GGBench/. Proposes GGBench, a geometric reasoning benchmark that evaluates unified multimodal models' ability to understand language and generate precise geometric constructions. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2547032",
    "title": "GGBench: A Geometric Generative Reasoning Benchmark for Unified Multimodal Models",
    "authors": [
      "Siyuan Li",
      "Cheng Tan"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/opendatalab-raiser/GGBench",
    "huggingface_url": "https://huggingface.co/papers/2511.11134",
    "upvote": 31
  }
}