{
  "context": "LiteAttention exploits temporal coherence in diffusion attention to accelerate video generation without quality loss. Diffusion Transformers, particularly for video generation, achieve remarkable quality but suffer fromquadratic attention complexity, leading to prohibitive latency. Existing acceleration methods face a fundamental trade-off: dynamically estimatingsparse attention patternsat each denoising step incurs high computational overhead and estimation errors, while static sparsity patterns remain fixed and often suboptimal throughout denoising. We identify a key structural property ofdiffusion attention, namely, its sparsity patterns exhibit strong temporal coherence acrossdenoising steps. Tiles deemed non-essential at step t typically remain so at step t+δ. Leveraging this observation, we introduceLiteAttention, a method that exploits temporal coherence to enableevolutionary computation skipsacross the denoising sequence. By marking non-essential tiles early and propagating skip decisions forward,LiteAttentioneliminates redundant attention computations without repeated profiling overheads, combining the adaptivity of dynamic methods with the efficiency of static ones. We implement a highly optimizedLiteAttentionkernel on top ofFlashAttentionand demonstrate substantial speedups on productionvideo diffusion models, with no degradation in quality. The code and implementation details will be publicly released. Diffusion Transformers, particularly for video generation, achieve remarkable quality but suffer from quadratic attention complexity, leading to prohibitive latency. Existing acceleration methods face a fundamental trade-off: dynamically estimating sparse attention patterns at each denoising step incurs high computational overhead and estimation errors, while static sparsity patterns remain fixed and often suboptimal throughout denoising. We identify a key structural property of diffusion attention, namely, its sparsity patterns exhibit strong temporal coherence across denoising steps. Tiles deemed non-essential at step t typically remain so at step t+δ. Leveraging this observation, we introduce LiteAttention, a method that exploits temporal coherence to enable evolutionary computation skips across the denoising sequence. By marking non-essential tiles early and propagating skip decisions forward, LiteAttention eliminates redundant attention computations without repeated profiling overheads, combining the adaptivity of dynamic methods with the efficiency of static ones. We implement a highly optimized LiteAttention kernel on top of FlashAttention and demonstrate substantial speedups on production video diffusion models, with no degradation in quality. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2547033",
    "title": "LiteAttention: A Temporal Sparse Attention for Diffusion Transformers",
    "authors": [
      "Aviad Dahan"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/moonmath-ai/LiteAttention",
    "huggingface_url": "https://huggingface.co/papers/2511.11062",
    "upvote": 31
  }
}