{
  "context": "TimeViper, a hybrid vision-language model using Mamba-Transformer architecture, efficiently processes long videos by transferring and compressing vision tokens to text tokens, achieving state-of-the-art performance while handling over 10,000 frames. We introduceTimeViper, ahybrid vision-language modeldesigned to tackle challenges of long video understanding. Processing long videos demands both an efficient model architecture and an effective mechanism for handling extended temporal contexts. To this end,TimeViperadopts a hybridMamba-Transformerbackbone that combines the efficiency ofstate-space modelswith the expressivity ofattention mechanisms. Through this hybrid design, we reveal thevision-to-text information aggregationphenomenon, where information progressively flows fromvision tokenstotext tokensacross increasingLLM depth, resulting in severevision token redundancy. Motivated by this observation, we proposeTransV, atoken information transfer modulethat transfers and compressesvision tokensinto instruction tokens while maintainingmultimodal understandingcapabilities. This design enablesTimeViperto process hour-long videos exceeding 10,000 frames. Extensive experiments across multiple benchmarks demonstrate thatTimeVipercompetes with state-of-the-art models while extending frame numbers. We further analyze attention behaviors of both Mamba and Transformer layers, offering new insights intohybrid model interpretability. This work represents an initial step towards developing, interpreting, and compressing hybridMamba-Transformerarchitectures. We introduce TimeViper, a hybrid vision-language model designed to tackle challenges of long video understanding. Processing long videos demands both an efficient model architecture and an effective mechanism for handling extended temporal contexts. To this end, TimeViper adopts a hybrid Mamba-Transformer backbone that combines the efficiency of state-space models with the expressivity of attention mechanisms. Through this hybrid design, we reveal the vision-to-text information aggregation phenomenon, where information progressively flows from vision tokens to text tokens across increasing LLM depth, resulting in severe vision token redundancy. Motivated by this observation, we propose TransV, a token information transfer module that transfers and compresses vision tokens into instruction tokens while maintaining multimodal understanding capabilities. This design enables TimeViper to process hour-long videos exceeding 10,000 frames. Extensive experiments across multiple benchmarks demonstrate that TimeViper competes with state-of-the-art models while extending frame numbers. We further analyze attention behaviors of both Mamba and Transformer layers, offering new insights into hybrid model interpretability. This work represents an initial step towards developing, interpreting, and compressing hybrid Mamba-Transformer architectures. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2547061",
    "title": "TimeViper: A Hybrid Mamba-Transformer Vision-Language Model for Efficient Long Video Understanding",
    "authors": [
      "Boshen Xu",
      "Jiaze Li"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/xiaomi-research/timeviper",
    "huggingface_url": "https://huggingface.co/papers/2511.16595",
    "upvote": 9
  }
}