{
  "context": "Axonopedia, an AI agent utilizing LLMs and a multimodal foundation model, enhances property prediction and molecular design for Ionic Liquids through hierarchical search and real-world validation. The discovery of novelIonic Liquids (ILs)is hindered by critical challenges in property prediction, including limited data, poor model accuracy, and fragmented workflows. Leveraging the power ofLarge Language Models (LLMs), we introduce AIonopedia, to the best of our knowledge, the first LLM agent for IL discovery. Powered by an LLM-augmentedmultimodal domain foundation modelfor ILs, AIonopedia enables accurateproperty predictionsand incorporates ahierarchical search architectureformolecular screeninganddesign. Trained and evaluated on a newly curated and comprehensive ILdataset, our model delivers superior performance. Complementing these results, evaluations on literature-reported systems indicate that the agent can perform effective IL modification. Moving beyond offline tests, the practical efficacy was further confirmed through real-worldwet-lab validation, in which the agent demonstrated exceptionalgeneralization capabilitieson challenging out-of-distribution tasks, underscoring its ability to accelerate real-world IL discovery. We introduce AIonopedia, to our knowledge the first efficient LLM-based intelligent agent tailored to ionic liquids (ILs). By interacting with various specialized modules, it orchestrates the execution of multiple IL-related pipelines. At its core is an LLM-augmented multimodal domain foundation model for IL property prediction. To support this model, we compile a new IL dataset containing the largest collection to date of known IL solute-solvent interaction data. The resulting system achieves consistently strong performance across diverse IL property benchmarks, including robust out-of-distribution generalization. Building on these capabilities, AIonopedia offers automated pipelines for IL modification and large-scale molecular screening, which we further validate through wet-lab experiments, demonstrating its practical utility for data-driven IL research and design. @librarian-botrecommend This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend our pipeline architecture: ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2547041",
    "title": "AIonopedia: an LLM agent orchestrating multimodal learning for ionic liquid discovery",
    "authors": [
      "Yuqi Yin",
      "Siyuan Wang",
      "Peng Sun"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.11257",
    "upvote": 24
  }
}