{
  "context": "NaTex generates 3D textures directly using latent color diffusion and geometry-aware models, outperforming previous methods in coherence and alignment. We present NaTex, anative texture generationframework that predicts texture color directly in3D space. In contrast to previous approaches that rely on baking 2D multi-view images synthesized by geometry-conditionedMulti-View Diffusion models(MVDs), NaTex avoids several inherent limitations of the MVD pipeline. These include difficulties in handling occluded regions that require inpainting, achieving precise mesh-texturealignmentalong boundaries, and maintaining cross-view consistency and coherence in both content and color intensity. NaTex features a novel paradigm that addresses the aforementioned issues by viewing texture as a dense color point cloud. Driven by this idea, we proposelatent color diffusion, which comprises ageometry-awared color point cloud VAEand amulti-control diffusion transformer(DiT), entirely trained from scratch using 3D data, for texture reconstruction and generation. To enable precisealignment, we introduce native geometry control that conditions the DiT on direct 3D spatial information viapositional embeddingsandgeometry latents. We co-design the VAE-DiT architecture, where thegeometry latentsare extracted via a dedicated geometry branch tightly coupled with the color VAE, providing fine-grained surface guidance that maintains strong correspondence with the texture. With these designs, NaTex demonstrates strong performance, significantly outperforming previous methods intexture coherenceandalignment. Moreover, NaTex also exhibits strong generalization capabilities, either training-free or with simple tuning, for various downstream applications, e.g.,material generation,texture refinement, andpart segmentation and texturing. https://natex-ldm.github.io/ This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2547053",
    "title": "NaTex: Seamless Texture Generation as Latent Color Diffusion",
    "authors": [
      "Zeqiang Lai",
      "Zibo Zhao",
      "Xiangyu Yue"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/Zeqiang-Lai/NaTex",
    "huggingface_url": "https://huggingface.co/papers/2511.16317",
    "upvote": 15
  }
}