{
  "context": "ORS3D, a new task requiring language understanding, 3D grounding, and efficient scheduling, is introduced with a large dataset and an embodied multi-modal model named GRANT that uses a scheduling token mechanism for effective task management. Task scheduling is critical for embodied AI, enabling agents to follow natural language instructions and execute actions efficiently in 3D physical worlds. However, existing datasets often simplify task planning by ignoring operations research (OR) knowledge and 3D spatial grounding. In this work, we proposeOperations Research knowledge-based 3D Grounded Task Scheduling(ORS3D), a new task that requires the synergy of language understanding,3D grounding, andefficiency optimization. Unlike prior settings,ORS3Ddemands that agents minimize total completion time by leveragingparallelizable subtasks, e.g., cleaning the sink while the microwave operates. To facilitate research onORS3D, we constructORS3D-60K, a large-scale dataset comprising 60K composite tasks across 4K real-world scenes. Furthermore, we proposeGRANT, anembodied multi-modal large language modelequipped with a simple yet effectivescheduling token mechanismto generate efficient task schedules and grounded actions. Extensive experiments onORS3D-60K validate the effectiveness ofGRANTacross language understanding,3D grounding, and scheduling efficiency. The code is available at https://github.com/H-EmbodVis/GRANT Task scheduling is critical for embodied AI, enabling agents to follow natural language instructions and execute actions efficiently in 3D physical worlds. However, existing datasets often simplify task planning by ignoring operations research (OR) knowledge and 3D spatial grounding. In this work, we propose Operations Research knowledge-based 3D Grounded Task Scheduling (ORS3D), a new task that requires the synergy of language understanding, 3D grounding, and efficiency optimization. Unlike prior settings, ORS3D demands that agents minimize total completion time by leveraging parallelizable subtasks, e.g., cleaning the sink while the microwave operates. To facilitate research on ORS3D, we construct ORS3D-60K, a large-scale dataset comprising 60K composite tasks across 4K real-world scenes. Furthermore, we propose GRANT, an embodied multi-modal large language model equipped with a simple yet effective scheduling token mechanism to generate efficient task schedules and grounded actions. Extensive experiments on ORS3D-60K validate the effectiveness of GRANT across language understanding, 3D grounding, and scheduling efficiency. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548077",
    "title": "Cook and Clean Together: Teaching Embodied Agents for Parallel Task Execution",
    "authors": [
      "Cheng Zhang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/H-EmbodVis/GRANT",
    "huggingface_url": "https://huggingface.co/papers/2511.19430",
    "upvote": 7
  }
}