{
  "context": "Mera Multi is an open multimodal evaluation framework for Russian-spoken architectures, addressing the lack of such benchmarks with 18 newly constructed tasks and a methodology to prevent benchmark leakage. Multimodal large language models(MLLMs) are currently at the center of research attention, showing rapid progress in scale and capabilities, yet their intelligence, limitations, and risks remain insufficiently understood. To address these issues, particularly in the context of theRussian language, where no multimodal benchmarks currently exist, we introduceMera Multi, an openmultimodal evaluation frameworkfor Russian-spoken architectures. The benchmark is instruction-based and encompasses default text, image, audio, and video modalities, comprising 18 newly constructed evaluation tasks for both general-purpose models and modality-specific architectures (image-to-text, video-to-text, and audio-to-text). Our contributions include: (i) a universal taxonomy ofmultimodal abilities; (ii) 18 datasets created entirely from scratch with attention to Russian cultural and linguistic specificity, unified prompts, and metrics; (iii) baseline results for both closed-source and open-source models; (iv) a methodology for preventingbenchmark leakage, includingwatermarkingand licenses for private sets. While our current focus is on Russian, the proposed benchmark provides a replicable methodology for constructing multimodal benchmarks in typologically diverse languages, particularly within the Slavic language family.  This work introducesMERA Multi, the first large-scale multimodal benchmark for Russian, encompassing 18 newly developed tasks across text, image, audio, and video, with a unified skill taxonomy, robust leakage protection (utilizing watermarking and membership inference), and a public leaderboard and codebase for evaluating both open and closed MLLMs. Good paper! What is the most effective way to ensure that MLLMs for Russian achieve robust performance across image, audio, and video modalities, given the current performance gaps and cultural-linguistic specificity required? This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend arXiv explained breakdown of this paper 👉https://arxivexplained.com/papers/multimodal-evaluation-of-russian-language-architectures ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548009",
    "title": "Multimodal Evaluation of Russian-language Architectures",
    "authors": [
      "Ulyana Isaeva",
      "Alexander Kharitonov",
      "Vasily Konovalov",
      "Elisei Rykov",
      "Ivan Sviridov"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/MERA-Evaluation/MERA_MULTIMODAL/tree/main",
    "huggingface_url": "https://huggingface.co/papers/2511.15552",
    "upvote": 78
  }
}