{
  "context": "SteadyDancer, an Image-to-Video framework, ensures first-frame identity preservation and precise motion control through harmonized conditions, adaptive pose representation, and hierarchical training objectives. Preserving first-frame identity while ensuring precise motion control is a fundamental challenge in human image animation. TheImage-to-Motion Bindingprocess of the dominantReference-to-Video(R2V) paradigm overlooks critical spatio-temporal misalignments common in real-world applications, leading to failures such as identity drift and visual artifacts. We introduce SteadyDancer, anImage-to-Video(I2V) paradigm-based framework that achieves harmonized and coherent animation and is the first to ensure first-frame preservation robustly. Firstly, we propose aCondition-Reconciliation Mechanismto harmonize the two conflicting conditions, enabling precise control without sacrificing fidelity. Secondly, we designSynergistic Pose Modulation Modulesto generate an adaptive and coherent pose representation that is highly compatible with the reference image. Finally, we employ aStaged Decoupled-Objective Training Pipelinethat hierarchically optimizes the model formotion fidelity,visual quality, andtemporal coherence. Experiments demonstrate that SteadyDancer achieves state-of-the-art performance in both appearance fidelity and motion control, while requiring significantly fewer training resources than comparable methods. SteadyDancer is a strong animation framework based onImage-to-Video paradigm, ensuringrobust first-frame preservation. In contrast to prior Reference-to-Video approaches that often suffer from identity drift due tospatio-temporal misalignmentscommon in real-world applications, SteadyDancer generateshigh-fidelity and temporally coherenthuman animations, outperforming existing methods in visual quality and control whilerequiring significantly fewer training resources. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548018",
    "title": "SteadyDancer: Harmonized and Coherent Human Image Animation with First-Frame Preservation",
    "authors": [
      "Jiaming Zhang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/MCG-NJU/SteadyDancer",
    "huggingface_url": "https://huggingface.co/papers/2511.19320",
    "upvote": 42
  }
}