{
  "context": "An adversarial reward learning framework in reinforcement learning for image generation improves image quality and aesthetics by using dense visual signals from vision foundation models. A reliablereward functionis essential forreinforcement learning(RL) in image generation. Most current RL approaches depend on pre-trainedpreference modelsthat output scalar rewards to approximate human preferences. However, these rewards often fail to capture human perception and are vulnerable toreward hacking, where higher scores do not correspond to better images. To address this, we introduceAdv-GRPO, an RL framework with anadversarial rewardthat iteratively updates both thereward modeland thegenerator. Thereward modelis supervised using reference images as positive samples and can largely avoid being hacked. UnlikeKL regularizationthat constrains parameter updates, our learned reward directly guides thegeneratorthrough its visual outputs, leading to higher-quality images. Moreover, while optimizing existingreward functions can alleviatereward hacking, their inherent biases remain. For instance,PickScoremay degradeimage quality, whereasOCR-based rewardsoften reduce aesthetic fidelity. To address this, we take the image itself as a reward, using reference images andvision foundation models(e.g.,DINO) to provide rich visual rewards. These dense visual signals, instead of a single scalar, lead to consistent gains acrossimage quality,aesthetics, andtask-specific metrics. Finally, we show that combining reference samples with foundation-model rewards enablesdistribution transferand flexiblestyle customization. In human evaluation, our method outperforms Flow-GRPO and SD3, achieving 70.0% and 72.4% win rates inimage qualityandaesthetics, respectively. Code and models have been released. The project page:https://showlab.github.io/Adv-GRPO/pdf link:https://showlab.github.io/Adv-GRPO/assets/Adv-GRPO.pdf A reliable reward function is essential for reinforcement learning (RL) in image generation. Most current RL approaches depend on pre-trained preference models that output scalar rewards to approximate human preferences. However, these rewards often fail to capture human perception and are vulnerable to reward hacking, where higher scores do not correspond to better images. To address this, we introduce Adv-GRPO, an RL framework with an adversarial reward that iteratively updates both the reward model and the generator. The reward model is supervised using reference images as positive samples and can largely avoid being hacked. Unlike KL regularization that constrains parameter updates, our learned reward directly guides the generator through its visual outputs, leading to higher-quality images. Moreover, while optimizing existing reward functions can alleviate reward hacking, their inherent biases remain. For instance, PickScore may degrade image quality, whereas OCR-based rewards often reduce aesthetic fidelity. To address this, we take the image itself as a reward, using reference images and vision foundation models (e.g., DINO) to provide rich visual rewards. These dense visual signals, instead of a single scalar, lead to consistent gains across image quality, aesthetics, and task-specific metrics. Finally, we show that combining reference samples with foundation-model rewards enables distribution transfer and flexible style customization. In human evaluation, our method outperforms Flow-GRPO and SD3, achieving 70.0% and 72.4% win rates in image quality and aesthetics, respectively. Code and models will be released athttps://github.com/showlab/Adv-GRPO. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548029",
    "title": "The Image as Its Own Reward: Reinforcement Learning with Adversarial Reward for Image Generation",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/showlab/Adv-GRPO",
    "huggingface_url": "https://huggingface.co/papers/2511.20256",
    "upvote": 27
  }
}