{
  "context": "Agent0-VL, a self-evolving vision-language agent, incorporates tool usage into both reasoning and self-evaluation, enabling continual improvement through evidence-grounded analysis and reinforcement learning. Vision-language agents have achieved remarkable progress in a variety of multimodal reasoning tasks; however, their learning remains constrained by the limitations of human-annotated supervision. Recentself-rewarding approachesattempt to overcome this constraint by allowing models to act as their own critics or reward providers. Yet, purely text-basedself-evaluationstruggles to verify complex visual reasoning steps and often suffers from evaluation hallucinations. To address these challenges, inspired by recent advances intool-integrated reasoning, we propose Agent0-VL, a self-evolving vision-language agent that achieves continual improvement withtool-integrated reasoning. Agent0-VL incorporates tool usage not only into reasoning but also intoself-evaluationandself-repair, enabling the model tointrospect, verify, and refine its reasoning throughevidence-grounded analysis. It unifies two synergistic roles within a single LVLM: aSolverthat performs multi-turntool-integrated reasoning, and aVerifierthat generates structured feedback and fine-grained self-rewards through tool-grounded critique. These roles interact through aSelf-Evolving Reasoning Cycle, where tool-based verification andreinforcement learningjointly align the reasoning and evaluation distributions for stable self-improvement. Through this zero-external-reward evolution, Agent0-VL aligns its reasoning and verification behaviors without any human annotation or external reward models, achieving continual self-improvement. Experiments ongeometric problem solvingandvisual scientific analysisshow that Agent0-VL achieves an 12.5% improvement over the base model. Our code is available at https://github.com/aiming-lab/Agent0/Agent0-VL{this https URL}. Agent0-VL is a self-evolving vision-language agent that unifies tool-integrated reasoning and tool-grounded self-verification to achieve continual improvement without any human supervision. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548014",
    "title": "Agent0-VL: Exploring Self-Evolving Agent for Tool-Integrated Vision-Language Reasoning",
    "authors": [
      "Jiaqi Liu",
      "Peng Xia"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/aiming-lab/Agent0/tree/main/Agent0-VL",
    "huggingface_url": "https://huggingface.co/papers/2511.19900",
    "upvote": 48
  }
}