{
  "context": "A framework called InstructMix2Mix uses a 2D diffusion model to improve multi-view image editing by leveraging a 3D prior for cross-view consistency. We address the task ofmulti-view image editingfrom sparse input views, where the inputs can be seen as a mix of images capturing the scene from different viewpoints. The goal is to modify the scene according to atextual instructionwhile preserving consistency across all views. Existing methods, based on per-sceneneural fieldsortemporal attention mechanisms, struggle in this setting, often producing artifacts and incoherent edits. We propose InstructMix2Mix (I-Mix2Mix), a framework that distills the editing capabilities of a2D diffusion modelinto a pretrainedmulti-view diffusion model, leveraging its data-driven3D priorfor cross-view consistency. A key contribution is replacing the conventional neural field consolidator inScore Distillation Sampling(SDS) with a multi-view diffusion student, which requires novel adaptations: incrementalstudent updatesacross timesteps, a specializedteacher noise schedulerto prevent degeneration, and anattention modificationthat enhancescross-view coherencewithout additional cost. Experiments demonstrate that I-Mix2Mix significantly improves multi-view consistency while maintaining high per-frame edit quality. I-Mix2Mix performs instruction-driven edits on a sparse set of views. The key idea is SDS with a twist: we distill a 2D editor into a pretrained multi-view diffusion model rather than a NeRF/3DGS. The student’s learned 3D prior enables multi-view consistent edits, despite the sparse input. Check out our project page:https://danielgilo.github.io/instruct-mix2mix/ This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548061",
    "title": "InstructMix2Mix: Consistent Sparse-View Editing Through Multi-View Model Personalization",
    "authors": [
      "Daniel Gilo"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/DanielGilo/instruct-mix2mix/tree/main",
    "huggingface_url": "https://huggingface.co/papers/2511.14899",
    "upvote": 11
  }
}