{
  "context": "M^3-Bench evaluates multimodal tool use with a focus on visual grounding, textual reasoning, and tool dependencies using a novel similarity-driven alignment method and interpretable metrics. We present M^3-Bench, the first benchmark for evaluatingmultimodal tool useunder theModel Context Protocol. The benchmark targets realistic, multi-hop andmulti-threaded workflowsthat requirevisual groundingandtextual reasoning,cross-tool dependencies, and persistence ofintermediate resourcesacross steps. We introduce asimilarity-driven alignmentthat serializes each tool call, embeds signatures with asentence encoder, and performs similarity-bucketedHungarian matchingto obtain auditable one-to-one correspondences. On top of this alignment, we report interpretable metrics that decouplesemantic fidelityfromworkflow consistency. The benchmark spans 28 servers with 231 tools, and provides standardized trajectories curated through an Executor & Judge pipeline with human verification; an auxiliary four large language models (LLMs) judge ensemble reports end-task Task Completion and information grounding. Evaluations of representative state-of-the-artMultimodal LLMs(MLLMs) reveal persistent gaps in multimodal MCP tool use, particularly inargument fidelityandstructure consistency, underscoring the need for methods that jointly reason over images, text, andtool graphs. Our Benchmark's anonymous repository is at https://github.com/EtaYang10th/Open-M3-Bench We present M3-Bench, the first benchmark for evaluating multimodal tool use under the Model Context Protocol. The benchmark targets realistic, multi-hop and multi-threaded workflows that require visual grounding and textual reasoning, cross-tool dependencies, and persistence of intermediate resources across steps. We introduce a similaritydriven alignment that serializes each tool call, embeds signatures with a sentence encoder, and performs similaritybucketed Hungarian matching to obtain auditable one-to-one correspondences. On top of this alignment, we report interpretable metrics that decouple semantic fidelity from workflow consistency. The benchmark spans 28 servers with 231 tools, and provides standardized trajectories curated through an Executor & Judge pipeline with human verification; an auxiliary four large language models (LLMs) judge ensemble reports end-task Task Completion and information grounding. Evaluations of representative state-of-theart Multimodal LLMs (MLLMs) reveal persistent gaps in multimodal MCP tool use, particularly in argument fidelity and structure consistency, underscoring the need for methods that jointly reason over images, text, and tool graphs. Our Benchmark’s anonymous repository is athttps://github.com/EtaYang10th/Open-M3-Bench This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548048",
    "title": "M3-Bench: Multi-Modal, Multi-Hop, Multi-Threaded Tool-Using MLLM Agent Benchmark",
    "authors": [
      "Difei Gu"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/EtaYang10th/Open-M3-Bench",
    "huggingface_url": "https://huggingface.co/papers/2511.17729",
    "upvote": 16
  }
}