{
  "context": "FuncBind, a framework using neural fields and score-based generative models from computer vision, generates diverse atomic structures across modalities, achieving competitive performance in structure-conditioned molecular design. Generative models for structure-based drug design are often limited to a specific modality, restricting their broader applicability. To address this challenge, we introduce FuncBind, a framework based on computer vision to generatetarget-conditioned,all-atom moleculesacrossatomic systems. FuncBind usesneural fieldsto represent molecules as continuous atomic densities and employsscore-based generative modelswith modern architectures adapted from the computer vision literature. This modality-agnostic representation allows a single unified model to be trained on diverseatomic systems, from small to large molecules, and handle variable atom/residue counts, including non-canonical amino acids. FuncBind achieves competitive in silico performance in generating small molecules,macrocyclic peptides, andantibody complementarity-determining region loops, conditioned on target structures. FuncBind also generated in vitro novel antibody binders viade novo redesignof the complementarity-determining region H3 loop of two chosen co-crystal structures. As a final contribution, we introduce a new dataset and benchmark forstructure-conditionedmacrocyclic peptide generation. The code is available at https://github.com/prescient-design/funcbind. FuncBind is an unified vision-based approach to all-atom structure conditioned molecule generation, accepted at NeurIPS2025.Modeling molecules as atomic density fields, we trained a diffusion model on small molecules, antibody CDRs and cyclic peptides with non-canonicals Highlights:• Scalable vision-based denoiser• Competitive in-silico performance with a single model• Variable number of atoms and/or residues• New dataset and benchmark for macrocyclic peptide generation with non-canonicals.• Validated wet-lab antibody CDR H3 designs 📄 Arxiv:https://arxiv.org/abs/2511.15906💻 Code, weights, datasets (Apache 2.0):https://github.com/prescient-design/funcbind/ This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548102",
    "title": "Unified all-atom molecule generation with neural fields",
    "authors": [
      "Matthieu Kirchmeyer"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/prescient-design/funcbind/",
    "huggingface_url": "https://huggingface.co/papers/2511.15906",
    "upvote": 2
  }
}