{
  "context": "SketchVerify enhances video motion planning and generation by iteratively refining candidate motion plans using a lightweight sketch-based verification process, improving both quality and efficiency. Recent video generation approaches increasingly rely onplanning intermediate control signalssuch asobject trajectoriesto improvetemporal coherenceandmotion fidelity. However, these methods mostly employsingle-shot plansthat are typically limited to simple motions, oriterative refinementwhich requires multiple calls to the video generator, incuring high computational cost. To overcome these limitations, we propose SketchVerify, atraining-free,sketch-verification-based planningframework that improvesmotion planning qualitywith moredynamically coherent trajectories(i.e.,physically plausibleandinstruction-consistent motions) prior to full video generation by introducing atest-time sampling and verification loop. Given apromptand areference image, our method predicts multiplecandidate motion plansand ranks them using avision-language verifierthat jointly evaluatessemantic alignmentwith the instruction andphysical plausibility. To efficiently scorecandidate motion plans, we render each trajectory as a lightweight video sketch by compositing objects over a static background, which bypasses the need for expensive, repeated diffusion-based synthesis while achieving comparable performance. We iteratively refine the motion plan until a satisfactory one is identified, which is then passed to thetrajectory-conditioned generatorfor final synthesis. Experiments onWorldModelBenchandPhyWorldBenchdemonstrate that our method significantly improvesmotion quality,physical realism, andlong-term consistencycompared to competitive baselines while being substantially more efficient. Our ablation study further shows that scaling up the number oftrajectory candidatesconsistently enhances overall performance. Recent video generation approaches increasingly rely on planning intermediate control signals, such as object trajectories, to improve temporal coherence and motion fidelity. However, these methods mostly employ single-shot plans that are typically limited to simple motions, or iterative refinement, which requires multiple calls to the video generator and incurs high computational cost. To overcome these limitations, we propose SketchVerify, a training-free, sketch-verification-based planning framework that improves motion planning quality with dynamically coherent trajectories (i.e., physically plausible and instruction-consistent motions) prior to full video generation, by introducing a test-time sampling and verification loop. Given a prompt and a reference image, our method predicts multiple candidate motion plans and ranks them using a vision–language verifier that jointly evaluates semantic alignment with the instruction and physical plausibility. To efficiently score candidate motion plans, we render each trajectory as a lightweight video sketch by compositing objects over a static background, which bypasses the need for expensive, repeated diffusion-based synthesis while achieving comparable performance. We iteratively refine the motion plan until a satisfactory one is identified, which is then passed to a trajectory-conditioned generator for final synthesis. Experiments on WorldModelBench and PhyWorldBench demonstrate that SketchVerify significantly improves motion quality, physical realism, and long-term consistency compared to strong baselines, while being substantially more efficient. Ablations further show that scaling up the number of trajectory candidates and using multimodal sketch-based verification consistently enhances overall performance. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548101",
    "title": "Planning with Sketch-Guided Verification for Physics-Aware Video Generation",
    "authors": [
      "Jaehong Yoon"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/h6kplus/SketchVerify",
    "huggingface_url": "https://huggingface.co/papers/2511.17450",
    "upvote": 2
  }
}