{
  "context": "DiverseVAR enhances generative diversity in Visual Autoregressive models by modifying the pivotal component of feature maps without additional training, improving synthesis quality. Visual Autoregressive (VAR) modelshave recently garnered significant attention for their innovativenext-scale predictionparadigm, offering notable advantages in bothinference efficiencyandimage qualitycompared to traditional multi-step autoregressive (AR) anddiffusion models. However, despite their efficiency, VAR models often suffer from thediversity collapsei.e., a reduction in output variability, analogous to that observed in few-step distilleddiffusion models. In this paper, we introduceDiverseVAR, a simple yet effective approach that restores thegenerative diversityof VAR models without requiring any additional training. Our analysis reveals the pivotal component of thefeature mapas a key factor governing diversity formation at early scales. By suppressing the pivotal component in the model input and amplifying it in the model output,DiverseVAReffectively unlocks the inherent generative potential of VAR models while preservinghigh-fidelity synthesis. Empirical results demonstrate that our approach substantially enhancesgenerative diversitywith only neglectable performance influences. Our code will be publicly released at https://github.com/wangtong627/DiverseVAR. We introduce DiverseVAR, a simple yet effective approach that restores the generative diversity of VAR models without requiring any additional training. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548079",
    "title": "Diversity Has Always Been There in Your Visual Autoregressive Models",
    "authors": [
      "Tong Wang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/wangtong627/DiverseVAR",
    "huggingface_url": "https://huggingface.co/papers/2511.17074",
    "upvote": 7
  }
}