{
  "context": "MIRA, a multimodal reasoning agent, enhances diffusion-based image editing by iteratively interpreting complex instructions, improving both semantic consistency and perceptual quality. Instruction-guided image editing offers an intuitive way for users to edit images with natural language. However,diffusion-based editing modelsoften struggle to accurately interpret complex user instructions, especially those involving compositional relationships, contextual cues, or referring expressions, leading to edits that drift semantically or fail to reflect the intended changes. We tackle this problem by proposing MIRA (Multimodal Iterative Reasoning Agent), a lightweight, plug-and-playmultimodal reasoning agentthat performs editing through aniterative perception-reasoning-action loop, effectively simulating multi-turn human-model interaction processes. Instead of issuing a single prompt or static plan, MIRA predictsatomic edit instructionsstep by step, usingvisual feedbackto make its decisions. Our 150Kmultimodal tool-use dataset,MIRA-Editing, combined with atwo-stage SFT + GRPO training pipeline, enables MIRA to perform reasoning and editing over complex editing instructions. When paired with open-source image editing models such asFlux.1-Kontext,Step1X-Edit, andQwen-Image-Edit, MIRA significantly improves bothsemantic consistencyandperceptual quality, achieving performance comparable to or exceeding proprietary systems such asGPT-ImageandNano-Banana. The paper proposes a new agentic multimodal large language model (MLLM) designed for iterative, instruction-guided image editing. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548062",
    "title": "MIRA: Multimodal Iterative Reasoning Agent for Image Editing",
    "authors": [
      "Ziyun Zeng",
      "Hang Hua"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.21087",
    "upvote": 10
  }
}