{
  "context": "STARFlow-V, a normalizing flow-based video generator, offers end-to-end learning, robust causal prediction, and high-quality video generation with practical sampling efficiency. Normalizing flows(NFs) are end-to-endlikelihood-based generative modelsfor continuous data, and have recently regained attention with encouraging progress on image generation. Yet in thevideo generationdomain, where spatiotemporal complexity and computational cost are substantially higher, state-of-the-art systems almost exclusively rely on diffusion-based models. In this work, we revisit this design space by presenting STARFlow-V, a normalizing flow-based video generator with substantial benefits such as end-to-end learning, robust causal prediction, and native likelihood estimation. Building upon the recently proposed STARFlow, STARFlow-V operates in thespatiotemporal latent spacewith aglobal-local architecturewhich restricts causal dependencies to a global latent space while preserving rich local within-frame interactions. This eases error accumulation over time, a common pitfall of standard autoregressive diffusion model generation. Additionally, we proposeflow-score matching, which equips the model with a light-weightcausal denoiserto improve thevideo generationconsistency in an autoregressive fashion. To improve the sampling efficiency, STARFlow-V employs a video-awareJacobi iteration schemethat recasts inner updates as parallelizable iterations without breaking causality. Thanks to the invertible structure, the same model can natively supporttext-to-video,image-to-videoas well asvideo-to-video generationtasks. Empirically, STARFlow-V achieves strong visual fidelity and temporal consistency with practical sampling throughput relative to diffusion-based baselines. These results present the first evidence, to our knowledge, thatNFsare capable of high-quality autoregressivevideo generation, establishing them as a promising research direction for buildingworld models. Code and generated samples are available at https://github.com/apple/ml-starflow. This paper introduces the first normalizing flow-based video model for high quality autoregressive video generation. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548024",
    "title": "STARFlow-V: End-to-End Video Generative Modeling with Normalizing Flow",
    "authors": [
      "Jiatao Gu"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/apple/ml-starflow",
    "huggingface_url": "https://huggingface.co/papers/2511.20462",
    "upvote": 31
  }
}