{
  "context": "A unified framework using diffusion models with semantic control and cross-medium style augmentation generates consistent and high-fidelity multi-media painting processes, supported by a comprehensive dataset and evaluation metrics. Step-by-step painting tutorials are vital for learning artistic techniques, but existing video resources (e.g., YouTube) lack interactivity and personalization. While recent generative models have advanced artistic image synthesis, they struggle to generalize across media and often show temporal or structural inconsistencies, hindering faithful reproduction of human creative workflows. To address this, we propose a unified framework for multi-media painting process generation with asemantics-driven style controlmechanism that embeds multiple media into adiffusion modelsconditional space and usescross-medium style augmentation. This enables consistenttexture evolutionandprocess transferacross styles. Areverse-painting training strategyfurther ensures smooth, human-aligned generation. We also build a large-scale dataset of real painting processes and evaluate cross-media consistency, temporal coherence, and final-image fidelity, achieving strong results onLPIPS,DINO, andCLIP metrics. Finally, ourPerceptual Distance Profile (PDP)curve quantitatively models the creative sequence, i.e., composition, color blocking, and detail refinement, mirroring human artistic progression. Project Page:https://markus-pobitzer.github.io/lplp/GitHub:https://github.com/Markus-Pobitzer/wlp This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548051",
    "title": "Loomis Painter: Reconstructing the Painting Process",
    "authors": [
      "Markus Pobitzer"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/Markus-Pobitzer/wlp",
    "huggingface_url": "https://huggingface.co/papers/2511.17344",
    "upvote": 15
  }
}