{
  "context": "MergeDNA uses a hierarchical architecture with Token Merging and latent Transformers to model genomic sequences, achieving superior performance on DNA benchmarks and multi-omics tasks. Modeling genomic sequences faces two unsolved challenges: the information density varies widely across different regions, while there is no clearly defined minimum vocabulary unit. Relying on either four primitive bases or independently designed DNA tokenizers, existing approaches with naive masked language modeling pre-training often fail to adapt to the varying complexities of genomic sequences. LeveragingToken Mergingtechniques, this paper introduces a hierarchical architecture that jointly optimizes adynamic genomic tokenizerandlatent Transformerswithcontext-aware pre-trainingtasks. As for network structures, the tokenization module automatically chunks adjacent bases into words by stacking multiple layers of thedifferentiable token merging blockswith local-window constraints, then aLatent Encodercaptures the global context of these merged words byfull-attention blocks. Symmetrically employing aLatent Decoderand aLocal Decoder, MergeDNA learns with two pre-training tasks:Merged Token Reconstructionsimultaneously trains the dynamic tokenization module and adaptively filters important tokens, whileAdaptive Masked Token Modelinglearns to predict these filtered tokens to capture informative contents. Extensive experiments show that MergeDNA achieves superior performance on three popularDNA benchmarksand severalmulti-omics taskswith fine-tuning or zero-shot evaluation, outperforming typical tokenization methods and large-scale DNA foundation models. MergeDNA (AAAI'26 Oral Presentation) To tackle the tokenization problem in genomics, we introduce a hierarchical genome sequence modeling framework, called MergeDNA, that learns dynamic tokenization with context-aware pre-training tasks (merged token reconstruction and adaptive masked token prediction) through Token Merging techniques.  This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548075",
    "title": "MergeDNA: Context-aware Genome Modeling with Dynamic Tokenization through Token Merging",
    "authors": [
      "Siyuan Li"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.14806",
    "upvote": 8
  }
}