{
  "context": "GeoVista, an agentic model integrating tool invocation and reinforcement learning, achieves high geolocalization performance on GeoBench, outperforming open-source models and matching closed-source models. Current research on agentic visual reasoning enables deep multimodal understanding but primarily focuses on image manipulation tools, leaving a gap toward more general-purpose agentic models. In this work, we revisit thegeolocalizationtask, which requires not only nuanced visual grounding but also web search to confirm or refine hypotheses during reasoning. Since existinggeolocalizationbenchmarks fail to meet the need for high-resolution imagery and the localization challenge for deep agentic reasoning, we curateGeoBench, a benchmark that includes photos and panoramas from around the world, along with a subset of satellite images of different cities to rigorously evaluate thegeolocalizationability of agentic models. We also proposeGeoVista, an agentic model that seamlessly integrates tool invocation within the reasoning loop, including animage-zoom-in toolto magnify regions of interest and aweb-search toolto retrieve related web information. We develop a complete training pipeline for it, including acold-start supervised fine-tuning(SFT) stage to learn reasoning patterns and tool-use priors, followed by areinforcement learning(RL) stage to further enhance reasoning ability. We adopt ahierarchical rewardto leverage multi-level geographical information and improve overallgeolocalizationperformance. Experimental results show thatGeoVistasurpasses other open-source agentic models on thegeolocalizationtask greatly and achieves performance comparable to closed-source models such asGemini-2.5-flashandGPT-5on most metrics. IntroducingGeoVista:Web-Augmented Agentic Visual Reasoning for Geolocalization🌍 🤔 Ever wondered how a reasoning model can guess where a photo was taken? And how well today’s reasoning models actually perform on this task? We presentGeoVista, the first open-sourced reasoning model that seamlessly integrates tool use (e.g., web search) into its reasoning loop, achieving strong performance on real-world geolocalization.We also releaseGeoVista-Bench (GeoBench), the first benchmark designed to evaluate agentic models’ general geolocalization ability. Project page:https://ekonwang.github.io/geo-vista/ Code:https://github.com/ekonwang/GeoVistaTechnical report:https://arxiv.org/abs/2511.15705X:https://x.com/YikunWangLibra/status/1992576303158190394 This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548005",
    "title": "GeoVista: Web-Augmented Agentic Visual Reasoning for Geolocalization",
    "authors": [
      "Yikun Wang",
      "Zuyan Liu",
      "Yongming Rao"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/ekonwang/GeoVista",
    "huggingface_url": "https://huggingface.co/papers/2511.15705",
    "upvote": 93
  }
}