{
  "context": "MajutsuCity is a natural language-driven framework that synthesizes 3D urban scenes with high structural consistency, stylistic diversity, and controllability through a four-stage pipeline and interactive editing agent. Generating realistic 3D cities is fundamental to world models, virtual reality, and game development, where an ideal urban scene must satisfy both stylistic diversity, fine-grained, and controllability. However, existing methods struggle to balance the creative flexibility offered by text-based generation with the object-level editability enabled by explicit structural representations. We introduce MajutsuCity, anatural language-drivenandaesthetically adaptiveframework for synthesizingstructurally consistentandstylistically diverse3D urban scenes. MajutsuCity represents a city as a composition ofcontrollable layouts,assets, andmaterials, and operates through a four-stage pipeline. To extend controllability beyond initial generation, we further integrate MajutsuAgent, aninteractive language-grounded editing agent} that supports five object-level operations. To support photorealistic and customizable scene synthesis, we also construct MajutsuDataset, a high-quality multimodal dataset} containing 2Dsemantic layoutsandheight maps, diverse3D building assets, and curatedPBR materialsandskyboxes, each accompanied bydetailed annotations. Meanwhile, we develop a practical set ofevaluation metrics, covering key dimensions such asstructural consistency,scene complexity,material fidelity, andlighting atmosphere. Extensive experiments demonstrate MajutsuCity reduces layout FID by 83.7% compared withCityDreamerand by 20.1% overCityCraft. Our method ranks first across allAQSandRDR scores, outperforming existing methods by a clear margin. These results confirm MajutsuCity as a new state-of-the-art ingeometric fidelity,stylistic adaptability, andsemantic controllabilityfor 3D city generation. We expect our framework can inspire new avenues of research in 3D city generation. Our dataset and code will be released at https://github.com/LongHZ140516/MajutsuCity. Generating realistic 3D cities is fundamental to world models, virtual reality, and game development, where an ideal urban scene must satisfy both stylistic diversity, fine-grained, and controllability. However, existing methods struggle to balance the creative flexibility offered by text-based generation with the object-level editability enabled by explicit structural representations. We introduce MajutsuCity, a natural language-driven and aesthetically adaptive framework for synthesizing structurally consistent and stylistically diverse 3D urban scenes. MajutsuCity represents a city as a composition of controllable layouts, assets, and materials, and operates through a four-stage pipeline. To extend controllability beyond initial generation, we further integrate MajutsuAgent, an interactive language-grounded editing agent} that supports five object-level operations. To support photorealistic and customizable scene synthesis, we also construct MajutsuDataset, a high-quality multimodal dataset} containing 2D semantic layouts and height maps, diverse 3D building assets, and curated PBR materials and skyboxes, each accompanied by detailed annotations. Meanwhile, we develop a practical set of evaluation metrics, covering key dimensions such as structural consistency, scene complexity, material fidelity, and lighting atmosphere. Extensive experiments demonstrate MajutsuCity reduces layout FID by 83.7% compared with CityDreamer and by 20.1% over CityCraft. Our method ranks first across all AQS and RDR scores, outperforming existing methods by a clear margin. These results confirm MajutsuCity as a new state-of-the-art in geometric fidelity, stylistic adaptability, and semantic controllability for 3D city generation. We expect our framework can inspire new avenues of research in 3D city generation. Arxiv：https://arxiv.org/abs/2511.20415Project Page：https://longhz140516.github.io/MajutsuCity/Github(code comming soon)：https://github.com/LongHZ140516/MajutsuCity This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548070",
    "title": "MajutsuCity: Language-driven Aesthetic-adaptive City Generation with Controllable 3D Assets and Layouts",
    "authors": [
      "Zilong Huang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/LongHZ140516/MajutsuCity",
    "huggingface_url": "https://huggingface.co/papers/2511.20415",
    "upvote": 8
  }
}