{
  "context": "ViLoMem, a dual-stream memory framework, enhances MLLMs by preserving multimodal semantic knowledge, reducing errors, and improving accuracy across benchmarks. MLLMs exhibit strong reasoning on isolated queries, yet they operate de novo -- solving each problem independently and often repeating the same mistakes. Existingmemory-augmented agentsmainly store past trajectories for reuse. However,trajectory-based memorysuffers frombrevity bias, gradually losing essential domain knowledge. More critically, even in trulymultimodal problem-solvingsettings, it records only a single-modality trace of past behavior, failing to preserve howvisual attentionandlogical reasoningjointly contributed to the solution. This is fundamentally misaligned with human cognition:semantic memoryis both multimodal and integrated, preserving visual and abstract knowledge through coordinated but distinct representational streams. We thus introduceViLoMem, adual-stream memoryframework that constructs compact,schema-based memory. It separately encodesvisual distraction patternsandlogical reasoning errors, enabling MLLMs to learn from their successful and failed experiences. Following a grow-and-refine principle, the system incrementally accumulates and updates multimodal semantic knowledge -- preserving stable, generalizable strategies while avoidingcatastrophic forgetting. Across six multimodal benchmarks,ViLoMemconsistently improvespass@1 accuracyand substantially reduces repeated visual and logical errors. Ablations confirm the necessity ofdual-stream memorywith explicit distraction--hallucination separation, demonstrating the value of error-aware multimodal memory for lifelong and cross-domain agentic learning. Our project page will be available at https://weihao-bo.github.io/ViLoMeo-page. ViLoMem is a plug-in dual-stream memory framework for multimodal reasoning, featuring a closed-loop Memory Cycle that enables continuous learning from reasoning and perception errors. Key Components(a) Memory Cycle: A closed-loop learning mechanism where both logical and visual memories are retrieved and utilized by the solver. The verifier evaluates actions to filter redundant trajectories and update both memory streams.(b) Memory Generation: An error-attribution framework using LLM for logical analysis and MLLM for visual analysis, producing structured memory schemas through similarity-based merge and create operations.(c) Memory Retrieval: Specialized dual-stream retrieval—visual memories undergo image-embedding retrieval followed by question-specific filtering; logical memories are retrieved through problem analysis and text-embedding similarity. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548054",
    "title": "Agentic Learner with Grow-and-Refine Multimodal Semantic Memory",
    "authors": [
      "Weihao Bo",
      "Yanpeng Sun"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/weihao-bo/ViLoMem",
    "huggingface_url": "https://huggingface.co/papers/2511.21678",
    "upvote": 12
  }
}