{
  "context": "GigaEvo is an open-source framework for LLM-guided evolutionary computation, offering modular and concurrent tools for research and experimentation in solving complex optimization problems. Recent advances inLLM-guided evolutionary computation, particularlyAlphaEvolve(Novikov et al., 2025; Georgiev et al., 2025), have demonstrated remarkable success in discovering novel mathematical constructions and solving challenging optimization problems. However, the high-level descriptions in published work leave many implementation details unspecified, hindering reproducibility and further research. In this report we present GigaEvo, an extensible open-source framework that enables researchers to study and experiment with hybrid LLM-evolution approaches inspired byAlphaEvolve. Our system provides modular implementations of key components:MAP-Elitesquality-diversity algorithms,asynchronous DAG-based evaluationpipelines,LLM-driven mutationoperators with insight generation andbidirectional lineage tracking, and flexiblemulti-island evolutionary strategies. In order to assess reproducibility and validate our implementation we evaluate GigaEvo on challenging problems from theAlphaEvolvepaper:Heilbronn triangle placement,circle packingin squares, andhigh-dimensional kissing numbers. The framework emphasizes modularity, concurrency, and ease of experimentation, enabling rapid prototyping through declarative configuration. We provide detailed descriptions of system architecture, implementation decisions, and experimental methodology to support further research in LLM driven evolutionary methods. The GigaEvo framework and all experimental code are available at https://github.com/AIRI-Institute/gigaevo-core. Recent advances in LLM-guided evolutionary computation, particularly AlphaEvolve (Novikov et al., 2025; Georgiev et al., 2025), have demonstrated remarkable success in discovering novel mathematical constructions and solving challenging optimization problems. However, the high-level descriptions in published work leave many implementation details unspecified, hindering reproducibility and further research. In this report we present GigaEvo, an extensible open-source framework that enables researchers to study and experiment with hybrid LLM-evolution approaches inspired by AlphaEvolve. Our system provides modular implementations of key components: MAP-Elites quality-diversity algorithms, asynchronous DAG-based evaluation pipelines, LLM-driven mutation operators with insight generation and bidirectional lineage tracking, and flexible multi-island evolutionary strategies. In order to assess reproducibility and validate our implementation we evaluate GigaEvo on challenging problems from the AlphaEvolve paper: Heilbronn triangle placement, circle packing in squares, and high-dimensional kissing numbers. The framework emphasizes modularity, concurrency, and ease of experimentation, enabling rapid prototyping through declarative configuration. We provide detailed descriptions of system architecture, implementation decisions, and experimental methodology to support further research in LLM driven evolutionary methods. The GigaEvo framework and all experimental code are available athttps://github.com/FusionBrainLab/gigaevo-core This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend arXiv explained breakdown of this paper 👉https://arxivexplained.com/papers/gigaevo-an-open-source-optimization-framework-powered-by-llms-and-evolution-algorithms arXiv lens breakdown of this paper 👉https://arxivlens.com/PaperView/Details/gigaevo-an-open-source-optimization-framework-powered-by-llms-and-evolution-algorithms-8623-3eeef499 ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548003",
    "title": "GigaEvo: An Open Source Optimization Framework Powered By LLMs And Evolution Algorithms",
    "authors": [
      "Andrey Galichin",
      "Oleg Travkin"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/FusionBrainLab/gigaevo-core",
    "huggingface_url": "https://huggingface.co/papers/2511.17592",
    "upvote": 118
  }
}