{
  "context": "Harmony addresses audio-visual synchronization in generative AI by introducing a Cross-Task Synergy training paradigm, Global-Local Decoupled Interaction Module, and Synchronization-Enhanced CFG to improve alignment and fidelity. The synthesis of synchronized audio-visual content is a key challenge in generative AI, with open-source models facing challenges in robust audio-video alignment. Our analysis reveals that this issue is rooted in three fundamental challenges of thejoint diffusion process: (1)Correspondence Drift, where concurrently evolving noisy latents impede stable learning of alignment; (2) inefficientglobal attention mechanismsthat fail to capture fine-grainedtemporal cues; and (3) theintra-modal biasof conventionalClassifier-Free Guidance(CFG), which enhances conditionality but not cross-modal synchronization. To overcome these challenges, we introduce Harmony, a novel framework that mechanistically enforces audio-visual synchronization. We first propose aCross-Task Synergytraining paradigm to mitigate drift by leveraging strong supervisory signals from audio-driven video and video-driven audio generation tasks. Then, we design aGlobal-Local Decoupled Interaction Modulefor efficient and precise temporal-style alignment. Finally, we present a novelSynchronization-Enhanced CFG(SyncCFG) that explicitly isolates and amplifies the alignment signal during inference. Extensive experiments demonstrate that Harmony establishes a new state-of-the-art, significantly outperforming existing methods in both generation fidelity and, critically, in achieving fine-grained audio-visual synchronization. The project page is available at:https://sjtuplayer.github.io/projects/Harmony/ This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548034",
    "title": "Harmony: Harmonizing Audio and Video Generation through Cross-Task Synergy",
    "authors": [
      "Guozhen Zhang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/sjtuplayer/Harmony",
    "huggingface_url": "https://huggingface.co/papers/2511.21579",
    "upvote": 23
  }
}