{
  "context": "Reducing the capacity of large language models disproportionately impacts visual capabilities in multimodal systems, but visual extraction tuning combined with step-by-step reasoning improves efficiency and performance. Scaling upmultimodal modelshas enabled remarkable advances in visual understanding and reasoning, but practical demands call for smaller, efficient systems. In this work, we conduct a principled analysis ofdownscalingintelligence inmultimodal models, examining how reducedlarge language model (LLM)capacity affects multimodal capabilities. Our initial findings reveal an interesting trend: LLMdownscalingdisproportionately affectsvisual capabilities, rather than abilities inherited from the LLM. We then examine whether this drop mainly reflects the expected decline in visual reasoning or a more fundamental loss of perceptual abilities. Isolating the effect of LLMdownscalingon perception, we find performance still drops sharply, often matching or exceeding the impact on reasoning. To address this bottleneck, we introducevisual extraction tuning, which explicitly trains the model to extract instruction-relevant visual details consistently across tasks. With these extracted visual details, we then apply step-by-step reasoning to generate answers. Together, these components form ourExtract+Think approach, setting a new standard for efficiency and performance in this space. 📄 Paper:https://arxiv.org/abs/2511.17487🌎 Website:https://web.stanford.edu/~markendo/projects/downscaling_intelligence🔧 Code:https://github.com/markendo/downscaling_intelligence This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548064",
    "title": "Downscaling Intelligence: Exploring Perception and Reasoning Bottlenecks in Small Multimodal Models",
    "authors": [
      "Mark Endo"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/markendo/downscaling_intelligence",
    "huggingface_url": "https://huggingface.co/papers/2511.17487",
    "upvote": 10
  }
}