{
  "context": "G$^2$VLM integrates 3D geometry learning with vision-language models to enhance spatial understanding and reasoning, outperforming existing models in these tasks. Vision-Language Models (VLMs) still lack robustness in spatial intelligence, demonstrating poor performance onspatial understandingand reasoning tasks. We attribute this gap to the absence of a visual geometry learning process capable of reconstructing 3D space from 2D images. We present G^2VLM, ageometry grounded vision-language modelthat bridges two fundamental aspects of spatial intelligence:spatial 3D reconstructionandspatial understanding. G^2VLM natively leverages learned 3D visual geometry features to directly predict 3D attributes and enhancespatial reasoningtasks viain-context learningandinterleaved reasoning. Our unified design is highly scalable forspatial understanding: it trains on abundantmulti-view imageandvideo data, while simultaneously leveraging the benefits of3D visual priorsthat are typically only derived from hard-to-collect annotations. Experimental results demonstrate G^2VLM is proficient in both tasks, achieving comparable results to state-of-the-artfeed-forward 3D reconstruction modelsand achieving better or competitive results acrossspatial understandingand reasoning tasks. By unifying a semantically strong VLM with low-level 3D vision tasks, we hope G^2VLM can serve as a strong baseline for the community and unlock more future applications, such as 3D scene editing. 🚀 Introducing G2VLM: Geometry Grounded Vision Language Model with Unified 3D Reconstruction and Spatial Reasoning This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548069",
    "title": "G^2VLM: Geometry Grounded Vision Language Model with Unified 3D Reconstruction and Spatial Reasoning",
    "authors": [
      "Wenbo Hu",
      "Runsen Xu"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/InternRobotics/G2VLM",
    "huggingface_url": "https://huggingface.co/papers/2511.21688",
    "upvote": 8
  }
}