{
  "context": "Upsample Anything is a lightweight test-time optimization framework that enhances low-resolution features to high-resolution outputs without training, using an anisotropic Gaussian kernel for precise reconstruction in tasks like semantic segmentation and depth estimation. We present Upsample Anything, a lightweighttest-time optimization(TTO) framework that restores low-resolution features to high-resolution, pixel-wise outputs without any training. AlthoughVision Foundation Modelsdemonstrate strong generalization across diverse downstream tasks, their representations are typically downsampled by 14x/16x (e.g., ViT), which limits their direct use in pixel-level applications. Existingfeature upsamplingapproaches depend on dataset-specific retraining or heavy implicit optimization, restricting scalability and generalization. Upsample Anything addresses these issues through a simple per-image optimization that learns ananisotropic Gaussian kernelcombining spatial and range cues, effectively bridgingGaussian SplattingandJoint Bilateral Upsampling. The learned kernel acts as a universal, edge-aware operator that transfers seamlessly across architectures and modalities, enabling precise high-resolution reconstruction of features, depth, or probability maps. It runs in only approx0.419 s per 224x224 image and achieves state-of-the-art performance onsemantic segmentation,depth estimation, and both depth andprobability map upsampling. Project page: https://seominseok0429.github.io/Upsample-Anything/{https://seominseok0429.github.io/Upsample-Anything/} This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548083",
    "title": "Upsample Anything: A Simple and Hard to Beat Baseline for Feature Upsampling",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/seominseok0429/Upsample-Anything-A-Simple-and-Hard-to-Beat-Baseline-for-Feature-Upsampling",
    "huggingface_url": "https://huggingface.co/papers/2511.16301",
    "upvote": 6
  }
}