{
  "context": "O-Mem, an active user profiling memory framework, enhances contextual consistency and dynamic personalization in LLM-powered agents, improving performance on benchmarks and response efficiency. Recent advancements inLLM-powered agentshave demonstrated significant potential in generating human-like responses; however, they continue to face challenges in maintaining long-term interactions within complex environments, primarily due to limitations incontextual consistencyanddynamic personalization. Existing memory systems often depend on semantic grouping prior to retrieval, which can overlook semantically irrelevant yet critical user information and introduce retrieval noise. In this report, we propose the initial design of O-Mem, a novelmemory frameworkbased onactive user profilingthat dynamically extracts and updates user characteristics and event records from their proactive interactions with agents. O-Mem supportshierarchical retrievalofpersona attributesandtopic-related context, enabling more adaptive and coherent personalized responses. O-Mem achieves 51.67% on the publicLoCoMo benchmark, a nearly 3% improvement uponLangMem,the previous state-of-the-art, and it achieves 62.99% onPERSONAMEM, a 3.5% improvement uponA-Mem,the previous state-of-the-art. O-Mem also boosts token andinteraction response timeefficiency compared to previousmemory frameworks. Our work opens up promising directions for developing efficient and human-like personalized AI assistants in the future. Recent advancements in LLM-powered agents have demonstrated significant potential in generating human-like responses; however, they continue to face challenges in maintaining long-term interactions within complex environments, primarily due to limitations in contextual consistency and dynamic personalization. Existing memory systems often depend on semantic grouping prior to retrieval, which can overlook semantically irrelevant yet critical user information and introduce retrieval noise. In this report, we propose the initial design of O-Mem, a novel memory framework based on active user profiling that dynamically extracts and updates user characteristics and event records from their proactive interactions with agents. O-Mem supports hierarchical retrieval of persona attributes and topic-related context, enabling more adaptive and coherent personalized responses. O-Mem achieves 51.67% on the public LoCoMo benchmark, a nearly 3% improvement upon LangMem,the previous state-of-the-art, and it achieves 62.99% on PERSONAMEM, a 3.5% improvement upon A-Mem,the previous state-of-the-art. O-Mem also boosts token and interaction response time efficiency compared to previous memory frameworks. Our work opens up promising directions for developing efficient and human-like personalized AI assistants in the future. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548032",
    "title": "O-Mem: Omni Memory System for Personalized, Long Horizon, Self-Evolving Agents",
    "authors": [
      "Motong Tian"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.13593",
    "upvote": 25
  }
}