{
  "context": "UniGame, a self-adversarial post-training framework, improves consistency, understanding, generation, and robustness in unified multimodal models by introducing a lightweight perturber at the shared token interface. Unified Multimodal Models(UMMs) have shown impressive performance in both understanding and generation with a single architecture. However, UMMs still exhibit a fundamental inconsistency: understanding favorscompact embeddings, whereas generation favorsreconstruction-rich representations. This structural trade-off produces misaligneddecision boundaries, degradedcross-modal coherence, and heightened vulnerability under distributional andadversarial shifts. In this paper, we present UniGame, aself-adversarialpost-training frameworkthat directly targets the inconsistencies. By applying a lightweight perturber at the shared token interface, UniGame enables the generation branch to actively seek and challenge fragile understanding, turning the model itself into its own adversary. Experiments demonstrate that UniGame significantly improves the consistency (+4.6%). Moreover, it also achieves substantial improvements in understanding (+3.6%), generation (+0.02), out-of-distribution and adversarial robustness (+4.8% and +6.2% on NaturalBench and AdVQA). The framework is architecture-agnostic, introduces less than 1% additional parameters, and is complementary to existing post-training methods. These results positionadversarial self-playas a general and effective principle for enhancing the coherence, stability, and unified competence of futuremultimodal foundation models. The official code is available at: https://github.com/AIFrontierLab/UniGame Solving inconsistency issues of Unified Multimodal Models This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548039",
    "title": "UniGame: Turning a Unified Multimodal Model Into Its Own Adversary",
    "authors": [
      "Zhaolong Su"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/AIFrontierLab/UniGame",
    "huggingface_url": "https://huggingface.co/papers/2511.19413",
    "upvote": 20
  }
}