{
  "context": "The frequency-DeCoupled pixel diffusion framework improves image generation efficiency and quality by separating high-frequency details and low-frequency semantics, achieving superior performance compared to existing pixel diffusion models. Pixel diffusionaims to generate images directly inpixel spacein an end-to-end fashion. This approach avoids the limitations ofVAEin the two-stagelatent diffusion, offering higher model capacity. Existingpixel diffusionmodels suffer from slow training and inference, as they usually model both high-frequency signals and low-frequency semantics within a singlediffusion transformer (DiT). To pursue a more efficientpixel diffusionparadigm, we propose thefrequency-DeCoupled pixel diffusionframework. With the intuition to decouple the generation of high and low frequency components, we leverage alightweight pixel decoderto generate high-frequency details conditioned onsemantic guidancefrom the DiT. This thus frees the DiT to specialize in modeling low-frequency semantics. In addition, we introduce afrequency-aware flow-matching lossthat emphasizes visually salient frequencies while suppressing insignificant ones. Extensive experiments show that DeCo achieves superior performance amongpixel diffusionmodels, attainingFIDof 1.62 (256x256) and 2.22 (512x512) onImageNet, closing the gap withlatent diffusionmethods. Furthermore, our pretrained text-to-image model achieves a leading overall score of 0.86 onGenEvalin system-level comparison. Codes are publicly available at https://github.com/Zehong-Ma/DeCo. Arxiv:https://arxiv.org/abs/2511.19365Project Page:https://zehong-ma.github.io/DeCoCode Repository:https://github.com/Zehong-Ma/DeCoHuggingface Space:https://14467288703cf06a3c.gradio.live/   Pretty cool and possibly can be generalized on higher resolutions. Are there any plans to expand this further? ControlNets maybe? all recent SOTA models completely failing with precise adhering to control signals, SDXL is the last model capable to do it properly... and this approach seems to be able to incorporate ControlNets naturally This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548010",
    "title": "DeCo: Frequency-Decoupled Pixel Diffusion for End-to-End Image Generation",
    "authors": [
      "Zehong Ma",
      "Longhui Wei",
      "Shuai Wang",
      "Shiliang Zhang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/Zehong-Ma/DeCo",
    "huggingface_url": "https://huggingface.co/papers/2511.19365",
    "upvote": 64
  }
}