{
  "context": "Inferix is a next-generation inference engine designed for immersive world synthesis using semi-autoregressive decoding, combining diffusion and autoregressive methods for high-quality, real-time video generation and interaction. World modelsserve as core simulators for fields such asagentic AI,embodied AI, andgaming, capable of generating long, physically realistic, and interactive high-quality videos. Moreover, scaling these models could unlock emergent capabilities invisual perception,understanding, andreasoning, paving the way for a new paradigm that moves beyond current LLM-centric vision foundation models. A key breakthrough empowering them is thesemi-autoregressive(block-diffusion) decoding paradigm, which merges the strengths ofdiffusionandautoregressive methodsby generatingvideo tokensin block-applyingdiffusionwithin each block while conditioning on previous ones, resulting in more coherent and stable video sequences. Crucially, it overcomes limitations of standard videodiffusionby reintroducing LLM-styleKV Cache management, enabling efficient, variable-length, and high-quality generation.\n  Therefore,Inferixis specifically designed as a next-generation inference engine to enable immersive world synthesis through optimizedsemi-autoregressivedecoding processes. This dedicated focus on world simulation distinctly sets it apart from systems engineered for high-concurrency scenarios (likevLLMorSGLang) and from classic videodiffusionmodels (such asxDiTs).Inferixfurther enhances its offering withinteractive video streamingandprofiling, enabling real-time interaction and realistic simulation to accurately model world dynamics. Additionally, it supports efficient benchmarking through seamless integration ofLV-Bench, a new fine-grained evaluation benchmark tailored forminute-long video generationscenarios. We hope the community will work together to advanceInferixand foster world model exploration. World models serve as core simulators for fields such as agentic AI, embodied AI, and gaming, capable of generating long, physically realistic, and interactive high-quality videos. Moreover, scaling these models could unlock emergent capabilities in visual perception, understanding, and reasoning, paving the way for a new paradigm that moves beyond current LLM-centric vision foundation models. A key breakthrough empowering them is the semi-autoregressive (block-diffusion) decoding paradigm, which merges the strengths of diffusion and autoregressive methods by generating video tokens in block-applying diffusion within each block while conditioning on previous ones, resulting in more coherent and stable video sequences. Crucially, it overcomes limitations of standard video diffusion by reintroducing LLM-style KV Cache management, enabling efficient, variable-length, and high-quality generation.Therefore, Inferix is specifically designed as a next-generation inference engine to enable immersive world synthesis through optimized semi-autoregressive decoding processes. This dedicated focus on world simulation distinctly sets it apart from systems engineered for high-concurrency scenarios (like vLLM or SGLang) and from classic video diffusion models (such as xDiTs). Inferix further enhances its offering with interactive video streaming and profiling, enabling real-time interaction and realistic simulation to accurately model world dynamics. Additionally, it supports efficient benchmarking through seamless integration of LV-Bench, a new fine-grained evaluation benchmark tailored for minute-long video generation scenarios. We hope the community will work together to advance Inferix and foster world model exploration. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548015",
    "title": "Inferix: A Block-Diffusion based Next-Generation Inference Engine for World Simulation",
    "authors": [
      "Jiasheng Tang",
      "Zeyu Zhang"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/alibaba-damo-academy/Inferix",
    "huggingface_url": "https://huggingface.co/papers/2511.20714",
    "upvote": 48
  }
}