{
  "context": "DiffSeg30k, a dataset of 30k diffusion-edited images, supports fine-grained detection of AI-generated content through semantic segmentation. Diffusion-based editingenables realistic modification of local image regions, making AI-generated content harder to detect. Existing AIGC detection benchmarks focus on classifying entire images, overlooking the localization of diffusion-based edits. We introduceDiffSeg30k, a publicly available dataset of 30k diffusion-edited images withpixel-level annotations, designed to support fine-grained detection.DiffSeg30kfeatures: 1)In-the-wild images--we collect images or image prompts from COCO to reflect real-world content diversity; 2) Diversediffusion models--local edits using eight SOTAdiffusion models; 3)Multi-turn editing--each image undergoes up to three sequential edits to mimic real-world sequential editing; and 4) Realistic editing scenarios--avision-language model(VLM)-based pipeline automatically identifies meaningful regions and generates context-aware prompts covering additions, removals, and attribute changes.DiffSeg30kshifts AIGC detection from binary classification tosemantic segmentation, enabling simultaneous localization of edits and identification of the editing models. We benchmark three baseline segmentation approaches, revealing significant challenges insemantic segmentationtasks, particularly concerning robustness toimage distortions. Experiments also reveal that segmentation models, despite being trained for pixel-level localization, emerge as highly reliable whole-image classifiers of diffusion edits, outperforming establishedforgery classifierswhile showing great potential incross-generator generalization. We believeDiffSeg30kwill advance research in fine-grained localization of AI-generated content by demonstrating the promise and limitations of segmentation-based methods.DiffSeg30kis released at: https://huggingface.co/datasets/Chaos2629/Diffseg30k 30k edited images from 8 diffusion models, up to 3-turn edits, with pixel-accurate masks for fine-grained AIGC localization + attribution. Dataset:https://huggingface.co/datasets/Chaos2629/Diffseg30k This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2548093",
    "title": "DiffSeg30k: A Multi-Turn Diffusion Editing Benchmark for Localized AIGC Detection",
    "authors": [],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.19111",
    "upvote": 3
  }
}