{
  "context": "A systematic taxonomy for data agents is introduced to clarify their autonomy levels and capabilities, addressing terminological ambiguity and guiding future research and development. The rapid advancement oflarge language models(LLMs) has spurred the\nemergence ofdata agents--autonomous systems designed to orchestrate Data + AI\necosystems for tackling complex data-related tasks. However, the term \"data\nagent\" currently suffers from terminological ambiguity and inconsistent\nadoption, conflating simple query responders with sophisticated autonomous\narchitectures. This terminological ambiguity fosters mismatched user\nexpectations, accountability challenges, and barriers to industry growth.\nInspired by theSAE J3016 standardfordriving automation, this survey\nintroduces the first systematichierarchical taxonomyfordata agents,\ncomprising six levels that delineate and trace progressive shifts in autonomy,\nfrom manual operations (L0) to a vision of generative, fully autonomous data\nagents (L5), thereby clarifying capability boundaries and responsibility\nallocation. Through this lens, we offer a structured review of existing\nresearch arranged by increasing autonomy, encompassing specializeddata agentsfordata management, preparation, and analysis, alongside emerging efforts\ntoward versatile, comprehensive systems with enhanced autonomy. We further\nanalyze critical evolutionary leaps and technical gaps for advancing data\nagents, especially the ongoing L2-to-L3 transition, wheredata agentsevolve\nfrom procedural execution to autonomous orchestration. Finally, we conclude\nwith a forward-looking roadmap, envisioning the advent of proactive, generativedata agents. This survey introduces the first systematic hierarchical taxonomy (L0–L5) for data agents, offers a structured review tracing their autonomy progression across data management, preparation, and analysis tasks, analyzes evolutionary leaps and technical gaps, and provides a forward-looking roadmap envisioning proactive and generative data agents. ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2544013",
    "title": "A Survey of Data Agents: Emerging Paradigm or Overstated Hype?",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/HKUSTDial/awesome-data-agents",
    "huggingface_url": "https://huggingface.co/papers/2510.23587",
    "upvote": 65
  }
}