{
  "context": "Research investigates the behavior of AI agents in simulated two-sided marketplaces to understand their performance, biases, and vulnerabilities in realistic economic conditions. AsLLM agentsadvance, they are increasingly mediating economic decisions,\nranging from product discovery to transactions, on behalf of users. Such\napplications promise benefits but also raise many questions about agent\naccountability andvalue for users. Addressing these questions requires\nunderstanding how agents behave in realistic market conditions. However,\nprevious research has largely evaluated agents in constrained settings, such assingle-task marketplaces(e.g., negotiation) or structured two-agent\ninteractions.Real-world marketsare fundamentally different: they require\nagents to handlediverse economic activitiesand coordinate within large,\ndynamic ecosystems where multiple agents with opaque behaviors may engage in\nopen-ended dialogues. To bridge this gap, we investigate two-sided agentic\nmarketplaces whereAssistant agentsrepresent consumers andService agentsrepresent competing businesses. To study these interactions safely, we developMagentic-Marketplace-- a simulated environment where Assistants and Services\ncan operate. This environment enables us to study key market dynamics: theutility agentsachieve,behavioral biases,vulnerability to manipulation, and\nhowsearch mechanismsshapemarket outcomes. Our experiments show that frontier\nmodels can approachoptimal welfare-- but only under ideal search conditions.\nPerformance degrades sharply with scale, and all models exhibit severefirst-proposal bias, creating 10-30x advantages for response speed over\nquality. These findings reveal how behaviors emerge across market conditions,\ninforming the design of fair and efficient agentic marketplaces. AI agents are starting to shop and buy for us. At the same time, agents are representing and providing customer support on behalf of businesses. We believe that these two sides will soon collide, and create two-sided agentic markets. Think of markets like Ebay but all the buyers & sellers are AI agents acting on behalf of users. But before they handle our money for real, we need to know: Can they find good deals? Do they get tricked? Do they make dumb mistakes? Real markets are messy: hundreds of options, agents with hidden strategies, conversations that can go anywhere. Our approach: Create a safe testing ground where AI shoppers and AI sellers can interact exactly like they would in the real world - searching, haggling, paying. And systematically test what goes wrong. We develop Magentic-Marketplace-- a simulated environment where Assistants and Services can operate. This environment enables us to study key market dynamics: the utility agents achieve, behavioral biases, vulnerability to manipulation, and how search mechanisms shape market outcomes. Our experiments show that frontier models can approach optimal welfare-- but only under ideal search conditions. Performance degrades sharply with scale, and all models exhibit severe first-proposal bias, creating 10-30x advantages for response speed over quality. These findings reveal how behaviors emerge across market conditions, informing the design of fair and efficient agentic marketplaces. Github Repo:https://github.com/microsoft/multi-agent-marketplace  ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2544090",
    "title": "Magentic Marketplace: An Open-Source Environment for Studying Agentic\n  Markets",
    "authors": [
      "Tyler Payne",
      "Akshay Nambi",
      "Kevin Gao",
      "Hussein Mozannar"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/microsoft/multi-agent-marketplace",
    "huggingface_url": "https://huggingface.co/papers/2510.25779",
    "upvote": 10
  }
}