{
  "context": "Dream4Drive is a synthetic data generation framework that enhances downstream perception tasks in autonomous driving by decomposing videos into 3D-aware guidance maps and rendering 3D assets, leading to improved performance across various training epochs. Recent advancements indriving world modelsenable controllable generation of\nhigh-qualityRGB videosormultimodal videos. Existing methods primarily focus\non metrics related togeneration qualityandcontrollability. However, they\noften overlook the evaluation ofdownstream perception tasks, which are\nreally crucial for the performance of autonomous driving. Existing\nmethods usually leverage a training strategy that first pretrains on synthetic\ndata and finetunes on real data, resulting in twice the epochs compared to the\nbaseline (real data only). When we double the epochs in the baseline, the\nbenefit ofsynthetic databecomes negligible. To thoroughly demonstrate the\nbenefit ofsynthetic data, we introduce Dream4Drive, a novelsynthetic datageneration framework designed for enhancing thedownstream perception tasks.\nDream4Drive first decomposes the input video into several 3D-aware guidance\nmaps and subsequently renders the3D assetsonto these guidance maps. Finally,\nthe driving world model is fine-tuned to produce the edited, multi-viewphotorealistic videos, which can be used to train the downstream perception\nmodels. Dream4Drive enables unprecedented flexibility in generating multi-view\ncorner cases at scale, significantly boosting corner case perception in\nautonomous driving. To facilitate future research, we also contribute a\nlarge-scale3D asset datasetnamedDriveObj3D, covering the typical categories\nin driving scenarios and enabling diverse 3D-aware video editing. We conduct\ncomprehensive experiments to show that Dream4Drive can effectively boost the\nperformance of downstream perception models under various training epochs.\nPage: https://wm-research.github.io/Dream4Drive/ GitHub Link:\nhttps://github.com/wm-research/Dream4Drive Recent advancements in driving world models enable controllable generation of high-quality RGB videos or multimodal videos. Existing methods primarily focus on metrics related to generation quality and controllability. However, they often overlook the evaluation of downstream perception tasks, which are really crucial for the performance of autonomous driving. Existing methods usually leverage a training strategy that first pretrains on synthetic data and finetunes on real data, resulting in twice the epochs compared to the baseline (real data only). When we double the epochs in the baseline, the benefit of synthetic data becomes negligible. To thoroughly demonstrate the benefit of synthetic data, we introduce Dream4Drive, a novel synthetic data generation framework designed for enhancing the downstream perception tasks. Dream4Drive first decomposes the input video into several 3D-aware guidance maps and subsequently renders the 3D assets onto these guidance maps. Finally, the driving world model is fine-tuned to produce the edited, multi-view photorealistic videos, which can be used to train the downstream perception models. Dream4Drive enables unprecedented flexibility in generating multi-view corner cases at scale, significantly boosting corner case perception in autonomous driving. To facilitate future research, we also contribute a large-scale 3D asset dataset named DriveObj3D, covering the typical categories in driving scenarios and enabling diverse 3D-aware video editing. We conduct comprehensive experiments to show that Dream4Drive can effectively boost the performance of downstream perception models under various training epochs. ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2544091",
    "title": "Rethinking Driving World Model as Synthetic Data Generator for\n  Perception Tasks",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/wm-research/Dream4Drive",
    "huggingface_url": "https://huggingface.co/papers/2510.19195",
    "upvote": 10
  }
}