{
  "context": "DeepAgent, an end-to-end deep reasoning agent, autonomously performs thinking, tool discovery, and action execution using memory folding and reinforcement learning, outperforming baselines in various tool-use and application tasks. Large reasoning models have demonstrated strong problem-solving abilities,\nyet real-world tasks often require external tools and long-horizon\ninteractions. Existing agent frameworks typically follow predefined workflows,\nwhich limit autonomous and global task completion. In this paper, we introduceDeepAgent, an end-to-end deep reasoning agent that performs autonomous\nthinking,tool discovery, andaction executionwithin a single, coherent\nreasoning process. To address the challenges of long-horizon interactions,\nparticularly the context length explosion from multiple tool calls and the\naccumulation of interaction history, we introduce anautonomous memory foldingmechanism that compresses past interactions into structured episodic, working,\nand tool memories, reducing error accumulation while preserving critical\ninformation. To teach general-purpose tool use efficiently and stably, we\ndevelop an end-to-endreinforcement learningstrategy, namelyToolPO, that\nleveragesLLM-simulated APIsand appliestool-call advantage attributionto\nassign fine-grained credit to the tool invocation tokens. Extensive experiments\non eight benchmarks, including general tool-use tasks (ToolBench,API-Bank,TMDB,Spotify,ToolHop) and downstream applications (ALFWorld,WebShop,GAIA,HLE), demonstrate thatDeepAgentconsistently outperforms baselines across both\nlabeled-tool and open-set tool retrieval scenarios. This work takes a step\ntoward more general and capable agents for real-world applications. The code\nand demo are available at https://github.com/RUC-NLPIR/DeepAgent. DeepAgentis an end-to-end deep reasoning agent that performs autonomous thinking, tool discovery, and action execution within a single, coherent reasoning process. This paradigm shifts away from traditional, predefined workflows, allowing the agent to maintain a global perspective on the entire task and dynamically discover tools on an as-needed basis. To handle long-horizon interactions and prevent getting stuck in incorrect exploration paths, we introduce anAutonomous Memory Foldingmechanism. This allows DeepAgent to \"take a breath\" by compressing its interaction history into a structured, brain-inspired memory schema, enabling it to reconsider its strategy and proceed efficiently. Furthermore, we proposeToolPO, an end-to-end reinforcement learning (RL) training method tailored for general tool use, which enhances the agent's proficiency in mastering these complex mechanisms. We conduct extensive experiments on a wide range of benchmarks:  DeepAgentis a reasoning agent with scalable toolsets, capable of tackling general tasks by searching for and using the appropriate tools from over 16,000 RapidAPIs in an end-to-end agentic reasoning process.(Note: Due to some APIs in ToolBench being unavailable, API responses are LLM-simulated in this demo to show the system's normal functionality.)  DeepAgentalso excels at navigation-based tasks (e.g., web browsing, OS interaction, and embodied AI) by using a versatile set of pluggable actions such as moving, looking, and taking.  DeepAgentcan also serve as a powerful research assistant, equipped with specialized tools for web search, browsing, code execution, visual QA, and file processing. I truly like this work's innovation👍 Impressive👍 arXiv explained breakdown of this paper 👉https://arxivexplained.com/papers/deepagent-a-general-reasoning-agent-with-scalable-toolsets Is this an open-source project? ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2544008",
    "title": "DeepAgent: A General Reasoning Agent with Scalable Toolsets",
    "authors": [
      "Wenxiang Jiao",
      "Jiarui Jin",
      "Guanting Dong",
      "Zhicheng Dou"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/RUC-NLPIR/DeepAgent",
    "huggingface_url": "https://huggingface.co/papers/2510.21618",
    "upvote": 99
  }
}