{
  "context": "Early Knowledge Alignment improves retrieval and reasoning in iterative RAG systems by aligning LLMs with relevant knowledge before planning, enhancing performance and efficiency. Retrieval-Augmented Generation(RAG) has emerged as a powerful paradigm forLarge Language Models(LLMs) to address knowledge-intensive queries requiring domain-specific or up-to-date information. To handle complexmulti-hop questionsthat are challenging for single-step retrieval,iterative RAGapproaches incorporatingreinforcement learninghave been proposed. However, existingiterative RAGsystems typically plan to decompose questions without leveraging information about the available retrieval corpus, leading to inefficient retrieval and reasoning chains that cascade into suboptimal performance. In this paper, we introduce Early Knowledge Alignment (EKA), a simple but effective module that aligns LLMs withretrieval setbefore planning initerative RAGsystems withcontextually relevant retrieved knowledge. Extensive experiments on six standard RAG datasets demonstrate that by establishing a stronger reasoning foundation, EKA significantly improvesretrieval precision, reducescascading errors, and enhances both performance and efficiency. Our analysis from anentropy perspectivedemonstrate that incorporating early knowledge reduces unnecessary exploration during the reasoning process, enabling the model to focus more effectively on relevant information subsets. Moreover, EKA proves effective as a versatile, training-free inference strategy that scales seamlessly to large models. Generalization tests across diverse datasets and retrieval corpora confirm the robustness of our approach. Overall, EKA advances the state-of-the-art initerative RAGsystems while illuminating the critical interplay betweenstructured reasoningandefficient explorationinreinforcement learning-augmented frameworks. The code is released at https://github.com/yxzwang/EarlyKnowledgeAlignment{Github}. Multi-hop Reasoning via Early Knowledge Alignment arXiv lens breakdown of this paper 👉https://arxivlens.com/PaperView/Details/multi-hop-reasoning-via-early-knowledge-alignment-2979-17d59dca I've created an interactive EKA (Early Knowledge Alignment) demo that visualizes how early knowledge improves multi-hop reasoning. https://prashant-knows-it.github.io/eka-rag-demo/ ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2552076",
    "title": "Multi-hop Reasoning via Early Knowledge Alignment",
    "authors": [],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2512.20144",
    "upvote": 6
  }
}