{
  "context": "VA-$\\pi$ optimizes autoregressive visual generators using a pixel-space objective to improve image quality and performance without retraining tokenizers or using external rewards. Autoregressive (AR) visual generationrelies ontokenizersto map images to and fromdiscrete sequences. However,tokenizersare trained to reconstruct clean images from ground-truth tokens, while AR generators are optimized only for token likelihood. Thismisalignment leads to generated token sequences that may decode into low-quality images, without direct supervision from the pixel space. We propose VA-π, a lightweight post-training framework that directly optimizes AR models with a principled pixel-space objective. VA-π formulates the generator-tokenizer alignment as a variational optimization, deriving anevidence lower bound (ELBO)that unifies pixel reconstruction and autoregressive modeling. To optimize under the discrete token space, VA-π introduces areinforcement-based alignmentstrategy that treats the AR generator as apolicy, uses pixel-space reconstruction quality as itsintrinsic reward. The rewardismeasured by how well the predicted token sequences can reconstruct the original image underteacher forcing, giving the model direct pixel-level guidance without expensive free-running sampling. The regularization term of the ELBO serves as a natural regularizer, maintainingdistributional consistencyof tokens. VA-π enables rapid adaptation of existing AR generators, without neither tokenizer retraining nor external reward models. With only 1% ImageNet-1K data and 25 minutes of tuning, it reducesFIDfrom 14.36 to 7.65 and improvesISfrom 86.55 to 116.70 onLlamaGen-XXL, while also yielding notable gains in the text-to-image task onGenEvalfor both visual generation model (LlamaGen: from 0.306 to 0.339) and unified multi-modal model (Janus-Pro: from 0.725 to 0.744). Codeisavailable at https://github.com/Lil-Shake/VA-Pi. Autoregressive (AR) visual generation relies on tokenizers to map images to and from discrete sequences. However, tokenizers are trained to reconstruct clean images from ground-truth tokens, while AR generators are optimized only for token likelihood. This misalignment leads to generated token sequences that may decode into low-quality images, without direct supervision from the pixel space. We propose VA-, a lightweight post-training framework that directly optimizes AR models with a principled pixel-space objective. VA- formulates the generator-tokenizer alignment as a variational optimization, deriving an evidence lower bound (ELBO) that unifies pixel reconstruction and autoregressive modeling. To optimize under the discrete token space, VA- introduces a reinforcement-based alignment strategy that treats the AR generator as a policy, uses pixel-space reconstruction quality as its intrinsic reward. The reward is measured by how well the predicted token sequences can reconstruct the original image under teacher forcing, giving the model direct pixel-level guidance without expensive free-running sampling. The regularization term of the ELBO serves as a natural regularizer, maintaining distributional consistency of tokens. VA- enables rapid adaptation of existing AR generators, without neither tokenizer retraining nor external reward models. With only 1% ImageNet-1K data and 25 minutes of tuning, it reduces FID from 14.36 to 7.65 and improves IS from 86.55 to 116.70 on LlamaGen-XXL, while also yielding notable gains in the text-to-image task on GenEval for both visual generation model (LlamaGen: from 0.306 to 0.339) and unified multi-modal model (Janus-Pro: from 0.725 to 0.744) arXiv lens breakdown of this paper 👉https://arxivlens.com/PaperView/Details/va-p-variational-policy-alignment-for-pixel-aware-autoregressive-generation-9345-0807d272 This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2552060",
    "title": "VA-π: Variational Policy Alignment for Pixel-Aware Autoregressive Generation",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/Lil-Shake/VA-Pi",
    "huggingface_url": "https://huggingface.co/papers/2512.19680",
    "upvote": 10
  }
}