{
  "context": "ALIGN-Parts addresses semantic 3D part segmentation by aligning implicit 3D part representations with part descriptions using geometric, appearance, and semantic cues, supporting open-vocabulary part naming and creating a unified ontology for multiple datasets. We address semantic3D part segmentation: decomposing objects into parts with meaningful names. While datasets exist with part annotations, their definitions are inconsistent across datasets, limiting robust training. Previous methods produce unlabeled decompositions or retrieve single parts without complete shape annotations. We propose ALIGN-Parts, which formulatespart namingas a directset alignmenttask. Our method decomposes shapes intopartlets- implicit 3D part representations - matched to part descriptions viabipartite assignment. We combine geometric cues from3D part fields, appearance frommulti-view vision features, and semantic knowledge fromlanguage-model-generated affordance descriptions.Text-alignment lossensurespartletsshare embedding space with text, enabling a theoretically open-vocabulary matching setup, given sufficient data. Our efficient and novel, one-shot,3D part segmentationand naming method finds applications in several downstream tasks, including serving as a scalable annotation engine. As our model supportszero-shot matchingto arbitrary descriptions andconfidence-calibrated predictionsfor known categories, with human verification, we create aunified ontologythat aligns PartNet, 3DCoMPaT++, and Find3D, consisting of 1,794 unique 3D parts. We also show examples from our newly createdTex-Parts dataset. We also introduce 2 novel metrics appropriate for the named3D part segmentationtask. We address semantic 3D part segmentation: decomposing objects into parts with meaningful names. While datasets exist with part annotations, their definitions are inconsistent across datasets, limiting robust training. Previous methods produce unlabeled decompositions or retrieve single parts without complete shape annotations. We propose ALIGN-Parts, which formulates part naming as a direct set alignment task. Our method decomposes shapes into partlets - implicit 3D part representations - matched to part descriptions via bipartite assignment. We combine geometric cues from 3D part fields, appearance from multi-view vision features, and semantic knowledge from language-model-generated affordance descriptions. Text-alignment loss ensures partlets share embedding space with text, enabling a theoretically open-vocabulary matching setup, given sufficient data. Our efficient and novel, one-shot, 3D part segmentation and naming method finds applications in several downstream tasks, including serving as a scalable annotation engine. As our model supports zero-shot matching to arbitrary descriptions and confidence-calibrated predictions for known categories, with human verification, we create a unified ontology that aligns PartNet, 3DCoMPaT++, and Find3D, consisting of 1,794 unique 3D parts. We also show examples from our newly created Tex-Parts dataset. We also introduce 2 novel metrics appropriate for the named 3D part segmentation task. arXiv lens breakdown of this paper 👉https://arxivlens.com/PaperView/Details/name-that-part-3d-part-segmentation-and-naming-5636-072180b5 ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2552078",
    "title": "Name That Part: 3D Part Segmentation and Naming",
    "authors": [
      "Prakhar Kaushik"
    ],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2512.18003",
    "upvote": 3
  }
}