{
  "context": "Unified Autoencoding combines semantic and pixel-level information through a frequency-band modulator, resulting in a latent space with state-of-the-art performance on image benchmarks. Deep representations across modalities are inherently intertwined. In this paper, we systematically analyze thespectral characteristicsof various semantic andpixel encoders. Interestingly, our study uncovers a highly inspiring and rarely explored correspondence between an encoder'sfeature spectrumand its functional role:semantic encodersprimarily capturelow-frequency componentsthat encode abstract meaning, whereaspixel encodersadditionally retainhigh-frequency informationthat conveys fine-grained detail. This heuristic finding offers a unifying perspective that ties encoder behavior to its underlying spectral structure. We define it as thePrism Hypothesis, where each data modality can be viewed as a projection of the natural world onto a sharedfeature spectrum, just like the prism. Building on this insight, we proposeUnified Autoencoding(UAE), a model that harmonizes semantic structure and pixel details via an innovativefrequency-band modulator, enabling their seamless coexistence. Extensive experiments onImageNetandMS-COCObenchmarks validate that our UAE effectively unifies semantic abstraction and pixel-level fidelity into a singlelatent spacewith state-of-the-art performance. Deep representations across modalities are inherently intertwined. In this paper, we systematically analyze the spectral characteristics of various semantic and pixel encoders. Interestingly, our study uncovers a highly inspiring and rarely explored correspondence between an encoder's feature spectrum and its functional role: semantic encoders primarily capture low-frequency components that encode abstract meaning, whereas pixel encoders additionally retain high-frequency information that conveys fine-grained detail. This heuristic finding offers a unifying perspective that ties encoder behavior to its underlying spectral structure. We define it as the Prism Hypothesis, where each data modality can be viewed as a projection of the natural world onto a shared feature spectrum, just like the prism. Building on this insight, we propose Unified Autoencoding (UAE), a model that harmonizes semantic structure and pixel details via an innovative frequency-band modulator, enabling their seamless coexistence. Extensive experiments on ImageNet and MS-COCO benchmarks validate that our UAE effectively unifies semantic abstraction and pixel-level fidelity into a single latent space with state-of-the-art performance. The Prism Hypothesis.Our conceptual “prism” decomposes various natural inputs into spectral components along frequency.Low-frequency bands capture global semantics and abstract meaning, while high-frequency bands encode local detail and fine visual texture. This motivates our Unified Autoencoding (UAE), which harmonizes semantic and pixel representations within a single latent space.[code link]:https://github.com/WeichenFan/UAE arXiv lens breakdown of this paper 👉https://arxivlens.com/PaperView/Details/the-prism-hypothesis-harmonizing-semantic-and-pixel-representations-via-unified-autoencoding-3287-d6a6c673 ·Sign uporlog into comment",
  "metadata": {
    "doc_id": "doc2552009",
    "title": "The Prism Hypothesis: Harmonizing Semantic and Pixel Representations via Unified Autoencoding",
    "authors": [
      "Weichen Fan",
      "Haiwen Diao"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/WeichenFan/UAE",
    "huggingface_url": "https://huggingface.co/papers/2512.19693",
    "upvote": 62
  }
}